{
  "Expert in building 3D experiences for the web - Three.js, React Three Fiber, Spline, WebGL, and interactive 3D scenes. Covers product configurators, 3D portfolios, immersive websites, and bringing ...": "Especialista na construção de experiências 3D para web - Three.js, React Three Fiber, Spline, WebGL e cenas 3D interativas. Abrange configuradores de produtos, portfólios 3D, sites imersivos e trazendo ...",
  "Structured guide for setting up A/B tests with mandatory gates for hypothesis, metrics, and execution readiness.": "Guia estruturado para configuração de testes A/B com portas obrigatórias para hipóteses, métricas e prontidão de execução.",
  "You are an accessibility expert specializing in WCAG compliance, inclusive design, and assistive technology compatibility. Conduct audits, identify barriers, and provide remediation guidance.": "Você é um especialista em acessibilidade especializado em conformidade com WCAG, design inclusivo e compatibilidade com tecnologia assistiva. Realize auditorias, identifique barreiras e forneça orientações para remediação.",
  "This skill should be used when the user asks to \"attack Active Directory\", \"exploit AD\", \"Kerberoasting\", \"DCSync\", \"pass-the-hash\", \"BloodHound enumeration\", \"Golden Ticket\", ...": "Esta habilidade deve ser usada quando o usuário pede para \"atacar Active Directory\", \"explorar AD\", \"Kerberoasting\", \"DCSync\", \"pass-the-hash\", \"BloodHound enumeration\", \"Golden Ticket\", ...",
  "Automate ActiveCampaign tasks via Rube MCP (Composio): manage contacts, tags, list subscriptions, automation enrollment, and tasks. Always search tools first for current schemas.": "Automatize tarefas do ActiveCampaign via Rube MCP (Composio): gerencie contatos, tags, assinaturas de listas, inscrição de automação e tarefas. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Use when you need to address review or issue comments on an open GitHub Pull Request using the gh CLI.": "Use quando precisar revisar ou emitir comentários em uma solicitação pull aberta do GitHub usando a gh CLI.",
  "Testing and benchmarking LLM agents including behavioral testing, capability assessment, reliability metrics, and production monitoring—where even top agents achieve less than 50% on re...": "Teste e benchmarking de agentes LLM, incluindo testes comportamentais, avaliação de capacidade, métricas de confiabilidade e monitoramento de produção - onde até mesmo os principais agentes alcançam menos de 50% em re...",
  "Build Azure AI Foundry agents using the Microsoft Agent Framework Python SDK (agent-framework-azure-ai). Use when creating persistent agents with AzureAIAgentsProvider, using hosted tools (code int...": "Crie agentes do Azure AI Foundry usando o Microsoft Agent Framework Python SDK (agent-framework-azure-ai). Use ao criar agentes persistentes com AzureAIAgentsProvider, usando ferramentas hospedadas (código int...",
  "Manage multiple local CLI agents via tmux sessions (start/stop/monitor/assign) with cron-friendly scheduling.": "Gerencie vários agentes CLI locais por meio de sessões tmux (iniciar/parar/monitorar/atribuir) com agendamento amigável ao cron.",
  "A hybrid memory system that provides persistent, searchable knowledge management for AI agents (Architecture, Patterns, Decisions).": "Um sistema de memória híbrida que fornece gerenciamento de conhecimento persistente e pesquisável para agentes de IA (Arquitetura, Padrões, Decisões).",
  "Memory is the cornerstone of intelligent agents. Without it, every interaction starts from zero. This skill covers the architecture of agent memory: short-term (context window), long-term (vector s...": "A memória é a base dos agentes inteligentes. Sem ele, toda interação começa do zero. Esta habilidade cobre a arquitetura da memória do agente: curto prazo (janela de contexto), longo prazo (vetor s...",
  "Systematic improvement of existing agents through performance analysis, prompt engineering, and continuous iteration.": "Melhoria sistemática dos agentes existentes por meio de análise de desempenho, engenharia imediata e iteração contínua.",
  "Optimize multi-agent systems with coordinated profiling, workload distribution, and cost-aware orchestration. Use when improving agent performance, throughput, or reliability.": "Otimize sistemas multiagentes com criação de perfil coordenada, distribuição de carga de trabalho e orquestração com foco nos custos. Use ao melhorar o desempenho, a produtividade ou a confiabilidade do agente.",
  "Tools are how AI agents interact with the world. A well-designed tool is the difference between an agent that works and one that hallucinates, fails silently, or costs 10x more tokens than necessar...": "As ferramentas são a forma como os agentes de IA interagem com o mundo. Uma ferramenta bem projetada é a diferença entre um agente que funciona e outro que tem alucinações, falha silenciosamente ou custa 10 vezes mais tokens do que o necessário...",
  "Build container-based Foundry Agents with Azure AI Projects SDK (ImageBasedHostedAgentDefinition). Use when creating hosted agents with custom container images in Azure AI Foundry.": "Crie agentes de fundição baseados em contêineres com SDK de projetos de IA do Azure (ImageBasedHostedAgentDefinition). Use ao criar agentes hospedados com imagens de contêiner personalizadas no Azure AI Foundry.",
  "AI agent development workflow for building autonomous agents, multi-agent systems, and agent orchestration with CrewAI, LangGraph, and custom agents.": "Fluxo de trabalho de desenvolvimento de agentes de IA para construção de agentes autônomos, sistemas multiagentes e orquestração de agentes com CrewAI, LangGraph e agentes personalizados.",
  "Expert in designing and building autonomous AI agents. Masters tool use, memory systems, planning strategies, and multi-agent orchestration. Use when: build agent, AI agent, autonomous agent, tool ...": "Especialista em projetar e construir agentes autônomos de IA. Domine o uso de ferramentas, sistemas de memória, estratégias de planejamento e orquestração multiagente. Use quando: agente de construção, agente de IA, agente autônomo, ferramenta...",
  "Build production-ready LLM applications, advanced RAG systems, and": "Crie aplicativos LLM prontos para produção, sistemas RAG avançados e",
  "AI and machine learning workflow covering LLM application development, RAG implementation, agent architecture, ML pipelines, and AI-powered features.": "Fluxo de trabalho de IA e aprendizado de máquina que abrange desenvolvimento de aplicativos LLM, implementação de RAG, arquitetura de agente, pipelines de ML e recursos baseados em IA.",
  "Every product will be AI-powered. The question is whether you'll build it right or ship a demo that falls apart in production.  This skill covers LLM integration patterns, RAG architecture, prompt ...": "Cada produto será alimentado por IA. A questão é se você construirá tudo certo ou enviará uma demonstração que desmorona na produção.  Esta habilidade abrange padrões de integração LLM, arquitetura RAG, prompt ...",
  "Expert in building products that wrap AI APIs (OpenAI, Anthropic, etc.) into focused tools people will pay for. Not just 'ChatGPT but different' - products that solve specific problems with AI. Cov...": "Especialista na construção de produtos que envolvem APIs de IA (OpenAI, Anthropic, etc.) em ferramentas específicas pelas quais as pessoas pagarão. Não apenas 'ChatGPT, mas diferente' - produtos que resolvem problemas específicos com IA. Capa...",
  "Build production Apache Airflow DAGs with best practices for operators, sensors, testing, and deployment. Use when creating data pipelines, orchestrating workflows, or scheduling batch jobs.": "Crie DAGs Apache Airflow de produção com práticas recomendadas para operadores, sensores, testes e implantação. Use ao criar pipelines de dados, orquestrar fluxos de trabalho ou agendar trabalhos em lote.",
  "Automate Airtable tasks via Rube MCP (Composio): records, bases, tables, fields, views. Always search tools first for current schemas.": "Automatize tarefas Airtable via Rube MCP (Composio): registros, bases, tabelas, campos, visualizações. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Expert patterns for Algolia search implementation, indexing strategies, React InstantSearch, and relevance tuning Use when: adding search to, algolia, instantsearch, search api, search functionality.": "Padrões especializados para implementação de pesquisa Algolia, estratégias de indexação, React InstantSearch e ajuste de relevância Use quando: adicionar pesquisa a, algolia, pesquisa instantânea, API de pesquisa, funcionalidade de pesquisa.",
  "Creating algorithmic art using p5.js with seeded randomness and interactive parameter exploration. Use this when users request creating art using code, generative art, algorithmic art, flow fields,...": "Criação de arte algorítmica usando p5.js com aleatoriedade semeada e exploração interativa de parâmetros. Use isto quando os usuários solicitarem a criação de arte usando código, arte generativa, arte algorítmica, campos de fluxo,...",
  "Automate Amplitude tasks via Rube MCP (Composio): events, user activity, cohorts, user identification. Always search tools first for current schemas.": "Automatize tarefas do Amplitude via Rube MCP (Composio): eventos, atividade do usuário, coortes, identificação do usuário. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  ">": null,
  "Expert guidance for building modern Android UIs with Jetpack Compose, covering state management, navigation, performance, and Material Design 3.": "Orientação especializada para criar UIs Android modernas com Jetpack Compose, abrangendo gerenciamento de estado, navegação, desempenho e Material Design 3.",
  ">-": null,
  "Angular performance optimization and best practices guide. Use when writing, reviewing, or refactoring Angular code for optimal performance, bundle size, and rendering efficiency.": "Otimização de desempenho angular e guia de práticas recomendadas. Use ao escrever, revisar ou refatorar código Angular para obter desempenho, tamanho de pacote e eficiência de renderização ideais.",
  "Migrate from AngularJS to Angular using hybrid mode, incremental component rewriting, and dependency injection updates. Use when upgrading AngularJS applications, planning framework migrations, or ...": "Migre de AngularJS para Angular usando modo híbrido, reescrita incremental de componentes e atualizações de injeção de dependência. Use ao atualizar aplicativos AngularJS, planejar migrações de estrutura ou ...",
  "Master modern Angular state management with Signals, NgRx, and RxJS. Use when setting up global state, managing component stores, choosing between state solutions, or migrating from legacy patterns.": "Domine o gerenciamento moderno de estado Angular com Signals, NgRx e RxJS. Use ao configurar o estado global, gerenciar armazenamentos de componentes, escolher entre soluções de estado ou migrar de padrões legados.",
  "Modern Angular UI patterns for loading states, error handling, and data display. Use when building UI components, handling async data, or managing component states.": "Padrões de UI Angular modernos para estados de carregamento, tratamento de erros e exibição de dados. Use ao criar componentes de UI, manipular dados assíncronos ou gerenciar estados de componentes.",
  "Understand anti-reversing, obfuscation, and protection techniques encountered during software analysis. Use when analyzing protected binaries, bypassing anti-debugging for authorized analysis, or u...": "Compreenda as técnicas anti-reversão, ofuscação e proteção encontradas durante a análise de software. Use ao analisar binários protegidos, ignorando a antidepuração para análise autorizada ou u...",
  "Orchestrate multiple Antigravity skills through guided workflows for SaaS MVP delivery, security audits, AI agent builds, and browser QA.": "Orquestre diversas habilidades de antigravidade por meio de fluxos de trabalho guiados para entrega de MVP de SaaS, auditorias de segurança, criação de agentes de IA e controle de qualidade do navegador.",
  "Master REST and GraphQL API design principles to build intuitive, scalable, and maintainable APIs that delight developers. Use when designing new APIs, reviewing API specifications, or establishing...": "Domine os princípios de design de API REST e GraphQL para criar APIs intuitivas, escaláveis ​​e de fácil manutenção que encantam os desenvolvedores. Use ao projetar novas APIs, revisar especificações de API ou estabelecer...",
  "API documentation workflow for generating OpenAPI specs, creating developer guides, and maintaining comprehensive API documentation.": "Fluxo de trabalho de documentação de API para gerar especificações OpenAPI, criar guias de desenvolvedor e manter documentação abrangente de API.",
  "Generate comprehensive, developer-friendly API documentation from code, including endpoints, parameters, examples, and best practices": "Gere documentação de API abrangente e amigável ao desenvolvedor a partir do código, incluindo endpoints, parâmetros, exemplos e práticas recomendadas",
  "Master API documentation with OpenAPI 3.1, AI-powered tools, and": "Domine a documentação da API com OpenAPI 3.1, ferramentas baseadas em IA e",
  "This skill should be used when the user asks to \"test API security\", \"fuzz APIs\", \"find IDOR vulnerabilities\", \"test REST API\", \"test GraphQL\", \"API penetration testing\", \"bug b...": "Esta habilidade deve ser usada quando o usuário pede para \"testar segurança de API\", \"fuzz APIs\", \"encontrar vulnerabilidades IDOR\", \"testar API REST\", \"testar GraphQL\", \"teste de penetração de API\", \"bug b...",
  "Autonomous agents are AI systems that can independently decompose goals, plan actions, execute tools, and self-correct without constant human guidance. The challenge isn't making them capable - it'...": "Agentes autônomos são sistemas de IA que podem decompor metas de forma independente, planejar ações, executar ferramentas e autocorrigir-se sem orientação humana constante. O desafio não é torná-los capazes - é...",
  "Architectural decision-making framework. Requirements analysis, trade-off evaluation, ADR documentation. Use when making architecture decisions or analyzing system design.": "Estrutura de tomada de decisão arquitetônica. Análise de requisitos, avaliação de trade-off, documentação ADR. Use ao tomar decisões de arquitetura ou analisar o design do sistema.",
  "Main application building orchestrator. Creates full-stack applications from natural language requests. Determines project type, selects tech stack, coordinates agents.": "Principal orquestrador de construção de aplicativos. Cria aplicativos full-stack a partir de solicitações de linguagem natural. Determina o tipo de projeto, seleciona a pilha de tecnologia, coordena os agentes.",
  "Complete App Store Optimization (ASO) toolkit for researching, optimizing, and tracking mobile app performance on Apple App Store and Google Play Store": "Kit de ferramentas completo de App Store Optimization (ASO) para pesquisar, otimizar e monitorar o desempenho de aplicativos móveis na Apple App Store e Google Play Store",
  "Master authentication and authorization patterns including JWT, OAuth2, session management, and RBAC to build secure, scalable access control systems. Use when implementing auth systems, securing A...": "Padrões mestres de autenticação e autorização, incluindo JWT, OAuth2, gerenciamento de sessão e RBAC para criar sistemas de controle de acesso seguros e escaláveis. Use ao implementar sistemas de autenticação, protegendo A...",
  "API security testing workflow for REST and GraphQL APIs covering authentication, authorization, rate limiting, input validation, and security best practices.": "Fluxo de trabalho de teste de segurança de API para APIs REST e GraphQL, abrangendo autenticação, autorização, limitação de taxa, validação de entrada e práticas recomendadas de segurança.",
  "Project scaffolding templates for new applications. Use when creating new projects from scratch. Contains 12 templates for various tech stacks.": "Modelos de andaimes de projetos para novas aplicações. Use ao criar novos projetos do zero. Contém 12 modelos para várias pilhas de tecnologia.",
  "Transform audio recordings into professional Markdown documentation with intelligent summaries using LLM integration": "Transforme gravações de áudio em documentação Markdown profissional com resumos inteligentes usando integração LLM",
  "Implement proven backend architecture patterns including Clean Architecture, Hexagonal Architecture, and Domain-Driven Design. Use when architecting complex backend systems or refactoring existing ...": "Implemente padrões comprovados de arquitetura de back-end, incluindo Arquitetura Limpa, Arquitetura Hexagonal e Design Orientado a Domínio. Use ao arquitetar sistemas back-end complexos ou refatorar sistemas existentes.",
  "Master software architect specializing in modern architecture patterns, clean architecture, microservices, event-driven systems, and DDD. Reviews system designs and code changes for architectural integrity, scalability, and maintainability. Use PROACTIVELY for architectural decisions.": "Arquiteto de software mestre especializado em padrões de arquitetura moderna, arquitetura limpa, microsserviços, sistemas orientados a eventos e DDD. Revisa projetos de sistema e alterações de código quanto à integridade arquitetônica, escalabilidade e capacidade de manutenção. Use PROATIVAMENTE para decisões arquitetônicas.",
  "Write and maintain Architecture Decision Records (ADRs) following best practices for technical decision documentation. Use when documenting significant technical decisions, reviewing past architect...": "Escreva e mantenha registros de decisões de arquitetura (ADRs) seguindo as melhores práticas para documentação de decisões técnicas. Use ao documentar decisões técnicas significativas, revisando arquitetos anteriores...",
  "Build WhatsApp automations with Kapso workflows: configure WhatsApp triggers, edit workflow graphs, manage executions, deploy functions, and use databases/integrations for state. Use when automatin...": "Crie automações do WhatsApp com fluxos de trabalho Kapso: configure gatilhos do WhatsApp, edite gráficos de fluxo de trabalho, gerencie execuções, implante funções e use bancos de dados/integrações para estado. Use quando automatizar...",
  "Design patterns for building autonomous coding agents. Covers tool integration, permission systems, browser automation, and human-in-the-loop workflows. Use when building AI agents, designing tool ...": "Padrões de projeto para construção de agentes de codificação autônomos. Abrange integração de ferramentas, sistemas de permissão, automação de navegador e fluxos de trabalho humanos. Use ao construir agentes de IA, projetar ferramentas ...",
  "Optimize end-to-end application performance with profiling, observability, and backend/frontend tuning. Use when coordinating performance optimization across the stack.": "Otimize o desempenho completo do aplicativo com criação de perfil, observabilidade e ajuste de backend/frontend. Use ao coordenar a otimização de desempenho em toda a pilha.",
  "You are an API mocking expert specializing in realistic mock services for development, testing, and demos. Design mocks that simulate real API behavior and enable parallel development.": "Você é um especialista em simulação de API, especializado em serviços simulados realistas para desenvolvimento, testes e demonstrações. Projete simulações que simulem o comportamento real da API e permitam o desenvolvimento paralelo.",
  "Build comprehensive attack trees to visualize threat paths. Use when mapping attack scenarios, identifying defense gaps, or communicating security risks to stakeholders.": "Crie árvores de ataque abrangentes para visualizar caminhos de ameaças. Use ao mapear cenários de ataque, identificar lacunas de defesa ou comunicar riscos de segurança às partes interessadas.",
  "Master Python asyncio, concurrent programming, and async/await patterns for high-performance applications. Use when building async APIs, concurrent systems, or I/O-bound applications requiring non-...": "Domine Python assíncrono, programação simultânea e padrões assíncronos/aguardados para aplicativos de alto desempenho. Use ao criar APIs assíncronas, sistemas simultâneos ou aplicativos vinculados a E/S que exigem não...",
  "API design principles and decision-making. REST vs GraphQL vs tRPC selection, response formats, versioning, pagination.": "Princípios de design de API e tomada de decisão. Seleção REST vs GraphQL vs tRPC, formatos de resposta, versionamento, paginação.",
  "Automate Asana tasks via Rube MCP (Composio): tasks, projects, sections, teams, workspaces. Always search tools first for current schemas.": "Automatize tarefas Asana via Rube MCP (Composio): tarefas, projetos, seções, equipes, espaços de trabalho. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Implement secure API design patterns including authentication, authorization, input validation, rate limiting, and protection against common API vulnerabilities": "Implemente padrões de design de API seguros, incluindo autenticação, autorização, validação de entrada, limitação de taxa e proteção contra vulnerabilidades comuns de API",
  "Guidelines for modern Avalonia UI layout using Zafiro.Avalonia, emphasizing shared styles, generic components, and avoiding XAML redundancy.": "Diretrizes para layout de UI moderno do Avalonia usando Zafiro.Avalonia, enfatizando estilos compartilhados, componentes genéricos e evitando redundância de XAML.",
  "Mandatory skills, conventions, and behavioral rules for Avalonia UI development using the Zafiro toolkit.": "Habilidades, convenções e regras comportamentais obrigatórias para o desenvolvimento de UI Avalonia usando o kit de ferramentas Zafiro.",
  "Optimal ViewModel and Wizard creation patterns for Avalonia using Zafiro and ReactiveUI.": "Padrões ideais de criação de ViewModel e Wizard para Avalonia usando Zafiro e ReactiveUI.",
  "Comprehensive AWS cost analysis and optimization recommendations using AWS CLI and Cost Explorer": "Análise abrangente de custos da AWS e recomendações de otimização usando AWS CLI e Cost Explorer",
  "|": null,
  "Automated cleanup of unused AWS resources to reduce costs": "Limpeza automatizada de recursos AWS não utilizados para reduzir custos",
  "Build content moderation applications with Azure AI Content Safety SDK for Java. Use when implementing text/image analysis, blocklist management, or harm detection for hate, violence, sexual conten...": "Crie aplicativos de moderação de conteúdo com o Azure AI Content Safety SDK para Java. Use ao implementar análise de texto/imagem, gerenciamento de lista de bloqueio ou detecção de danos por ódio, violência, conteúdo sexual...",
  "Build anomaly detection applications with Azure AI Anomaly Detector SDK for Java. Use when implementing univariate/multivariate anomaly detection, time-series analysis, or AI-powered monitoring.": "Crie aplicativos de detecção de anomalias com o SDK do Detector de Anomalias do Azure AI para Java. Use ao implementar detecção de anomalias univariadas/multivariadas, análise de série temporal ou monitoramento alimentado por IA.",
  "Specialized skill for building production-ready serverless applications on AWS. Covers Lambda functions, API Gateway, DynamoDB, SQS/SNS event-driven patterns, SAM/CDK deployment, and cold start opt...": "Habilidade especializada para criar aplicativos sem servidor prontos para produção na AWS. Abrange funções Lambda, API Gateway, DynamoDB, padrões orientados a eventos SQS/SNS, implantação SAM/CDK e opção de inicialização a frio...",
  "Deploy containerized applications to Azure Container Apps using Azure Developer CLI (azd). Use when setting up azd projects, writing azure.yaml configuration, creating Bicep infrastructure for Cont...": "Implante aplicativos em contêineres em aplicativos de contêiner do Azure usando a CLI do desenvolvedor do Azure (azd). Use ao configurar projetos azd, escrever a configuração azure.yaml, criar infraestrutura Bicep para Cont...",
  "AWS development with infrastructure automation and cloud architecture patterns": "Desenvolvimento AWS com automação de infraestrutura e padrões de arquitetura em nuvem",
  "Extract text, tables, and structured data from documents using Azure Document Intelligence (@azure-rest/ai-document-intelligence). Use when processing invoices, receipts, IDs, forms, or building cu...": "Extraia texto, tabelas e dados estruturados de documentos usando o Azure Document Intelligence (@azure-rest/ai-document-intelligence). Use ao processar faturas, recibos, IDs, formulários ou criar c...",
  "Build document analysis applications with Azure Document Intelligence (Form Recognizer) SDK for Java. Use when extracting text, tables, key-value pairs from documents, receipts, invoices, or buildi...": "Crie aplicativos de análise de documentos com o SDK do Azure Document Intelligence (Form Recognizer) para Java. Use ao extrair texto, tabelas, pares de valores-chave de documentos, recibos, faturas ou construções...",
  "Analyze text and images for harmful content using Azure AI Content Safety (@azure-rest/ai-content-safety). Use when moderating user-generated content, detecting hate speech, violence, sexual conten...": "Analise textos e imagens em busca de conteúdo prejudicial usando o Azure AI Content Safety (@azure-rest/ai-content-safety). Use ao moderar conteúdo gerado pelo usuário, detectando discurso de ódio, violência, conteúdo sexual...",
  "This skill should be used when the user asks to \"pentest AWS\", \"test AWS security\", \"enumerate IAM\", \"exploit cloud infrastructure\", \"AWS privilege escalation\", \"S3 bucket testing...": "Esta habilidade deve ser usada quando o usuário pede para \"pentest AWS\", \"testar segurança AWS\", \"enumerar IAM\", \"explorar infraestrutura de nuvem\", \"escalonamento de privilégios AWS\", \"teste de bucket S3...",
  "Build image analysis applications with Azure AI Vision SDK for Java. Use when implementing image captioning, OCR text extraction, object detection, tagging, or smart cropping.": "Crie aplicativos de análise de imagem com o Azure AI Vision SDK para Java. Use ao implementar legendas de imagens, extração de texto OCR, detecção de objetos, marcação ou corte inteligente.",
  "Build AI applications using Azure AI Projects SDK for JavaScript (@azure/ai-projects). Use when working with Foundry project clients, agents, connections, deployments, datasets, indexes, evaluation...": "Crie aplicativos de IA usando o SDK do Azure AI Projects para JavaScript (@azure/ai-projects). Use ao trabalhar com clientes, agentes, conexões, implantações, conjuntos de dados, índices, avaliação...",
  "Build real-time voice AI applications using Azure AI Voice Live SDK (azure-ai-voicelive). Use this skill when creating Python applications that need real-time bidirectional audio communication with...": "Crie aplicativos de IA de voz em tempo real usando o Azure AI Voice Live SDK (azure-ai-voicelive). Use esta habilidade ao criar aplicativos Python que precisam de comunicação de áudio bidirecional em tempo real com...",
  "Build applications using Azure App Configuration SDK for JavaScript (@azure/app-configuration). Use when working with configuration settings, feature flags, Key Vault references, dynamic refresh, o...": "Crie aplicativos usando o SDK de configuração de aplicativos do Azure para JavaScript (@azure/app-configuration). Use ao trabalhar com definições de configuração, sinalizadores de recursos, referências do Key Vault, atualização dinâmica, ou...",
  "Azure Communication Services common utilities for Java. Use when working with CommunicationTokenCredential, user identifiers, token refresh, or shared authentication across ACS services.": "Utilitários comuns dos Serviços de Comunicação do Azure para Java. Use ao trabalhar com CommunicationTokenCredential, identificadores de usuário, atualização de token ou autenticação compartilhada entre serviços ACS.",
  "Build translation applications using Azure Translation SDKs for JavaScript (@azure-rest/ai-translation-text, @azure-rest/ai-translation-document). Use when implementing text translation, transliter...": "Crie aplicativos de tradução usando SDKs de tradução do Azure para JavaScript (@azure-rest/ai-translation-text, @azure-rest/ai-translation-document). Use ao implementar tradução de texto, transliteração...",
  "Build AI applications using the Azure AI Projects Python SDK (azure-ai-projects). Use when working with Foundry project clients, creating versioned agents with PromptAgentDefinition, running evalua...": "Crie aplicativos de IA usando o SDK Python dos Projetos de IA do Azure (azure-ai-projects). Use ao trabalhar com clientes do projeto Foundry, criando agentes versionados com PromptAgentDefinition, executando avaliações...",
  "Build call automation workflows with Azure Communication Services Call Automation Java SDK. Use when implementing IVR systems, call routing, call recording, DTMF recognition, text-to-speech, or AI-...": "Crie fluxos de trabalho de automação de chamadas com o SDK Java de Automação de Chamadas dos Serviços de Comunicação do Azure. Use ao implementar sistemas IVR, roteamento de chamadas, gravação de chamadas, reconhecimento DTMF, conversão de texto em fala ou IA-...",
  "Build event-driven applications with Azure Event Grid SDK for Java. Use when publishing events, implementing pub/sub patterns, or integrating with Azure services via events.": "Crie aplicações orientadas por eventos com o Azure Event Grid SDK para Java. Use ao publicar eventos, implementar padrões de publicação/assinatura ou integrar-se aos serviços do Azure por meio de eventos.",
  "Build real-time chat applications with Azure Communication Services Chat Java SDK. Use when implementing chat threads, messaging, participants, read receipts, typing notifications, or real-time cha...": "Crie aplicativos de chat em tempo real com o SDK Java de bate-papo dos Serviços de Comunicação do Azure. Use ao implementar tópicos de bate-papo, mensagens, participantes, confirmações de leitura, notificações de digitação ou conversas em tempo real...",
  "Azure Communication Services CallingServer (legacy) Java SDK. Note - This SDK is deprecated. Use azure-communication-callautomation instead for new projects. Only use this skill when maintaining le...": "SDK Java CallingServer dos Serviços de Comunicação do Azure (herdado). Observação: este SDK está obsoleto. Use azure-communication-callautomation para novos projetos. Use esta habilidade apenas ao manter le...",
  "Send SMS messages with Azure Communication Services SMS Java SDK. Use when implementing SMS notifications, alerts, OTP delivery, bulk messaging, or delivery reports.": "Envie mensagens SMS com o SDK Java SMS dos Serviços de Comunicação do Azure. Use ao implementar notificações por SMS, alertas, entrega OTP, mensagens em massa ou relatórios de entrega.",
  "Build table storage applications with Azure Tables SDK for Java. Use when working with Azure Table Storage or Cosmos DB Table API for NoSQL key-value data, schemaless storage, or structured data at...": "Crie aplicativos de armazenamento de tabelas com o Azure Tables SDK para Java. Use ao trabalhar com Azure Table Storage ou Cosmos DB Table API para dados de valor-chave NoSQL, armazenamento sem esquema ou dados estruturados em...",
  "Build real-time streaming applications with Azure Event Hubs SDK for Java. Use when implementing event streaming, high-throughput data ingestion, or building event-driven architectures.": "Crie aplicações de streaming em tempo real com o Azure Event Hubs SDK para Java. Use ao implementar streaming de eventos, ingestão de dados de alto rendimento ou construir arquiteturas orientadas a eventos.",
  "Build Azure Cosmos DB NoSQL services with Python/FastAPI following production-grade patterns. Use when implementing database client setup with dual auth (DefaultAzureCredential + emulator), service...": "Crie serviços NoSQL do Azure Cosmos DB com Python/FastAPI seguindo padrões de nível de produção. Use ao implementar a configuração do cliente de banco de dados com autenticação dupla (DefaultAzureCredential + emulador), serviço...",
  "Build event streaming applications using Azure Event Hubs SDK for JavaScript (@azure/event-hubs). Use when implementing high-throughput event ingestion, real-time analytics, IoT telemetry, or event...": "Crie aplicativos de streaming de eventos usando o SDK do Azure Event Hubs para JavaScript (@azure/event-hubs). Use ao implementar ingestão de eventos de alto rendimento, análise em tempo real, telemetria IoT ou eventos...",
  "Expert patterns for Azure Functions development including isolated worker model, Durable Functions orchestration, cold start optimization, and production patterns. Covers .NET, Python, and Node.js ...": "Padrões especializados para desenvolvimento de Azure Functions, incluindo modelo de trabalhador isolado, orquestração de Funções Duráveis, otimização de inicialização a frio e padrões de produção. Abrange .NET, Python e Node.js ...",
  "Azure Identity Java SDK for authentication with Azure services. Use when implementing DefaultAzureCredential, managed identity, service principal, or any Azure authentication pattern in Java applic...": "Azure Identity Java SDK para autenticação com serviços do Azure. Use ao implementar DefaultAzureCredential, identidade gerenciada, entidade de serviço ou qualquer padrão de autenticação do Azure em aplicativos Java...",
  "Manage secrets using Azure Key Vault Secrets SDK for JavaScript (@azure/keyvault-secrets). Use when storing and retrieving application secrets or configuration values.": "Gerencie segredos usando o SDK de segredos do Azure Key Vault para JavaScript (@azure/keyvault-secrets). Use ao armazenar e recuperar segredos de aplicativos ou valores de configuração.",
  "Manage cryptographic keys using Azure Key Vault Keys SDK for JavaScript (@azure/keyvault-keys). Use when creating, encrypting/decrypting, signing, or rotating keys.": "Gerencie chaves criptográficas usando o SDK de chaves do Azure Key Vault para JavaScript (@azure/keyvault-keys). Use ao criar, criptografar/descriptografar, assinar ou girar chaves.",
  "Build real-time web applications with Azure Web PubSub SDK for Java. Use when implementing WebSocket-based messaging, live updates, chat applications, or server-to-client push notifications.": "Crie aplicativos Web em tempo real com o Azure Web PubSub SDK para Java. Use ao implementar mensagens baseadas em WebSocket, atualizações ao vivo, aplicativos de bate-papo ou notificações push de servidor para cliente.",
  "Run Playwright tests at scale using Azure Playwright Workspaces (formerly Microsoft Playwright Testing). Use when scaling browser tests across cloud-hosted browsers, integrating with CI/CD pipeline...": "Execute testes do Playwright em escala usando o Azure Playwright Workspaces (anteriormente Microsoft Playwright Testing). Use ao dimensionar testes de navegador em navegadores hospedados na nuvem, integrando-se ao pipeline de CI/CD...",
  "Authenticate to Azure services using Azure Identity SDK for JavaScript (@azure/identity). Use when configuring authentication with DefaultAzureCredential, managed identity, service principals, or i...": "Autentique-se nos serviços do Azure usando o Azure Identity SDK para JavaScript (@azure/identity). Use ao configurar a autenticação com DefaultAzureCredential, identidade gerenciada, entidades de serviço ou i...",
  "Manage MongoDB Atlas Organizations as Azure ARM resources using Azure.ResourceManager.MongoDBAtlas SDK. Use when creating, updating, listing, or deleting MongoDB Atlas organizations through Azure M...": "Gerencie Organizações MongoDB Atlas como recursos Azure ARM usando Azure.ResourceManager.MongoDBAtlas SDK. Use ao criar, atualizar, listar ou excluir organizações do MongoDB Atlas por meio do Azure M...",
  "Azure Key Vault Secrets Java SDK for secret management. Use when storing, retrieving, or managing passwords, API keys, connection strings, or other sensitive configuration data.": "Azure Key Vault Secrets Java SDK para gerenciamento de segredos. Use ao armazenar, recuperar ou gerenciar senhas, chaves de API, cadeias de conexão ou outros dados de configuração confidenciais.",
  "Instrument applications with Azure Monitor and OpenTelemetry for JavaScript (@azure/monitor-opentelemetry). Use when adding distributed tracing, metrics, and logs to Node.js applications with Appli...": "Aplicativos de instrumento com Azure Monitor e OpenTelemetry para JavaScript (@azure/monitor-opentelemetry). Use ao adicionar rastreamento, métricas e logs distribuídos a aplicativos Node.js com Appli...",
  "Build search applications using Azure AI Search SDK for JavaScript (@azure/search-documents). Use when creating/managing indexes, implementing vector/hybrid search, semantic ranking, or building ag...": "Crie aplicativos de pesquisa usando o SDK do Azure AI Search para JavaScript (@azure/search-documents). Use ao criar/gerenciar índices, implementar pesquisa vetorial/híbrida, classificação semântica ou construir ag...",
  "Build real-time messaging applications using Azure Web PubSub SDKs for JavaScript (@azure/web-pubsub, @azure/web-pubsub-client). Use when implementing WebSocket-based real-time features, pub/sub me...": "Crie aplicativos de mensagens em tempo real usando SDKs do Azure Web PubSub para JavaScript (@azure/web-pubsub, @azure/web-pubsub-client). Use ao implementar recursos em tempo real baseados em WebSocket, pub/sub me...",
  "Azure Key Vault Keys Java SDK for cryptographic key management. Use when creating, managing, or using RSA/EC keys, performing encrypt/decrypt/sign/verify operations, or working with HSM-backed keys.": "Azure Key Vault Keys Java SDK para gerenciamento de chaves criptográficas. Use ao criar, gerenciar ou usar chaves RSA/EC, executar operações de criptografia/descriptografia/assinar/verificar ou trabalhar com chaves apoiadas por HSM.",
  "Orchestrate end-to-end backend feature development from requirements to deployment. Use when coordinating multi-phase feature delivery across teams and services.": "Orquestre o desenvolvimento completo de recursos de back-end, desde os requisitos até a implantação. Use ao coordenar a entrega de recursos multifásicos entre equipes e serviços.",
  "Build messaging applications using Azure Service Bus SDK for JavaScript (@azure/service-bus). Use when implementing queues, topics/subscriptions, message sessions, dead-letter handling, or enterpri...": "Crie aplicativos de mensagens usando o Azure Service Bus SDK para JavaScript (@azure/service-bus). Use ao implementar filas, tópicos/assinaturas, sessões de mensagens, tratamento de mensagens mortas ou empresas...",
  "Expert backend architect specializing in scalable API design,": "Arquiteto de back-end especializado em design de API escalonável,",
  "Build blob storage applications with Azure Storage Blob SDK for Java. Use when uploading, downloading, or managing files in Azure Blob Storage, working with containers, or implementing streaming da...": "Crie aplicativos de armazenamento de blobs com o Azure Storage Blob SDK para Java. Use ao carregar, baixar ou gerenciar arquivos no Azure Blob Storage, trabalhar com contêineres ou implementar dados de streaming...",
  "Build robust backtesting systems for trading strategies with proper handling of look-ahead bias, survivorship bias, and transaction costs. Use when developing trading algorithms, validating strateg...": "Crie sistemas robustos de backtesting para estratégias de negociação com tratamento adequado de viés de antecipação, viés de sobrevivência e custos de transação. Use ao desenvolver algoritmos de negociação, validando estratégias...",
  "Expert in secure backend coding practices specializing in input": "Especialista em práticas seguras de codificação de back-end, especializado em entrada",
  "Automate Basecamp project management, to-dos, messages, people, and to-do list organization via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize o gerenciamento de projetos Basecamp, tarefas, mensagens, pessoas e organização de listas de tarefas via Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Bash scripting workflow for creating production-ready shell scripts with defensive patterns, error handling, and testing.": "Fluxo de trabalho de script Bash para criar scripts de shell prontos para produção com padrões defensivos, tratamento de erros e testes.",
  "Master defensive Bash programming techniques for production-grade scripts. Use when writing robust shell scripts, CI/CD pipelines, or system utilities requiring fault tolerance and safety.": "Domine técnicas defensivas de programação Bash para scripts de nível de produção. Use ao escrever scripts de shell robustos, pipelines de CI/CD ou utilitários de sistema que exigem tolerância a falhas e segurança.",
  "Automate BambooHR tasks via Rube MCP (Composio): employees, time-off, benefits, dependents, employee updates. Always search tools first for current schemas.": "Automatize tarefas do BambooHR via Rube MCP (Composio): funcionários, folgas, benefícios, dependentes, atualizações de funcionários. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Opinionated backend development standards for Node.js + Express + TypeScript microservices. Covers layered architecture, BaseController pattern, dependency injection, Prisma repositories, Zod valid...": "Padrões opinativos de desenvolvimento de back-end para microsserviços Node.js + Express + TypeScript. Abrange arquitetura em camadas, padrão BaseController, injeção de dependência, repositórios Prisma, Zod válido...",
  "Master of defensive Bash scripting for production automation, CI/CD": "Mestre em scripts Bash defensivos para automação de produção, CI/CD",
  "Master Bash Automated Testing System (Bats) for comprehensive shell script testing. Use when writing tests for shell scripts, CI/CD pipelines, or requiring test-driven development of shell utilities.": "Master Bash Automated Testing System (Bats) para testes abrangentes de script de shell. Use ao escrever testes para scripts de shell, pipelines de CI/CD ou ao exigir o desenvolvimento orientado a testes de utilitários de shell.",
  "Master Bevy's Entity Component System (ECS) in Rust, covering Systems, Queries, Resources, and parallel scheduling.": "Master Bevy's Entity Component System (ECS) em Rust, cobrindo sistemas, consultas, recursos e agendamento paralelo.",
  "Master binary analysis patterns including disassembly, decompilation, control flow analysis, and code pattern recognition. Use when analyzing executables, understanding compiled code, or performing...": "Domine padrões de análise binária, incluindo desmontagem, descompilação, análise de fluxo de controle e reconhecimento de padrões de código. Use ao analisar executáveis, entender código compilado ou executar...",
  "Hard-edged writing style contract for timeless, forceful English prose without AI tics": "Contrato de estilo de escrita contundente para uma prosa inglesa atemporal e contundente, sem tiques de IA",
  "Build automated billing systems for recurring payments, invoicing, subscription lifecycle, and dunning management. Use when implementing subscription billing, automating invoicing, or managing recu...": "Crie sistemas de faturamento automatizados para pagamentos recorrentes, faturamento, ciclo de vida de assinatura e gerenciamento de cobranças. Use ao implementar o faturamento de assinaturas, automatizar o faturamento ou gerenciar recu...",
  "Bash/Linux terminal patterns. Critical commands, piping, error handling, scripting. Use when working on macOS or Linux systems.": "Padrões de terminal Bash/Linux. Comandos críticos, tubulação, tratamento de erros, scripts. Use ao trabalhar em sistemas macOS ou Linux.",
  "AI operational modes (brainstorm, implement, debug, review, teach, ship, orchestrate). Use to adapt behavior based on task type.": "Modos operacionais de IA (brainstorm, implementar, depurar, revisar, ensinar, enviar, orquestrar). Use para adaptar o comportamento com base no tipo de tarefa.",
  "Build production-ready Web3 applications, smart contracts, and": "Crie aplicativos Web3 prontos para produção, contratos inteligentes e",
  "Automate Box cloud storage operations including file upload/download, search, folder management, sharing, collaborations, and metadata queries via Rube MCP (Composio). Always search tools first for...": "Automatize as operações de armazenamento em nuvem do Box, incluindo upload/download de arquivos, pesquisa, gerenciamento de pastas, compartilhamento, colaborações e consultas de metadados por meio do Rube MCP (Composio). Sempre pesquise primeiro as ferramentas para...",
  "Use before creative or constructive work (features, architecture, behavior). Transforms vague ideas into validated designs through disciplined reasoning and collaboration.": "Use antes de trabalhos criativos ou construtivos (recursos, arquitetura, comportamento). Transforma ideias vagas em projetos validados por meio de raciocínio disciplinado e colaboração.",
  "Use when user needs capabilities Claude lacks (image generation, real-time X/Twitter data) or explicitly requests external models (\\\"blockrun\\\", \\\"use grok\\\", \\\"use gpt\\\", \\\"da...": "Use quando o usuário precisar de recursos que faltam ao Claude (geração de imagens, dados X/Twitter em tempo real) ou solicitar explicitamente modelos externos (\\\"blockrun\\\", \\\"use grok\\\", \\\"use gpt\\\", \\\"da...",
  "Automate Bitbucket repositories, pull requests, branches, issues, and workspace management via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize repositórios Bitbucket, solicitações pull, ramificações, problemas e gerenciamento de espaço de trabalho por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Optimize Bazel builds for large-scale monorepos. Use when configuring Bazel, implementing remote execution, or optimizing build performance for enterprise codebases.": "Otimize compilações do Bazel para monorepos em grande escala. Use ao configurar o Bazel, implementar execução remota ou otimizar o desempenho de compilação para bases de código empresariais.",
  "Automate Brevo (Sendinblue) tasks via Rube MCP (Composio): manage email campaigns, create/edit templates, track senders, and monitor campaign performance. Always search tools first for current sche...": "Automatize tarefas Brevo (Sendinblue) via Rube MCP (Composio): gerencie campanhas de e-mail, crie/edite modelos, rastreie remetentes e monitore o desempenho da campanha. Sempre pesquise primeiro as ferramentas pelo esquema atual...",
  "Applies Anthropic's official brand colors and typography to any sort of artifact that may benefit from having Anthropic's look-and-feel. Use it when brand colors or style guidelines, visual formatt...": "Aplica as cores e tipografia oficiais da marca Anthropic a qualquer tipo de artefato que possa se beneficiar da aparência da Anthropic. Use-o quando as cores da marca ou diretrizes de estilo, formato visual...",
  "BullMQ expert for Redis-backed job queues, background processing, and reliable async execution in Node.js/TypeScript applications. Use when: bullmq, bull queue, redis queue, background job, job queue.": "Especialista BullMQ para filas de tarefas apoiadas por Redis, processamento em segundo plano e execução assíncrona confiável em aplicativos Node.js/TypeScript. Use quando: bullmq, fila bull, fila redis, trabalho em segundo plano, fila de trabalhos.",
  "Expert in building browser extensions that solve real problems - Chrome, Firefox, and cross-browser extensions. Covers extension architecture, manifest v3, content scripts, popup UIs, monetization ...": "Especialista na construção de extensões de navegador que resolvem problemas reais - Chrome, Firefox e extensões para vários navegadores. Abrange arquitetura de extensão, manifesto v3, scripts de conteúdo, UIs pop-up, monetização...",
  "Master modern business analysis with AI-powered analytics,": "Domine a análise de negócios moderna com análises baseadas em IA,",
  "Browser automation powers web testing, scraping, and AI agent interactions. The difference between a flaky script and a reliable system comes down to understanding selectors, waiting strategies, an...": "A automação do navegador potencializa testes web, scraping e interações de agentes de IA. A diferença entre um script instável e um sistema confiável se resume à compreensão dos seletores, das estratégias de espera e...",
  "How to use a Win32 build of BusyBox to run many of the standard UNIX command line tools on Windows.": "Como usar uma versão Win32 do BusyBox para executar muitas das ferramentas de linha de comando padrão do UNIX no Windows.",
  "Modern JavaScript/TypeScript development with Bun runtime. Covers package management, bundling, testing, and migration from Node.js. Use when working with Bun, optimizing JS/TS development speed, o...": "Desenvolvimento moderno de JavaScript/TypeScript com tempo de execução Bun. Abrange gerenciamento de pacotes, agrupamento, testes e migração de Node.js. Use ao trabalhar com Bun, otimizando a velocidade de desenvolvimento JS/TS, ou...",
  "Generate comprehensive C4 architecture documentation for an existing repository/codebase using a bottom-up analysis approach.": "Gere documentação abrangente da arquitetura C4 para um repositório/base de código existente usando uma abordagem de análise ascendente.",
  "Expert C4 Code-level documentation specialist. Analyzes code": "Especialista em documentação em nível de código C4. Analisa código",
  "Backend architecture patterns, API design, database optimization, and server-side best practices for Node.js, Express, and Next.js API routes.": "Padrões de arquitetura de back-end, design de API, otimização de banco de dados e práticas recomendadas do lado do servidor para rotas de API Node.js, Express e Next.js.",
  "ClickHouse database patterns, query optimization, analytics, and data engineering best practices for high-performance analytical workloads.": "Padrões de banco de dados ClickHouse, otimização de consultas, análises e práticas recomendadas de engenharia de dados para cargas de trabalho analíticas de alto desempenho.",
  "Expert C4 Context-level documentation specialist. Creates": "Expert C4 Especialista em documentação em nível de contexto. Cria",
  "Write efficient C code with proper memory management, pointer arithmetic, and system calls. Handles embedded systems, kernel modules, and performance-critical code. Use PROACTIVELY for C optimization, memory issues, or system programming.": "Escreva código C eficiente com gerenciamento de memória adequado, aritmética de ponteiro e chamadas de sistema. Lida com sistemas embarcados, módulos de kernel e código de desempenho crítico. Use PROATIVAMENTE para otimização C, problemas de memória ou programação do sistema.",
  "Expert C4 Component-level documentation specialist. Synthesizes C4": "Expert C4 Especialista em documentação em nível de componente. Sintetiza C4",
  "This skill should be used when the user asks to \"test for broken authentication vulnerabilities\", \"assess session management security\", \"perform credential stuffing tests\", \"evaluate ...": "Esta habilidade deve ser usada quando o usuário pede para \"testar vulnerabilidades de autenticação quebrada\", \"avaliar a segurança do gerenciamento de sessão\", \"realizar testes de preenchimento de credenciais\", \"avaliar...",
  "This skill should be used when the user asks to \"intercept HTTP traffic\", \"modify web requests\", \"use Burp Suite for testing\", \"perform web vulnerability scanning\", \"test with Burp ...": "Esta habilidade deve ser usada quando o usuário pede para \"interceptar tráfego HTTP\", \"modificar solicitações web\", \"usar Burp Suite para testes\", \"realizar verificação de vulnerabilidades web\", \"testar com Burp...",
  "Use this skill when adding authentication, handling user input, working with secrets, creating API endpoints, or implementing payment/sensitive features. Provides comprehensive security checklist a...": "Use essa habilidade ao adicionar autenticação, lidar com entradas do usuário, trabalhar com segredos, criar endpoints de API ou implementar recursos confidenciais/de pagamento. Fornece uma lista de verificação de segurança abrangente e...",
  "Project Guidelines Skill (Example)": "Habilidade de diretrizes do projeto (exemplo)",
  "Frontend development patterns for React, Next.js, state management, performance optimization, and UI best practices.": "Padrões de desenvolvimento de front-end para React, Next.js, gerenciamento de estado, otimização de desempenho e práticas recomendadas de UI.",
  "Universal coding standards, best practices, and patterns for TypeScript, JavaScript, React, and Node.js development.": "Padrões de codificação universais, práticas recomendadas e padrões para desenvolvimento de TypeScript, JavaScript, React e Node.js.",
  "Development skill from everything-claude-code": "Habilidade de desenvolvimento de tudo-claude-code",
  "Automate Calendly scheduling, event management, invitee tracking, availability checks, and organization administration via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize o agendamento do Calendly, o gerenciamento de eventos, o rastreamento de convidados, as verificações de disponibilidade e a administração da organização por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Create beautiful visual art in .png and .pdf documents using design philosophy. You should use this skill when the user asks to create a poster, piece of art, design, or other static piece. Create ...": "Crie belas artes visuais em documentos .png e .pdf usando a filosofia de design. Você deve usar essa habilidade quando o usuário solicitar a criação de um pôster, obra de arte, design ou outra peça estática. Criar ...",
  "Automate Canva tasks via Rube MCP (Composio): designs, exports, folders, brand templates, autofill. Always search tools first for current schemas.": "Automatize tarefas do Canva via Rube MCP (Composio): designs, exportações, pastas, modelos de marca, preenchimento automático. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Automate Cal.com tasks via Rube MCP (Composio): manage bookings, check availability, configure webhooks, and handle teams. Always search tools first for current schemas.": "Automatize tarefas do Cal.com via Rube MCP (Composio): gerencie reservas, verifique a disponibilidade, configure webhooks e gerencie equipes. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Expert C4 Container-level documentation specialist. Synthesizes": "Especialista em documentação em nível de contêiner C4. Sintetiza",
  "Automate changelog generation from commits, PRs, and releases following Keep a Changelog format. Use when setting up release workflows, generating release notes, or standardizing commit conventions.": "Automatize a geração de changelog a partir de commits, PRs e releases seguindo o formato Keep a Changelog. Use ao configurar fluxos de trabalho de lançamento, gerar notas de lançamento ou padronizar convenções de commit.",
  "Common AWS CDK patterns and constructs for building cloud infrastructure with TypeScript, Python, or Java. Use when designing reusable CDK stacks and L3 constructs.": "Padrões e construções comuns do AWS CDK para construir infraestrutura em nuvem com TypeScript, Python ou Java. Use ao projetar pilhas CDK reutilizáveis ​​e construções L3.",
  "You are a workflow automation expert specializing in creating efficient CI/CD pipelines, GitHub Actions workflows, and automated development processes. Design automation that reduces manual work, i...": "Você é um especialista em automação de fluxo de trabalho especializado na criação de pipelines de CI/CD eficientes, fluxos de trabalho do GitHub Actions e processos de desenvolvimento automatizados. Automação de design que reduz o trabalho manual, i...",
  "Scientific research and analysis skills": "Habilidades de pesquisa e análise científica",
  "A health assistant skill for medical information analysis, symptom tracking, and wellness guidance.": "Uma habilidade de assistente de saúde para análise de informações médicas, rastreamento de sintomas e orientação de bem-estar.",
  "Pre-ingestion verification for epistemic quality in RAG systems with 9-point verification and Two-Round HITL workflow": "Verificação pré-ingestão para qualidade epistêmica em sistemas RAG com verificação de 9 pontos e fluxo de trabalho HITL de duas rodadas",
  "Automate CircleCI tasks via Rube MCP (Composio): trigger pipelines, monitor workflows/jobs, retrieve artifacts and test metadata. Always search tools first for current schemas.": "Automatize tarefas do CircleCI via Rube MCP (Composio): acione pipelines, monitore fluxos de trabalho/trabalhos, recupere artefatos e teste metadados. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Creating interactive data visualisations using d3.js. This skill should be used when creating custom charts, graphs, network diagrams, geographic visualisations, or any complex SVG-based data visua...": "Criação de visualizações de dados interativas usando d3.js. Esta habilidade deve ser usada ao criar tabelas personalizadas, gráficos, diagramas de rede, visualizações geográficas ou qualquer visualização de dados complexa baseada em SVG.",
  "Windows 11 system management": "Gerenciamento do sistema Windows 11",
  "Master guide for using Claude Code effectively. Includes configuration templates, prompting strategies \\\"Thinking\\\" keywords, debugging techniques, and best practices for interacting wit...": "Guia mestre para usar o Claude Code de maneira eficaz. Inclui modelos de configuração, estratégias de prompt, palavras-chave \"Pensando\", técnicas de depuração e práticas recomendadas para interagir com...",
  "-Speed read Claude's responses at 600+ WPM using RSVP with Spritz-style ORP highlighting": "-Leia rapidamente as respostas de Claude em mais de 600 WPM usando RSVP com destaque ORP estilo Spritz",
  "Expert patterns for Clerk auth implementation, middleware, organizations, webhooks, and user sync Use when: adding authentication, clerk auth, user authentication, sign in, sign up.": "Padrões especializados para implementação de autenticação do funcionário, middleware, organizações, webhooks e sincronização de usuário Use quando: adicionar autenticação, autenticação do funcionário, autenticação do usuário, entrar, inscrever-se.",
  "Cloud infrastructure and DevOps workflow covering AWS, Azure, GCP, Kubernetes, Terraform, CI/CD, monitoring, and cloud-native development.": "Infraestrutura em nuvem e fluxo de trabalho DevOps abrangendo AWS, Azure, GCP, Kubernetes, Terraform, CI/CD, monitoramento e desenvolvimento nativo da nuvem.",
  "Expert cloud architect specializing in AWS/Azure/GCP multi-cloud": "Arquiteto de nuvem especializado em multinuvem AWS/Azure/GCP",
  "You are a code refactoring expert specializing in clean code principles, SOLID design patterns, and modern software engineering best practices. Analyze and refactor the provided code to improve its...": "Você é um especialista em refatoração de código, especializado em princípios de código limpo, padrões de design SOLID e práticas recomendadas de engenharia de software moderna. Analise e refatore o código fornecido para melhorar seu...",
  "Automate ClickUp project management including tasks, spaces, folders, lists, comments, and team operations via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize o gerenciamento de projetos ClickUp, incluindo tarefas, espaços, pastas, listas, comentários e operações de equipe por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Applies principles from Robert C. Martin's 'Clean Code'. Use this skill when writing, reviewing, or refactoring code to ensure high quality, readability, and maintainability. Covers naming, functio...": "Aplica princípios do 'Código Limpo' de Robert C. Martin. Use essa habilidade ao escrever, revisar ou refatorar código para garantir alta qualidade, legibilidade e facilidade de manutenção. Abrange nomenclatura, função...",
  "You are a code education expert specializing in explaining complex code through clear narratives, visual diagrams, and step-by-step breakdowns. Transform difficult concepts into understandable expl...": "Você é um especialista em educação de código especializado em explicar códigos complexos por meio de narrativas claras, diagramas visuais e detalhamentos passo a passo. Transforme conceitos difíceis em explicações compreensíveis...",
  "You are a documentation expert specializing in creating comprehensive, maintainable documentation from code. Generate API docs, architecture diagrams, user guides, and technical references using AI...": "Você é um especialista em documentação especializado na criação de documentação abrangente e de fácil manutenção a partir de código. Gere documentos de API, diagramas de arquitetura, guias de usuário e referências técnicas usando IA...",
  "Comprehensive checklist for conducting thorough code reviews covering functionality, security, performance, and maintainability": "Lista de verificação abrangente para conduzir revisões completas de código, abrangendo funcionalidade, segurança, desempenho e capacidade de manutenção",
  "You are a technical debt expert specializing in identifying, quantifying, and prioritizing technical debt in software projects. Analyze the codebase to uncover debt, assess its impact, and create acti": "Você é um especialista em dívida técnica especializado em identificar, quantificar e priorizar dívida técnica em projetos de software. Analise a base de código para descobrir dívidas, avaliar seu impacto e criar ações",
  "Use when working with code refactoring context restore": "Use ao trabalhar com restauração de contexto de refatoração de código",
  "Automate Coda tasks via Rube MCP (Composio): manage docs, pages, tables, rows, formulas, permissions, and publishing. Always search tools first for current schemas.": "Automatize tarefas Coda via Rube MCP (Composio): gerencie documentos, páginas, tabelas, linhas, fórmulas, permissões e publicação. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Automate Close CRM tasks via Rube MCP (Composio): create leads, manage calls/SMS, handle tasks, and track notes. Always search tools first for current schemas.": "Automatize tarefas de Close CRM via Rube MCP (Composio): crie leads, gerencie chamadas/SMS, lide com tarefas e rastreie notas. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "CloudFormation template optimization, nested stacks, drift detection, and production-ready patterns. Use when writing or reviewing CF templates.": "Otimização de modelos CloudFormation, pilhas aninhadas, detecção de desvios e padrões prontos para produção. Use ao escrever ou revisar modelos de CF.",
  "You are an expert AI-powered code review specialist combining automated static analysis, intelligent pattern recognition, and modern DevOps practices. Leverage AI tools (GitHub Copilot, Qodo, GPT-5, C": "Você é um especialista em revisão de código com tecnologia de IA que combina análise estática automatizada, reconhecimento inteligente de padrões e práticas modernas de DevOps. Aproveite as ferramentas de IA (GitHub Copilot, Qodo, GPT-5, C",
  "This skill should be used when the user asks to \"perform cloud penetration testing\", \"assess Azure or AWS or GCP security\", \"enumerate cloud resources\", \"exploit cloud misconfiguratio...": "Esta habilidade deve ser usada quando o usuário pede para \"realizar testes de penetração na nuvem\", \"avaliar a segurança do Azure ou AWS ou GCP\", \"enumerar recursos da nuvem\", \"explorar configurações incorretas da nuvem...",
  "You are a dependency security expert specializing in vulnerability scanning, license compliance, and supply chain security. Analyze project dependencies for known vulnerabilities, licensing issues,...": "Você é um especialista em segurança de dependências, especializado em verificação de vulnerabilidades, conformidade de licenças e segurança da cadeia de suprimentos. Analise as dependências do projeto em busca de vulnerabilidades conhecidas, problemas de licenciamento,...",
  "Professional code review with auto CHANGELOG generation, integrated with Codex AI": "Revisão de código profissional com geração automática de CHANGELOG, integrada ao Codex AI",
  "Elite code review expert specializing in modern AI-powered code analysis, security vulnerabilities, performance optimization, and production reliability. Masters static analysis tools, security scanning, and configuration review with 2024/2025 best practices. Use PROACTIVELY for code quality assurance.": "Especialista em revisão de código de elite, especializado em análise de código moderna baseada em IA, vulnerabilidades de segurança, otimização de desempenho e confiabilidade de produção. Domina ferramentas de análise estática, verificação de segurança e revisão de configuração com as práticas recomendadas 2024/2025. Use PROATIVAMENTE para garantia de qualidade do código.",
  "Master effective code review practices to provide constructive feedback, catch bugs early, and foster knowledge sharing while maintaining team morale. Use when reviewing pull requests, establishing...": "Domine práticas eficazes de revisão de código para fornecer feedback construtivo, detectar bugs antecipadamente e promover o compartilhamento de conhecimento, mantendo o moral da equipe. Use ao revisar solicitações pull, estabelecendo...",
  "Create commit messages following Sentry conventions. Use when committing code changes, writing commit messages, or formatting git history. Follows conventional commits with Sentry-specific issue re...": "Crie mensagens de commit seguindo as convenções do Sentry. Use ao confirmar alterações de código, escrever mensagens de confirmação ou formatar o histórico do git. Segue commits convencionais com problemas específicos do Sentry...",
  "Use when working with comprehensive review full review": "Use ao trabalhar com revisão abrangente revisão completa",
  "Initialize project with Conductor artifacts (product definition,": "Inicialize o projeto com artefatos do Conductor (definição do produto,",
  "Execute tasks from a track's implementation plan following TDD workflow": "Execute tarefas do plano de implementação de uma faixa seguindo o fluxo de trabalho do TDD",
  "Git-aware undo by logical work unit (track, phase, or task)": "Desfazer com reconhecimento de Git por unidade de trabalho lógica (faixa, fase ou tarefa)",
  "Manage track lifecycle: archive, restore, delete, rename, and cleanup": "Gerenciar o ciclo de vida da trilha: arquivar, restaurar, excluir, renomear e limpar",
  "Validates Conductor project artifacts for completeness,": "Valida os artefatos do projeto do Conductor quanto à integridade,",
  "Display project status, active tracks, and next actions": "Exibir status do projeto, trilhas ativas e próximas ações",
  "You are a PR optimization expert specializing in creating high-quality pull requests that facilitate efficient code reviews. Generate comprehensive PR descriptions, automate review processes, and e...": "Você é um especialista em otimização de PR especializado na criação de solicitações pull de alta qualidade que facilitam revisões de código eficientes. Gere descrições abrangentes de PR, automatize processos de revisão e...",
  "When the user wants to create competitor comparison or alternative pages for SEO and sales enablement. Also use when the user mentions 'alternative page,' 'vs page,' 'competitor comparison,' 'compa...": "Quando o usuário deseja criar páginas alternativas ou de comparação de concorrentes para SEO e capacitação de vendas. Use também quando o usuário mencionar 'página alternativa', 'página vs', 'comparação do concorrente', 'compa...",
  "Use when a user asks for a plan for a coding task, to generate a clear, actionable, and atomic checklist.": "Use quando um usuário solicitar um plano para uma tarefa de codificação, para gerar uma lista de verificação clara, acionável e atômica.",
  "Build AI agents that interact with computers like humans do - viewing screens, moving cursors, clicking buttons, and typing text. Covers Anthropic's Computer Use, OpenAI's Operator/CUA, and open-so...": "Crie agentes de IA que interajam com computadores como os humanos: visualizando telas, movendo cursores, clicando em botões e digitando texto. Abrange o uso do computador da Anthropic, o operador/CUA ​​da OpenAI e o open-so...",
  "Create a new track with specification and phased implementation plan": "Crie um novo caminho com especificações e plano de implementação em fases",
  "SOTA Computer Vision Expert (2026). Specialized in YOLO26, Segment Anything 3 (SAM 3), Vision Language Models, and real-time spatial analysis.": "Especialista em visão computacional SOTA (2026). Especializado em YOLO26, Segment Anything 3 (SAM 3), Vision Language Models e análise espacial em tempo real.",
  "This skill should be used when the user asks to \\\"analyze": "Esta habilidade deve ser usada quando o usuário pede para \"analisar",
  "Elite content marketing strategist specializing in AI-powered": "Estrategista de marketing de conteúdo de elite especializado em inteligência artificial",
  "Recognize patterns of context failure: lost-in-middle, poisoning, distraction, and clash": "Reconhecer padrões de falha de contexto: perda no meio, envenenamento, distração e conflito",
  "Design and evaluate compression strategies for long-running sessions": "Projetar e avaliar estratégias de compressão para sessões de longa duração",
  "Use this skill when working with Conductor's context-driven": "Use esta habilidade ao trabalhar com o contexto do Conductor",
  "Automate Confluence page creation, content search, space management, labels, and hierarchy navigation via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize a criação de páginas do Confluence, pesquisa de conteúdo, gerenciamento de espaço, rótulos e navegação hierárquica por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Create SEO-optimized marketing content with consistent brand voice. Includes brand voice analyzer, SEO optimizer, content frameworks, and social media templates. Use when writing blog posts, creati...": "Crie conteúdo de marketing otimizado para SEO com voz de marca consistente. Inclui analisador de voz de marca, otimizador de SEO, estruturas de conteúdo e modelos de mídia social. Use ao escrever postagens de blog, criar...",
  "Use when working with context management context restore": "Use ao trabalhar com restauração de contexto de gerenciamento de contexto",
  "Understand what context is, why it matters, and the anatomy of context in agent systems": "Entenda o que é contexto, por que ele é importante e a anatomia do contexto em sistemas de agentes",
  "Persistent memory systems for LLM conversations including short-term, long-term, and entity-based memory Use when: conversation memory, remember, memory persistence, long-term memory, chat history.": "Sistemas de memória persistente para conversas LLM, incluindo memória de curto prazo, longo prazo e baseada em entidade Use quando: memória de conversação, lembrança, persistência de memória, memória de longo prazo, histórico de bate-papo.",
  "Optimize cloud costs through resource rightsizing, tagging strategies, reserved instances, and spending analysis. Use when reducing cloud expenses, analyzing infrastructure costs, or implementing c...": "Otimize os custos da nuvem por meio de redimensionamento de recursos, estratégias de marcação, instâncias reservadas e análise de gastos. Use ao reduzir despesas com nuvem, analisar custos de infraestrutura ou implementar c...",
  "Use when working with context management context save": "Use ao trabalhar com salvamento de contexto de gerenciamento de contexto",
  "When the user wants to edit, review, or improve existing marketing copy. Also use when the user mentions 'edit this copy,' 'review my copy,' 'copy feedback,' 'proofread,' 'polish this,' 'make this ...": "Quando o usuário deseja editar, revisar ou melhorar o texto de marketing existente. Use também quando o usuário mencionar 'editar esta cópia', 'revisar minha cópia', 'copiar feedback', 'revisar', 'polir isto', 'fazer isto...",
  "Automatically fetch latest library/framework documentation for Claude Code via Context7 API": "Buscar automaticamente a documentação mais recente da biblioteca/estrutura para Claude Code por meio da API Context7",
  "Core component library and design system patterns. Use when building UI, using design tokens, or working with the component library.": "Biblioteca de componentes principais e padrões de sistema de design. Use ao criar UI, usar tokens de design ou trabalhar com a biblioteca de componentes.",
  "Build applications powered by GitHub Copilot using the Copilot SDK. Use when creating programmatic integrations with Copilot across Node.js/TypeScript, Python, Go, or .NET. Covers session managemen...": "Crie aplicativos com tecnologia GitHub Copilot usando o Copilot SDK. Use ao criar integrações programáticas com o Copilot em Node.js/TypeScript, Python, Go ou .NET. Abrange o gerenciamento de sessões...",
  "Apply compaction, masking, and caching strategies": "Aplicar estratégias de compactação, mascaramento e cache",
  "Elite AI context engineering specialist mastering dynamic context": "Especialista em engenharia de contexto Elite AI dominando o contexto dinâmico",
  "Strategies for managing LLM context windows including summarization, trimming, routing, and avoiding context rot Use when: context window, token limit, context management, context engineering, long...": "Estratégias para gerenciar janelas de contexto LLM, incluindo resumo, corte, roteamento e evitar podridão de contexto Use quando: janela de contexto, limite de token, gerenciamento de contexto, engenharia de contexto, longo...",
  "Index and search culture documentation": "Documentação de índice e cultura de pesquisa",
  "Implement Command Query Responsibility Segregation for scalable architectures. Use when separating read and write models, optimizing query performance, or building event-sourced systems.": "Implemente a segregação de responsabilidade de consulta de comando para arquiteturas escaláveis. Use ao separar modelos de leitura e gravação, otimizar o desempenho de consultas ou criar sistemas com origem em eventos.",
  "Scrapes content based on a preset URL list, filters high-quality technical information, and generates daily Markdown reports.": "Extrai conteúdo com base em uma lista de URLs predefinida, filtra informações técnicas de alta qualidade e gera relatórios diários de Markdown.",
  "Elite AI-powered customer support specialist mastering": "Masterização especializada em suporte ao cliente com tecnologia Elite AI",
  "Build features guided by data insights, A/B testing, and continuous measurement using specialized agents for analysis, implementation, and experimentation.": "Crie recursos guiados por insights de dados, testes A/B e medição contínua usando agentes especializados para análise, implementação e experimentação.",
  "Write modern C# code with advanced features like records, pattern": "Escreva código C# moderno com recursos avançados como registros e padrões",
  "Create pull requests following Sentry conventions. Use when opening PRs, writing PR descriptions, or preparing changes for review. Follows Sentry's code review guidelines.": "Crie solicitações pull seguindo as convenções do Sentry. Use ao abrir PRs, escrever descrições de PR ou preparar alterações para revisão. Segue as diretrizes de revisão de código do Sentry.",
  "Write idiomatic C++ code with modern features, RAII, smart": "Escreva código C++ idiomático com recursos modernos, RAII, inteligente",
  "Expert in CrewAI - the leading role-based multi-agent framework used by 60% of Fortune 500 companies. Covers agent design with roles and goals, task definition, crew orchestration, process types (s...": "Especialista em CrewAI – a estrutura multiagente baseada em funções líder usada por 60% das empresas Fortune 500. Abrange o design do agente com funções e objetivos, definição de tarefas, orquestração da equipe, tipos de processos (s...",
  "Automate ConvertKit (Kit) tasks via Rube MCP (Composio): manage subscribers, tags, broadcasts, and broadcast stats. Always search tools first for current schemas.": "Automatize tarefas do ConvertKit (Kit) via Rube MCP (Composio): gerencie assinantes, tags, transmissões e estatísticas de transmissão. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Build scalable data pipelines, modern data warehouses, and": "Crie pipelines de dados escaláveis, data warehouses modernos e",
  "You are a data pipeline architecture expert specializing in scalable, reliable, and cost-effective data pipelines for batch and streaming data processing.": "Você é um especialista em arquitetura de pipeline de dados, especializado em pipelines de dados escalonáveis, confiáveis ​​e econômicos para processamento de dados em lote e streaming.",
  "Implement data quality validation with Great Expectations, dbt tests, and data contracts. Use when building data quality pipelines, implementing validation rules, or establishing data contracts.": "Implemente validação de qualidade de dados com Grandes Esperanças, testes dbt e contratos de dados. Use ao criar pipelines de qualidade de dados, implementar regras de validação ou estabelecer contratos de dados.",
  "Expert data scientist for advanced analytics, machine learning, and": "Cientista de dados especialista em análises avançadas, aprendizado de máquina e",
  "Give agents persistent structural memory of a codebase — navigate dependencies, track public APIs, and understand why connections exist without re-reading the whole repo.": "Forneça aos agentes memória estrutural persistente de uma base de código – navegue pelas dependências, rastreie APIs públicas e entenda por que existem conexões sem reler todo o repositório.",
  "Database development and operations workflow covering SQL, NoSQL, database design, migrations, optimization, and data engineering.": "Fluxo de trabalho de desenvolvimento e operações de banco de dados abrangendo SQL, NoSQL, design de banco de dados, migrações, otimização e engenharia de dados.",
  "Transform data into compelling narratives using visualization, context, and persuasive structure. Use when presenting analytics to stakeholders, creating data reports, or building executive present...": "Transforme dados em narrativas atraentes usando visualização, contexto e estrutura persuasiva. Use ao apresentar análises às partes interessadas, criar relatórios de dados ou criar apresentações executivas...",
  "You are a cloud cost optimization expert specializing in reducing infrastructure expenses while maintaining performance and reliability. Analyze cloud spending, identify savings opportunities, and ...": "Você é um especialista em otimização de custos de nuvem, especializado em reduzir despesas de infraestrutura e, ao mesmo tempo, manter o desempenho e a confiabilidade. Analise os gastos com nuvem, identifique oportunidades de economia e...",
  "Expert database architect specializing in data layer design from": "Arquiteto de banco de dados especialista em design de camada de dados de",
  "Expert database administrator specializing in modern cloud": "Administrador de banco de dados especialista em nuvem moderna",
  "Database design principles and decision-making. Schema design, indexing strategy, ORM selection, serverless databases.": "Princípios de design de banco de dados e tomada de decisão. Design de esquema, estratégia de indexação, seleção de ORM, bancos de dados sem servidor.",
  "Migration monitoring, CDC, and observability infrastructure": "Monitoramento de migração, CDC e infraestrutura de observabilidade",
  "Execute database migrations across ORMs and platforms with zero-downtime strategies, data transformation, and rollback procedures. Use when migrating databases, changing schemas, performing data tr...": "Execute migrações de banco de dados entre ORMs e plataformas com estratégias de tempo de inatividade zero, transformação de dados e procedimentos de reversão. Use ao migrar bancos de dados, alterar esquemas, realizar tra...",
  "DBOS Python SDK for building reliable, fault-tolerant applications with durable workflows. Use this skill when writing Python code with DBOS, creating workflows and steps, using queues, using DBOSC...": "DBOS Python SDK para criar aplicativos confiáveis ​​e tolerantes a falhas com fluxos de trabalho duráveis. Use esta habilidade ao escrever código Python com DBOS, criar fluxos de trabalho e etapas, usar filas, usar DBOSC...",
  "Expert database optimizer specializing in modern performance": "Otimizador de banco de dados especializado em desempenho moderno",
  "DBOS Go SDK for building reliable, fault-tolerant applications with durable workflows. Use this skill when writing Go code with DBOS, creating workflows and steps, using queues, using the DBOS Clie...": "DBOS Go SDK para construir aplicativos confiáveis ​​e tolerantes a falhas com fluxos de trabalho duráveis. Use esta habilidade ao escrever código Go com DBOS, criar fluxos de trabalho e etapas, usar filas, usar o DBOS Clie...",
  "DBOS TypeScript SDK for building reliable, fault-tolerant applications with durable workflows. Use this skill when writing TypeScript code with DBOS, creating workflows and steps, using queues, usi...": "DBOS TypeScript SDK para criar aplicativos confiáveis ​​e tolerantes a falhas com fluxos de trabalho duráveis. Use esta habilidade ao escrever código TypeScript com DBOS, criando fluxos de trabalho e etapas, usando filas, us...",
  "Map relationships between bounded contexts and define integration contracts using DDD context mapping patterns.": "Mapeie relacionamentos entre contextos limitados e defina contratos de integração usando padrões de mapeamento de contexto DDD.",
  "Master dbt (data build tool) for analytics engineering with model organization, testing, documentation, and incremental strategies. Use when building data transformations, creating data models, or ...": "Domine dbt (ferramenta de construção de dados) para engenharia analítica com organização de modelos, testes, documentação e estratégias incrementais. Use ao construir transformações de dados, criar modelos de dados ou ...",
  "Design DDD strategic artifacts including subdomains, bounded contexts, and ubiquitous language for complex business domains.": "Projete artefatos estratégicos de DDD, incluindo subdomínios, contextos limitados e linguagem onipresente para domínios de negócios complexos.",
  "Debugging specialist for errors, test failures, and unexpected": "Especialista em depuração de erros, falhas de teste e imprevistos",
  "Apply DDD tactical patterns in code using entities, value objects, aggregates, repositories, and domain events with explicit invariants.": "Aplique padrões táticos DDD em código usando entidades, objetos de valor, agregações, repositórios e eventos de domínio com invariantes explícitas.",
  "Master systematic debugging techniques, profiling tools, and root cause analysis to efficiently track down bugs across any codebase or technology stack. Use when investigating bugs, performance iss...": "Domine técnicas sistemáticas de depuração, ferramentas de criação de perfil e análise de causa raiz para rastrear bugs com eficiência em qualquer base de código ou pilha de tecnologia. Use ao investigar bugs, problemas de desempenho...",
  "Automate Datadog tasks via Rube MCP (Composio): query metrics, search logs, manage monitors/dashboards, create events and downtimes. Always search tools first for current schemas.": "Automatize tarefas do Datadog via Rube MCP (Composio): consulte métricas, pesquise logs, gerencie monitores/dashboards, crie eventos e tempos de inatividade. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "SQL database migrations with zero-downtime strategies for PostgreSQL, MySQL, and SQL Server. Focus on data integrity and rollback plans.": "Migrações de banco de dados SQL com estratégias de tempo de inatividade zero para PostgreSQL, MySQL e SQL Server. Concentre-se na integridade dos dados e nos planos de reversão.",
  "Use when working with debugging toolkit smart debug": "Use ao trabalhar com depuração inteligente do kit de ferramentas de depuração",
  "Implement DeFi protocols with production-ready templates for staking, AMMs, governance, and lending systems. Use when building decentralized finance applications or smart contract protocols.": "Implemente protocolos DeFi com modelos prontos para produção para sistemas de piquetagem, AMMs, governança e empréstimo. Use ao criar aplicativos financeiros descentralizados ou protocolos de contratos inteligentes.",
  "Design multi-stage CI/CD pipelines with approval gates, security checks, and deployment orchestration. Use when architecting deployment workflows, setting up continuous delivery, or implementing Gi...": "Projete pipelines de CI/CD de vários estágios com portas de aprovação, verificações de segurança e orquestração de implantação. Use ao arquitetar fluxos de trabalho de implantação, configurar entrega contínua ou implementar Gi...",
  "Manage major dependency version upgrades with compatibility analysis, staged rollout, and comprehensive testing. Use when upgrading framework versions, updating major dependencies, or managing brea...": "Gerencie atualizações de versões de dependências importantes com análise de compatibilidade, implementação gradual e testes abrangentes. Use ao atualizar versões da estrutura, atualizar dependências principais ou gerenciar...",
  "Expert deployment engineer specializing in modern CI/CD pipelines,": "Engenheiro de implantação especializado em pipelines modernos de CI/CD,",
  "You are a configuration management expert specializing in validating, testing, and ensuring the correctness of application configurations. Create comprehensive validation schemas, implement configurat": "Você é um especialista em gerenciamento de configuração especializado em validar, testar e garantir a exatidão das configurações de aplicativos. Crie esquemas de validação abrangentes, implemente configurações",
  "Analyze Stitch projects and synthesize a semantic design system into DESIGN.md files": "Analise projetos Stitch e sintetize um sistema de design semântico em arquivos DESIGN.md",
  "Comprehensive web, mobile, and backend development workflow bundling frontend, backend, full-stack, and mobile development skills for end-to-end application delivery.": "Fluxo de trabalho abrangente de desenvolvimento web, móvel e back-end, agrupando habilidades de desenvolvimento front-end, back-end, full-stack e móvel para entrega de aplicativos de ponta a ponta.",
  "Orchestrates design workflows by routing work through brainstorming, multi-agent review, and execution readiness in the correct order. Prevents premature implementation, skipped validation, and unreviewed high-risk designs.": "Orquestra fluxos de trabalho de design roteando o trabalho por meio de brainstorming, revisão multiagente e prontidão de execução na ordem correta. Evita implementação prematura, validação ignorada e designs de alto risco não revisados.",
  "Execute autonomous multi-step research using Google Gemini Deep Research Agent. Use for: market analysis, competitive landscaping, literature reviews, technical research, due diligence. Takes 2-10 ...": "Execute pesquisas autônomas em várias etapas usando o Google Gemini Deep Research Agent. Use para: análise de mercado, cenário competitivo, revisões de literatura, pesquisa técnica, due diligence. Leva de 2 a 10 ...",
  "Expert DevOps troubleshooter specializing in rapid incident": "Solucionador de problemas especialista em DevOps especializado em incidentes rápidos",
  "You are a debugging expert specializing in setting up comprehensive debugging environments, distributed tracing, and diagnostic tools. Configure debugging workflows, implement tracing solutions, an...": "Você é um especialista em depuração especializado na configuração de ambientes de depuração abrangentes, rastreamento distribuído e ferramentas de diagnóstico. Configure fluxos de trabalho de depuração, implemente soluções de rastreamento e...",
  "Specialized skill for building production-ready Discord bots. Covers Discord.js (JavaScript) and Pycord (Python), gateway intents, slash commands, interactive components, rate limiting, and sharding.": "Habilidade especializada para construir bots Discord prontos para produção. Abrange Discord.js (JavaScript) e Pycord (Python), intenções de gateway, comandos de barra, componentes interativos, limitação de taxa e fragmentação.",
  "Creates comprehensive technical documentation from existing": "Cria documentação técnica abrangente a partir de informações existentes",
  "Docker containerization expert with deep knowledge of multi-stage builds, image optimization, container security, Docker Compose orchestration, and production deployment patterns. Use PROACTIVELY f...": "Especialista em conteinerização Docker com profundo conhecimento de construções em vários estágios, otimização de imagens, segurança de contêineres, orquestração Docker Compose e padrões de implantação de produção. Use PROATIVAMENTE...",
  "Implement distributed tracing with Jaeger and Tempo to track requests across microservices and identify performance bottlenecks. Use when debugging microservices, analyzing request flows, or implem...": "Implemente rastreamento distribuído com Jaeger e Tempo para rastrear solicitações em microsserviços e identificar gargalos de desempenho. Use ao depurar microsserviços, analisar fluxos de solicitação ou implementar...",
  "Production deployment principles and decision-making. Safe deployment workflows, rollback strategies, and verification. Teaches thinking, not scripts.": "Princípios de implantação da produção e tomada de decisões. Fluxos de trabalho de implantação seguros, estratégias de reversão e verificação. Ensina a pensar, não a scripts.",
  "Automate Discord tasks via Rube MCP (Composio): messages, channels, roles, webhooks, reactions. Always search tools first for current schemas.": "Automatize tarefas do Discord via Rube MCP (Composio): mensagens, canais, funções, webhooks, reações. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Documentation templates and structure guidelines. README, API docs, code comments, and AI-friendly documentation.": "Modelos de documentação e diretrizes de estrutura. README, documentos de API, comentários de código e documentação amigável para IA.",
  "Master Django 5.x with async views, DRF, Celery, and Django": "Domine Django 5.x com visualizações assíncronas, DRF, Celery e Django",
  "Documentation generation workflow covering API docs, architecture docs, README files, code comments, and technical writing.": "Fluxo de trabalho de geração de documentação cobrindo documentos de API, documentos de arquitetura, arquivos README, comentários de código e redação técnica.",
  "Guide users through a structured workflow for co-authoring documentation. Use when user wants to write documentation, proposals, technical specs, decision docs, or similar structured content. This ...": "Oriente os usuários por meio de um fluxo de trabalho estruturado para coautoria de documentação. Use quando o usuário quiser escrever documentação, propostas, especificações técnicas, documentos de decisão ou conteúdo estruturado semelhante. Esse ...",
  "Use when facing 2+ independent tasks that can be worked on without shared state or sequential dependencies": "Use ao enfrentar mais de 2 tarefas independentes que podem ser trabalhadas sem estado compartilhado ou dependências sequenciais",
  "Comprehensive document creation, editing, and analysis with support for tracked changes, comments, formatting preservation, and text extraction. When Claude needs to work with professional document...": "Criação, edição e análise abrangente de documentos com suporte para alterações rastreadas, comentários, preservação de formatação e extração de texto. Quando Claude precisa trabalhar com documentos profissionais...",
  "Plan and route Domain-Driven Design work from strategic modeling to tactical implementation and evented architecture patterns.": "Planeje e direcione o trabalho de Design Orientado a Domínio, desde a modelagem estratégica até a implementação tática e padrões de arquitetura de eventos.",
  "Automate DocuSign tasks via Rube MCP (Composio): templates, envelopes, signatures, document management. Always search tools first for current schemas.": "Automatize tarefas DocuSign via Rube MCP (Composio): modelos, envelopes, assinaturas, gerenciamento de documentos. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Expert .NET backend architect specializing in C#, ASP.NET Core,": "Arquiteto especialista em back-end .NET especializado em C#, ASP.NET Core,",
  "Developer Experience specialist. Improves tooling, setup, and": "Especialista em Experiência do Desenvolvedor. Melhora as ferramentas, a configuração e",
  "Write idiomatic Elixir code with OTP patterns, supervision trees,": "Escreva código Elixir idiomático com padrões OTP, árvores de supervisão,",
  "Create employment contracts, offer letters, and HR policy documents following legal best practices. Use when drafting employment agreements, creating HR policies, or standardizing employment docume...": "Crie contratos de trabalho, cartas de oferta e documentos de política de RH seguindo as melhores práticas legais. Use ao redigir contratos de trabalho, criar políticas de RH ou padronizar documentos de emprego...",
  "End-to-end testing workflow with Playwright for browser automation, visual regression, cross-browser testing, and CI/CD integration.": "Fluxo de trabalho de teste ponta a ponta com Playwright para automação de navegador, regressão visual, teste entre navegadores e integração CI/CD.",
  "Guide developers through setting up development environments with proper tools, dependencies, and configurations": "Orientar os desenvolvedores na configuração de ambientes de desenvolvimento com ferramentas, dependências e configurações adequadas",
  "You are an expert error analysis specialist with deep expertise in debugging distributed systems, analyzing production incidents, and implementing comprehensive observability solutions.": "Você é um especialista em análise de erros com profundo conhecimento em depuração de sistemas distribuídos, análise de incidentes de produção e implementação de soluções abrangentes de observabilidade.",
  "Use when working with error debugging multi agent review": "Use ao trabalhar com depuração de erros de revisão multiagente",
  "Select and optimize embedding models for semantic search and RAG applications. Use when choosing embedding models, implementing chunking strategies, or optimizing embedding quality for specific dom...": "Selecione e otimize modelos de incorporação para pesquisa semântica e aplicativos RAG. Use ao escolher modelos de incorporação, implementar estratégias de agrupamento ou otimizar a qualidade de incorporação para domínios específicos...",
  "Search logs and codebases for error patterns, stack traces, and": "Pesquise logs e bases de código em busca de padrões de erro, rastreamentos de pilha e",
  "Automate Dropbox file management, sharing, search, uploads, downloads, and folder operations via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize o gerenciamento, compartilhamento, pesquisa, uploads, downloads e operações de pastas de arquivos do Dropbox por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Master C#/.NET backend development patterns for building robust APIs, MCP servers, and enterprise applications. Covers async/await, dependency injection, Entity Framework Core, Dapper, configuratio...": "Domine padrões de desenvolvimento de back-end C#/.NET para criar APIs, servidores MCP e aplicativos corporativos robustos. Abrange assíncrono/espera, injeção de dependência, Entity Framework Core, Dapper, configuração...",
  "When the user wants to create or optimize an email sequence, drip campaign, automated email flow, or lifecycle email program. Also use when the user mentions \"email sequence,\" \"drip campa...": "Quando o usuário deseja criar ou otimizar uma sequência de e-mail, campanha de gotejamento, fluxo automatizado de e-mail ou programa de ciclo de vida de e-mail. Use também quando o usuário mencionar \"sequência de e-mail\", \"campanha de gotejamento...",
  "Build ASP.NET Core 8+ backend services with EF Core, auth, background jobs, and production API patterns.": "Crie serviços de back-end do ASP.NET Core 8+ com EF Core, autenticação, trabalhos em segundo plano e padrões de API de produção.",
  "Email has the highest ROI of any marketing channel. $36 for every $1 spent. Yet most startups treat it as an afterthought - bulk blasts, no personalization, landing in spam folders.  This skill cov...": "O e-mail tem o maior ROI de qualquer canal de marketing. $ 36 para cada $ 1 gasto. No entanto, a maioria das startups trata isso como uma reflexão tardia – explosões em massa, sem personalização, caindo em pastas de spam.  Essa habilidade cobre...",
  "You are an error tracking and observability expert specializing in implementing comprehensive error monitoring solutions. Set up error tracking systems, configure alerts, implement structured loggi...": "Você é um especialista em monitoramento de erros e observabilidade, especializado na implementação de soluções abrangentes de monitoramento de erros. Configurar sistemas de rastreamento de erros, configurar alertas, implementar logs estruturados...",
  "Master end-to-end testing with Playwright and Cypress to build reliable test suites that catch bugs, improve confidence, and enable fast deployment. Use when implementing E2E tests, debugging flaky...": "Domine os testes ponta a ponta com Playwright e Cypress para criar suítes de testes confiáveis ​​que detectam bugs, melhoram a confiança e permitem implantação rápida. Use ao implementar testes E2E, depurar erros...",
  "You are an error tracking and observability expert specializing in implementing comprehensive error monitoring solutions. Set up error tracking systems, configure alerts, implement structured logging,": "Você é um especialista em monitoramento de erros e observabilidade, especializado na implementação de soluções abrangentes de monitoramento de erros. Configure sistemas de rastreamento de erros, configure alertas, implemente registros estruturados,",
  "Master error handling patterns across languages including exceptions, Result types, error propagation, and graceful degradation to build resilient applications. Use when implementing error handling...": "Domine padrões de tratamento de erros em linguagens, incluindo exceções, tipos de resultados, propagação de erros e degradação suave para criar aplicativos resilientes. Use ao implementar o tratamento de erros...",
  "Use when working with error diagnostics smart debug": "Use ao trabalhar com depuração inteligente de diagnóstico de erros",
  "This skill should be used when the user asks to \"learn ethical hacking\", \"understand penetration testing lifecycle\", \"perform reconnaissance\", \"conduct security scanning\", \"exploit ...": "Esta habilidade deve ser usada quando o usuário pede para \"aprender hacking ético\", \"entender o ciclo de vida dos testes de penetração\", \"realizar reconhecimento\", \"conduzir varredura de segurança\", \"explorar...",
  "Build evaluation frameworks for agent systems": "Crie estruturas de avaliação para sistemas de agentes",
  "Use when you have a written implementation plan to execute in a separate session with review checkpoints": "Use quando você tiver um plano de implementação escrito para executar em uma sessão separada com pontos de verificação de revisão",
  "Semantic search, similar content discovery, and structured research using Exa API": "Pesquisa semântica, descoberta de conteúdo semelhante e pesquisa estruturada usando Exa API",
  "Text-to-speech and speech-to-text using fal.ai audio models": "Conversão de texto para fala e fala para texto usando modelos de áudio fal.ai",
  "Expert in event sourcing, CQRS, and event-driven architecture patterns. Masters event store design, projection building, saga orchestration, and eventual consistency patterns. Use PROACTIVELY for e...": "Especialista em fornecimento de eventos, CQRS e padrões de arquitetura orientada a eventos. Domine o design da loja de eventos, construção de projeções, orquestração de sagas e padrões de consistência eventuais. Use PROATIVAMENTE para e...",
  "Platform APIs for model management, pricing, and usage tracking": "APIs de plataforma para gerenciamento de modelos, preços e rastreamento de uso",
  "Design and implement event stores for event-sourced systems. Use when building event sourcing infrastructure, choosing event store technologies, or implementing event persistence patterns.": "Projete e implemente armazenamentos de eventos para sistemas originados de eventos. Use ao construir infraestrutura de fornecimento de eventos, escolher tecnologias de armazenamento de eventos ou implementar padrões de persistência de eventos.",
  "Generate images and videos using fal.ai AI models": "Gere imagens e vídeos usando modelos fal.ai AI",
  "Build high-performance async APIs with FastAPI, SQLAlchemy 2.0, and": "Crie APIs assíncronas de alto desempenho com FastAPI, SQLAlchemy 2.0 e",
  "Create FastAPI routers with CRUD operations, authentication dependencies, and proper response models. Use when building REST API endpoints, creating new routes, implementing CRUD operations, or add...": "Crie roteadores FastAPI com operações CRUD, dependências de autenticação e modelos de resposta adequados. Use ao construir endpoints de API REST, criar novas rotas, implementar operações CRUD ou adicionar...",
  "Deploy Expo apps to production": "Implantar aplicativos Expo em produção",
  "Upscale and enhance image and video resolution using AI": "Aumente e melhore a resolução de imagem e vídeo usando IA",
  "Generate workflow JSON files for chaining AI models": "Gere arquivos JSON de fluxo de trabalho para encadear modelos de IA",
  "AI-powered image editing with style transfer and object removal": "Edição de imagens com tecnologia de IA com transferência de estilo e remoção de objetos",
  "Intelligently organizes files and folders by understanding context, finding duplicates, and suggesting better organizational structures. Use when user wants to clean up directories, organize downlo...": "Organiza arquivos e pastas de forma inteligente, compreendendo o contexto, encontrando duplicatas e sugerindo melhores estruturas organizacionais. Use quando o usuário quiser limpar diretórios, organizar downloads...",
  "Web fuzzing with ffuf": "Web confusa com ffuf",
  "Create production-ready FastAPI projects with async patterns, dependency injection, and comprehensive error handling. Use when building new FastAPI applications or setting up backend API projects.": "Crie projetos FastAPI prontos para produção com padrões assíncronos, injeção de dependência e tratamento abrangente de erros. Use ao criar novos aplicativos FastAPI ou configurar projetos de API de back-end.",
  "Automate Figma tasks via Rube MCP (Composio): files, components, design tokens, comments, exports. Always search tools first for current schemas.": "Automatize tarefas Figma via Rube MCP (Composio): arquivos, componentes, tokens de design, comentários, exportações. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Find bugs, security vulnerabilities, and code quality issues in local branch changes. Use when asked to review changes, find bugs, security review, or audit code on the current branch.": "Encontre bugs, vulnerabilidades de segurança e problemas de qualidade de código em alterações de filiais locais. Use quando solicitado a revisar alterações, encontrar bugs, revisão de segurança ou auditar código na ramificação atual.",
  "Expert firmware analyst specializing in embedded systems, IoT": "Analista especialista em firmware especializado em sistemas embarcados, IoT",
  "Master Flutter development with Dart 3, advanced widgets, and": "Domine o desenvolvimento do Flutter com Dart 3, widgets avançados e",
  "Use when implementation is complete, all tests pass, and you need to decide how to integrate the work - guides completion of development work by presenting structured options for merge, PR, or cleanup": "Use quando a implementação for concluída, todos os testes forem aprovados e você precisar decidir como integrar o trabalho - orienta a conclusão do trabalho de desenvolvimento apresentando opções estruturadas para mesclagem, RP ou limpeza",
  "Verify fix commits address audit findings without new bugs": "Verifique se os commits de correção abordam as descobertas de auditoria sem novos bugs",
  "You are a code migration expert specializing in transitioning codebases between frameworks, languages, versions, and platforms. Generate comprehensive migration plans, automated migration scripts, and": "Você é um especialista em migração de código especializado na transição de bases de código entre estruturas, linguagens, versões e plataformas. Gere planos de migração abrangentes, scripts de migração automatizados e",
  "Deep web scraping, screenshots, PDF parsing, and website crawling using Firecrawl API": "Deep web scraping, capturas de tela, análise de PDF e rastreamento de sites usando a API Firecrawl",
  "You are a dependency management expert specializing in safe, incremental upgrades of project dependencies. Plan and execute dependency updates with minimal risk, proper testing, and clear migration pa": "Você é um especialista em gerenciamento de dependências, especializado em atualizações incrementais e seguras de dependências de projetos. Planeje e execute atualizações de dependências com risco mínimo, testes adequados e etapas de migração claras",
  "Handle errors as values using fp-ts Either and TaskEither for cleaner, more predictable TypeScript code. Use when implementing error handling patterns with fp-ts.": "Trate erros como valores usando fp-ts Both e TaskEither para obter um código TypeScript mais limpo e previsível. Use ao implementar padrões de tratamento de erros com fp-ts.",
  "Firebase gives you a complete backend in minutes - auth, database, storage, functions, hosting. But the ease of setup hides real complexity. Security rules are your last line of defense, and they'r...": "O Firebase oferece um back-end completo em minutos – autenticação, banco de dados, armazenamento, funções, hospedagem. Mas a facilidade de configuração esconde uma complexidade real. As regras de segurança são sua última linha de defesa e são...",
  "Expert at handling file uploads and cloud storage. Covers S3, Cloudflare R2, presigned URLs, multipart uploads, and image optimization. Knows how to handle large files without blocking. Use when: f...": "Especialista em lidar com uploads de arquivos e armazenamento em nuvem. Abrange S3, Cloudflare R2, URLs pré-assinados, multipart uploads e otimização de imagens. Sabe como lidar com arquivos grandes sem bloqueios. Use quando: f...",
  "Practical patterns for using fp-ts with React - hooks, state, forms, data fetching. Use when building React apps with functional programming patterns. Works with React 18/19, Next.js 14/15.": "Padrões práticos para usar fp-ts com React - ganchos, estado, formulários, busca de dados. Use ao criar aplicativos React com padrões de programação funcionais. Funciona com React 18/19, Next.js 14/15.",
  "This skill should be used when the user asks to \"test for directory traversal\", \"exploit path traversal vulnerabilities\", \"read arbitrary files through web applications\", \"find LFI vu...": "Esta habilidade deve ser usada quando o usuário pede para \"testar a passagem de diretório\", \"explorar vulnerabilidades de passagem de caminho\", \"ler arquivos arbitrários através de aplicativos da web\", \"encontrar LFI vu...",
  "Orchestrate a comprehensive legacy system modernization using the strangler fig pattern, enabling gradual replacement of outdated components while maintaining continuous business operations through ex": "Orquestre uma modernização abrangente do sistema legado usando o padrão strangler fig, permitindo a substituição gradual de componentes desatualizados e mantendo operações de negócios contínuas por meio de ex",
  "Create distinctive, production-grade frontend interfaces with intentional aesthetics, high craft, and non-generic visual identity. Use when building or styling web UIs, components, pages, dashboard...": "Crie interfaces front-end distintas de nível de produção com estética intencional, alta habilidade e identidade visual não genérica. Use ao criar ou estilizar UIs da web, componentes, páginas, painéis...",
  "When the user wants to plan, evaluate, or build a free tool for marketing purposes — lead generation, SEO value, or brand awareness. Also use when the user mentions \"engineering as mar...": "Quando o usuário deseja planejar, avaliar ou construir uma ferramenta gratuita para fins de marketing – geração de leads, valor de SEO ou reconhecimento de marca. Use também quando o usuário mencionar \"engenharia como mar...",
  "A practical, jargon-free guide to fp-ts functional programming - the 80/20 approach that gets results without the academic overhead. Use when writing TypeScript with fp-ts library.": "Um guia prático e sem jargões para programação funcional fp-ts - a abordagem 80/20 que obtém resultados sem sobrecarga acadêmica. Use ao escrever TypeScript com a biblioteca fp-ts.",
  "Automate Freshservice ITSM tasks via Rube MCP (Composio): create/update tickets, bulk operations, service requests, and outbound emails. Always search tools first for current schemas.": "Automatize tarefas de ITSM do Freshservice por meio do Rube MCP (Composio): crie/atualize tickets, operações em massa, solicitações de serviço e e-mails enviados. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Automate Freshdesk helpdesk operations including tickets, contacts, companies, notes, and replies via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize as operações de helpdesk do Freshdesk, incluindo tickets, contatos, empresas, notas e respostas por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Build React components, implement responsive layouts, and handle": "Crie componentes React, implemente layouts responsivos e lide com",
  "You are a React component architecture expert specializing in scaffolding production-ready, accessible, and performant components. Generate complete component implementations with TypeScript, tests, s": "Você é um especialista em arquitetura de componentes React, especializado em componentes prontos para produção, acessíveis e de alto desempenho. Gere implementações completas de componentes com TypeScript, testes, s",
  "Build dark-themed React applications using Tailwind CSS with custom theming, glassmorphism effects, and Framer Motion animations. Use when creating dashboards, admin panels, or data-rich interfaces...": "Crie aplicativos React com tema escuro usando Tailwind CSS com temas personalizados, efeitos de morfismo de vidro e animações Framer Motion. Use ao criar dashboards, painéis de administração ou interfaces ricas em dados...",
  "Expert in secure frontend coding practices specializing in XSS": "Especialista em práticas seguras de codificação de front-end, especializado em XSS",
  "You are a frontend security specialist focusing on Cross-Site Scripting (XSS) vulnerability detection and prevention. Analyze React, Vue, Angular, and vanilla JavaScript code to identify injection poi": "Você é um especialista em segurança de front-end com foco na detecção e prevenção de vulnerabilidades de Cross-Site Scripting (XSS). Analise o código JavaScript React, Vue, Angular e Vanilla para identificar pontos de injeção",
  "Opinionated frontend development standards for modern React + TypeScript applications. Covers Suspense-first data fetching, lazy loading, feature-based architecture, MUI v7 styling, TanStack Router...": "Padrões de desenvolvimento de front-end opinativos para aplicativos React + TypeScript modernos. Abrange busca de dados com suspense, carregamento lento, arquitetura baseada em recursos, estilo MUI v7, roteador TanStack...",
  "Create stunning, animation-rich HTML presentations from scratch or by converting PowerPoint files. Use when the user wants to build a presentation, convert a PPT/PPTX to web, or create slides for a...": "Crie apresentações HTML impressionantes e ricas em animação do zero ou convertendo arquivos do PowerPoint. Use quando o usuário quiser construir uma apresentação, converter um PPT/PPTX para web ou criar slides para um...",
  "Use when working with full stack orchestration full stack feature": "Use ao trabalhar com o recurso full stack de orquestração full stack",
  "Specialized skill for building production-ready serverless applications on GCP. Covers Cloud Run services (containerized), Cloud Run Functions (event-driven), cold start optimization, and event-dri...": "Habilidade especializada para criar aplicativos sem servidor prontos para produção no GCP. Abrange serviços Cloud Run (contêinerizados), Cloud Run Functions (orientados a eventos), otimização de inicialização a frio e direcionamento de eventos...",
  "Game development orchestrator. Routes to platform-specific skills based on project needs.": "Orquestrador de desenvolvimento de jogos. Rotas para habilidades específicas da plataforma com base nas necessidades do projeto.",
  "Implement GDPR-compliant data handling with consent management, data subject rights, and privacy by design. Use when building systems that process EU personal data, implementing privacy controls, o...": "Implemente o tratamento de dados em conformidade com o GDPR com gerenciamento de consentimento, direitos do titular dos dados e privacidade desde o projeto. Use ao construir sistemas que processem dados pessoais da UE, implementando controles de privacidade, ou...",
  "Multiplayer game development principles. Architecture, networking, synchronization.": "Princípios de desenvolvimento de jogos multijogador. Arquitetura, rede, sincronização.",
  "2D game development principles. Sprites, tilemaps, physics, camera.": "Princípios de desenvolvimento de jogos 2D. Sprites, mapas de blocos, física, câmera.",
  "Game audio principles. Sound design, music integration, adaptive audio systems.": "Princípios de áudio do jogo. Design de som, integração musical, sistemas de áudio adaptativos.",
  "Mobile game development principles. Touch input, battery, performance, app stores.": "Princípios de desenvolvimento de jogos móveis. Entrada de toque, bateria, desempenho, lojas de aplicativos.",
  "3D game development principles. Rendering, shaders, physics, cameras.": "Princípios de desenvolvimento de jogos 3D. Renderização, shaders, física, câmeras.",
  "Game design principles. GDD structure, balancing, player psychology, progression.": "Princípios de design de jogos. Estrutura GDD, balanceamento, psicologia do jogador, progressão.",
  "VR/AR development principles. Comfort, interaction, performance requirements.": "Princípios de desenvolvimento de VR/AR. Conforto, interação, requisitos de desempenho.",
  "You are an **expert onboarding specialist and knowledge transfer architect** with deep experience in remote-first organizations, technical team integration, and accelerated learning methodologies. You": "Você é um **especialista em integração e arquiteto de transferência de conhecimento** com profunda experiência em organizações remotas, integração de equipe técnica e metodologias de aprendizagem acelerada. Você",
  "Generative Engine Optimization for AI search engines (ChatGPT, Claude, Perplexity).": "Otimização generativa de mecanismos para mecanismos de busca de IA (ChatGPT, Claude, Perplexity).",
  "Master advanced Git workflows including rebasing, cherry-picking, bisect, worktrees, and reflog to maintain clean history and recover from any situation. Use when managing complex Git histories, co...": "Domine fluxos de trabalho Git avançados, incluindo rebase, seleção seletiva, bissecção, árvores de trabalho e reflog para manter o histórico limpo e se recuperar de qualquer situação. Use ao gerenciar históricos complexos do Git, co...",
  "Orchestrate a comprehensive git workflow from code review through PR creation, leveraging specialized agents for quality assurance, testing, and deployment readiness. This workflow implements modern g": "Orquestre um fluxo de trabalho git abrangente, desde a revisão do código até a criação de PR, aproveitando agentes especializados para garantia de qualidade, testes e prontidão para implantação. Este fluxo de trabalho implementa g moderno",
  "You are a PR optimization expert specializing in creating high-quality pull requests that facilitate efficient code reviews. Generate comprehensive PR descriptions, automate review processes, and ensu": "Você é um especialista em otimização de PR especializado na criação de solicitações pull de alta qualidade que facilitam revisões de código eficientes. Gere descrições abrangentes de PR, automatize processos de revisão e garanta",
  "Use this skill when building applications with Gemini models, Gemini API, working with multimodal content (text, images, audio, video), implementing function calling, using structured outputs, or n...": "Use esta habilidade ao construir aplicações com modelos Gemini, API Gemini, trabalhar com conteúdo multimodal (texto, imagens, áudio, vídeo), implementar chamadas de funções, usar saídas estruturadas ou n...",
  "Web browser game development principles. Framework selection, WebGPU, optimization, PWA.": "Princípios de desenvolvimento de jogos para navegadores da Web. Seleção de framework, WebGPU, otimização, PWA.",
  "Game art principles. Visual style selection, asset pipeline, animation workflow.": "Princípios da arte do jogo. Seleção de estilo visual, pipeline de ativos, fluxo de trabalho de animação.",
  "Automate GitHub repositories, issues, pull requests, branches, CI/CD, and permissions via Rube MCP (Composio). Manage code workflows, review PRs, search code, and handle deployments programmatically.": "Automatize repositórios, problemas, solicitações pull, ramificações, CI/CD e permissões do GitHub por meio do Rube MCP (Composio). Gerencie fluxos de trabalho de código, revise PRs, pesquise código e lide com implantações de maneira programática.",
  "Create production-ready GitHub Actions workflows for automated testing, building, and deploying applications. Use when setting up CI/CD with GitHub Actions, automating development workflows, or cre...": "Crie fluxos de trabalho do GitHub Actions prontos para produção para testes automatizados, criação e implantação de aplicativos. Use ao configurar CI/CD com GitHub Actions, automatizar fluxos de trabalho de desenvolvimento ou criar...",
  "Stage, commit, and push git changes with conventional commit messages. Use when user wants to commit and push changes, mentions pushing to remote, or asks to save and push their work. Also activate...": "Prepare, confirme e envie alterações do git com mensagens de commit convencionais. Use quando o usuário deseja confirmar e enviar alterações, menciona enviar para remoto ou pede para salvar e enviar seu trabalho. Ative também...",
  "Convert raw notes, error logs, voice dictation, or screenshots into crisp GitHub-flavored markdown issue reports. Use when the user pastes bug info, error messages, or informal descriptions and wan...": "Converta notas brutas, registros de erros, ditados de voz ou capturas de tela em relatórios nítidos de problemas de remarcação com sabor do GitHub. Use quando o usuário cola informações de bugs, mensagens de erro ou descrições informais e deseja...",
  "PC and console game development principles. Engine selection, platform features, optimization strategies.": "Princípios de desenvolvimento de jogos para PC e console. Seleção de motores, recursos da plataforma, estratégias de otimização.",
  "Implement GitOps workflows with ArgoCD and Flux for automated, declarative Kubernetes deployments with continuous reconciliation. Use when implementing GitOps practices, automating Kubernetes deplo...": "Implemente fluxos de trabalho GitOps com ArgoCD e Flux para implantações automatizadas e declarativas do Kubernetes com reconciliação contínua. Use ao implementar práticas de GitOps, automatizando a implantação do Kubernetes...",
  "Expert capability for robust, stealthy, and efficient browser automation using Playwright Go.": "Capacidade especializada para automação de navegador robusta, furtiva e eficiente usando Playwright Go.",
  "Automate Google Calendar events, scheduling, availability checks, and attendee management via Rube MCP (Composio). Create events, find free slots, manage attendees, and list calendars programmatica...": "Automatize eventos, agendamento, verificações de disponibilidade e gerenciamento de participantes do Google Agenda por meio do Rube MCP (Composio). Crie eventos, encontre vagas gratuitas, gerencie participantes e liste calendários de forma programática...",
  "Master Godot 4 GDScript patterns including signals, scenes, state machines, and optimization. Use when building Godot games, implementing game systems, or learning GDScript best practices.": "Domine os padrões GDScript do Godot 4, incluindo sinais, cenas, máquinas de estado e otimização. Use ao criar jogos Godot, implementar sistemas de jogos ou aprender as práticas recomendadas de GDScript.",
  "Automate GitLab project management, issues, merge requests, pipelines, branches, and user operations via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize o gerenciamento de projetos, problemas, solicitações de mesclagem, pipelines, ramificações e operações de usuário do GitLab por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Specialized guide for migrating Godot 3.x projects to Godot 4 (GDScript 2.0), covering syntax changes, Tweens, and exports.": "Guia especializado para migração de projetos Godot 3.x para Godot 4 (GDScript 2.0), abrangendo alterações de sintaxe, interpolações e exportações.",
  "Build GitLab CI/CD pipelines with multi-stage workflows, caching, and distributed runners for scalable automation. Use when implementing GitLab CI/CD, optimizing pipeline performance, or setting up...": "Crie pipelines de CI/CD do GitLab com fluxos de trabalho de vários estágios, cache e executores distribuídos para automação escalonável. Use ao implementar CI/CD do GitLab, otimizar o desempenho do pipeline ou configurar...",
  "Master Go concurrency with goroutines, channels, sync primitives, and context. Use when building concurrent Go applications, implementing worker pools, or debugging race conditions.": "Simultaneidade Master Go com goroutines, canais, primitivas de sincronização e contexto. Use ao criar aplicativos Go simultâneos, implementar pools de trabalhadores ou depurar condições de corrida.",
  "Comprehensive guide for browser automation and web scraping with go-rod (Chrome DevTools Protocol) including stealth anti-bot-detection patterns.": "Guia abrangente para automação de navegador e web scraping com go-rod (protocolo Chrome DevTools), incluindo padrões furtivos de detecção anti-bot.",
  "Master Go 1.21+ with modern patterns, advanced concurrency,": "Master Go 1.21+ com padrões modernos, simultaneidade avançada,",
  "Automate Google Drive file operations (upload, download, search, share, organize) via Rube MCP (Composio). Upload/download files, manage folders, share with permissions, and search across drives pr...": "Automatize as operações de arquivos do Google Drive (upload, download, pesquisa, compartilhamento, organização) via Rube MCP (Composio). Faça upload/download de arquivos, gerencie pastas, compartilhe com permissões e pesquise em unidades pr...",
  "Create and manage production Grafana dashboards for real-time visualization of system and application metrics. Use when building monitoring dashboards, visualizing metrics, or creating operational ...": "Crie e gerencie painéis de produção do Grafana para visualização em tempo real de métricas de sistemas e aplicativos. Use ao criar painéis de monitoramento, visualizar métricas ou criar ...",
  "Automate Google Sheets operations (read, write, format, filter, manage spreadsheets) via Rube MCP (Composio). Read/write data, manage tabs, apply formatting, and search rows programmatically.": "Automatize as operações do Planilhas Google (ler, escrever, formatar, filtrar, gerenciar planilhas) via Rube MCP (Composio). Leia/grave dados, gerencie guias, aplique formatação e pesquise linhas programaticamente.",
  "Master modern GraphQL with federation, performance optimization,": "Domine o GraphQL moderno com federação, otimização de desempenho,",
  "Design, organize, and manage Helm charts for templating and packaging Kubernetes applications with reusable configurations. Use when creating Helm charts, packaging Kubernetes applications, or impl...": "Projete, organize e gerencie gráficos Helm para criar modelos e empacotar aplicativos Kubernetes com configurações reutilizáveis. Use ao criar gráficos Helm, empacotar aplicativos Kubernetes ou implementar...",
  "GraphQL gives clients exactly the data they need - no more, no less. One endpoint, typed schema, introspection. But the flexibility that makes it powerful also makes it dangerous. Without proper co...": "GraphQL fornece aos clientes exatamente os dados de que precisam - nem mais, nem menos. Um endpoint, esquema digitado, introspecção. Mas a flexibilidade que o torna poderoso também o torna perigoso. Sem a devida colaboração...",
  "Automate GitHub workflows with AI assistance. Includes PR reviews, issue triage, CI/CD integration, and Git operations. Use when automating GitHub workflows, setting up PR review automation, creati...": "Automatize fluxos de trabalho do GitHub com assistência de IA. Inclui revisões de PR, triagem de problemas, integração de CI/CD e operações Git. Use ao automatizar fluxos de trabalho do GitHub, configurar automação de revisão de relações públicas, criar...",
  "Automate Google Analytics tasks via Rube MCP (Composio): run reports, list accounts/properties, funnels, pivots, key events. Always search tools first for current schemas.": "Automatize tarefas do Google Analytics via Rube MCP (Composio): execute relatórios, liste contas/propriedades, funis, pivôs, eventos principais. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Automate Gmail tasks via Rube MCP (Composio): send/reply, search, labels, drafts, attachments. Always search tools first for current schemas.": "Automatize tarefas do Gmail via Rube MCP (Composio): enviar/responder, pesquisar, marcadores, rascunhos, anexos. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Expert Haskell engineer specializing in advanced type systems, pure functional design, and high-reliability software. Use PROACTIVELY for type-level programming, concurrency, and architecture guidance.": "Engenheiro especialista em Haskell especializado em sistemas de tipo avançado, design funcional puro e software de alta confiabilidade. Use PROATIVAMENTE para programação em nível de tipo, simultaneidade e orientação de arquitetura.",
  "Professional, ethical HR partner for hiring,": "Parceiro de RH profissional e ético para contratação,",
  "Build hosted agents using Azure AI Projects SDK with ImageBasedHostedAgentDefinition. Use when creating container-based agents in Azure AI Foundry.": "Crie agentes hospedados usando o SDK de projetos de IA do Azure com ImageBasedHostedAgentDefinition. Utilize ao criar agentes baseados em contentores no Azure AI Foundry.",
  "Expert patterns for HubSpot CRM integration including OAuth authentication, CRM objects, associations, batch operations, webhooks, and custom objects. Covers Node.js and Python SDKs. Use when: hubs...": "Padrões especializados para integração do HubSpot CRM, incluindo autenticação OAuth, objetos CRM, associações, operações em lote, webhooks e objetos personalizados. Abrange SDKs Node.js e Python. Use quando: hubs...",
  "Automate HelpDesk tasks via Rube MCP (Composio): list tickets, manage views, use canned responses, and configure custom fields. Always search tools first for current schemas.": "Automatize tarefas de HelpDesk via Rube MCP (Composio): liste tickets, gerencie visualizações, use respostas prontas e configure campos personalizados. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Configure secure, high-performance connectivity between on-premises infrastructure and cloud platforms using VPN and dedicated connections. Use when building hybrid cloud architectures, connecting ...": "Configure conectividade segura e de alto desempenho entre infraestrutura local e plataformas em nuvem usando VPN e conexões dedicadas. Use ao construir arquiteturas de nuvem híbrida, conectando...",
  "This skill should be used when users want to run any workload on Hugging Face Jobs infrastructure. Covers UV scripts, Docker-based jobs, hardware selection, cost estimation, authentication with tok...": "Essa habilidade deve ser usada quando os usuários desejam executar qualquer carga de trabalho na infraestrutura do Hugging Face Jobs. Abrange scripts UV, trabalhos baseados em Docker, seleção de hardware, estimativa de custos, autenticação com token...",
  "Automate HubSpot CRM operations (contacts, companies, deals, tickets, properties) via Rube MCP using Composio integration.": "Automatize as operações do HubSpot CRM (contatos, empresas, negócios, tickets, propriedades) via Rube MCP usando a integração Composio.",
  "Execute Hugging Face Hub operations using the `hf` CLI. Use when the user needs to download models/datasets/spaces, upload files to Hub repositories, create repos, manage local cache, or run comput...": "Execute operações Hugging Face Hub usando a CLI `hf`. Use quando o usuário precisar baixar modelos/conjuntos de dados/espaços, fazer upload de arquivos para repositórios do Hub, criar repositórios, gerenciar cache local ou executar computação...",
  "Expert SRE incident responder specializing in rapid problem": "Respondente especialista em incidentes SRE especializado em problemas rápidos",
  "Internationalization and localization patterns. Detecting hardcoded strings, managing translations, locale files, RTL support.": "Padrões de internacionalização e localização. Detectando strings codificadas, gerenciando traduções, arquivos de localidade, suporte RTL.",
  "Expert hybrid cloud architect specializing in complex multi-cloud": "Arquiteto especialista em nuvem híbrida, especializado em multinuvem complexa",
  "Inngest expert for serverless-first background jobs, event-driven workflows, and durable execution without managing queues or workers. Use when: inngest, serverless background job, event-driven wor...": "Especialista do Inngest para trabalhos em segundo plano sem servidor, fluxos de trabalho orientados a eventos e execução durável sem gerenciar filas ou trabalhadores. Use quando: ingestão, trabalho em segundo plano sem servidor, trabalho orientado a eventos...",
  "[Extended thinking: This workflow implements a sophisticated debugging and resolution pipeline that leverages AI-assisted debugging tools and observability platforms to systematically diagnose and res": "[Pensamento estendido: este fluxo de trabalho implementa um pipeline sofisticado de depuração e resolução que aproveita ferramentas de depuração assistidas por IA e plataformas de observabilidade para diagnosticar e resolver sistematicamente",
  "This skill should be used when the user asks to \"test for HTML injection\", \"inject HTML into web pages\", \"perform HTML injection attacks\", \"deface web applications\", or \"test conten...": "Esta habilidade deve ser usada quando o usuário pede para \"testar injeção de HTML\", \"injetar HTML em páginas da web\", \"realizar ataques de injeção de HTML\", \"desfigurar aplicativos da web\" ou \"testar conteúdo...",
  "Create structured incident response runbooks with step-by-step procedures, escalation paths, and recovery actions. Use when building runbooks, responding to incidents, or establishing incident resp...": "Crie runbooks estruturados de resposta a incidentes com procedimentos passo a passo, caminhos de escalonamento e ações de recuperação. Use ao criar runbooks, responder a incidentes ou estabelecer respostas a incidentes...",
  "Multi-agent research skill for parallel research execution (10 agents, battle-tested with real case studies).": "Habilidade de pesquisa multiagente para execução de pesquisa paralela (10 agentes, testados em batalha com estudos de caso reais).",
  "Use when working with incident response incident response": "Use ao trabalhar com resposta a incidentes resposta a incidentes",
  "Combine vector and keyword search for improved retrieval. Use when implementing RAG systems, building search engines, or when neither approach alone provides sufficient recall.": "Combine pesquisa vetorial e por palavra-chave para melhor recuperação. Use ao implementar sistemas RAG, construir mecanismos de busca ou quando nenhuma das abordagens por si só fornece recall suficiente.",
  "Expert in building portfolios that actually land jobs and clients - not just showing work, but creating memorable experiences. Covers developer portfolios, designer portfolios, creative portfolios,...": "Especialista em construir portfólios que realmente geram empregos e clientes - não apenas mostrando trabalhos, mas criando experiências memoráveis. Abrange portfólios de desenvolvedores, portfólios de designers, portfólios criativos,...",
  "Automate Instagram tasks via Rube MCP (Composio): create posts, carousels, manage media, get insights, and publishing limits. Always search tools first for current schemas.": "Automatize tarefas do Instagram via Rube MCP (Composio): crie postagens, carrosséis, gerencie mídia, obtenha insights e limites de publicação. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "A set of resources to help me write all kinds of internal communications, using the formats that my company likes to use. Claude should use this skill whenever asked to write some sort of internal ...": "Um conjunto de recursos para me ajudar a escrever todo o tipo de comunicações internas, nos formatos que a minha empresa gosta de utilizar. Claude deveria usar essa habilidade sempre que solicitado a escrever algum tipo de informação interna...",
  "Automate Intercom tasks via Rube MCP (Composio): conversations, contacts, companies, segments, admins. Always search tools first for current schemas.": "Automatize tarefas de Intercom via Rube MCP (Composio): conversas, contatos, empresas, segmentos, administradores. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "This skill should be used when the user asks to \"test for insecure direct object references,\" \"find IDOR vulnerabilities,\" \"exploit broken access control,\" \"enumerate user IDs or obje...": "Esta habilidade deve ser usada quando o usuário pede para \"testar referências diretas a objetos inseguros\", \"encontrar vulnerabilidades IDOR\", \"explorar controle de acesso quebrado\", \"enumerar IDs de usuários ou objetos...",
  "Iterate on a PR until CI passes. Use when you need to fix CI failures, address review feedback, or continuously push fixes until all checks are green. Automates the feedback-fix-push-wait cycle.": "Itere em um PR até que o CI seja aprovado. Use quando precisar corrigir falhas de IC, abordar comentários de revisão ou enviar correções continuamente até que todas as verificações estejam verdes. Automatiza o ciclo de feedback-correção-push-espera.",
  "Develop native iOS applications with Swift/SwiftUI. Masters iOS 18,": "Desenvolva aplicativos iOS nativos com Swift/SwiftUI. Mestre iOS 18,",
  "Configure Istio traffic management including routing, load balancing, circuit breakers, and canary deployments. Use when implementing service mesh traffic policies, progressive delivery, or resilie...": "Configure o gerenciamento de tráfego do Istio, incluindo roteamento, balanceamento de carga, disjuntores e implantações canário. Use ao implementar políticas de tráfego de malha de serviço, entrega progressiva ou resiliência...",
  "You are a TypeScript project architecture expert specializing in scaffolding production-ready Node.js and frontend applications. Generate complete project structures with modern tooling (pnpm, Vite, N": "Você é um especialista em arquitetura de projetos TypeScript, especializado em scaffolding de Node.js prontos para produção e aplicativos front-end. Gere estruturas completas de projetos com ferramentas modernas (pnpm, Vite, N",
  "Comprehensive JavaScript reference covering 33+ essential concepts every developer should know. From fundamentals like primitives and closures to advanced patterns like async/await and functional p...": "Referência abrangente de JavaScript cobrindo mais de 33 conceitos essenciais que todo desenvolvedor deve saber. Desde fundamentos como primitivos e encerramentos até padrões avançados como async/await e p...",
  "Automate Jira tasks via Rube MCP (Composio): issues, projects, sprints, boards, comments, users. Always search tools first for current schemas.": "Automatize tarefas do Jira via Rube MCP (Composio): problemas, projetos, sprints, quadros, comentários, usuários. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Implement Kubernetes security policies including NetworkPolicy, PodSecurityPolicy, and RBAC for production-grade security. Use when securing Kubernetes clusters, implementing network isolation, or ...": "Implemente políticas de segurança do Kubernetes, incluindo NetworkPolicy, PodSecurityPolicy e RBAC, para segurança de nível de produção. Use ao proteger clusters Kubernetes, implementar isolamento de rede ou ...",
  "Expert patterns for Kotlin Coroutines and Flow, covering structured concurrency, error handling, and testing.": "Padrões especializados para corrotinas e fluxo Kotlin, abrangendo simultaneidade estruturada, tratamento de erros e testes.",
  "Implement comprehensive testing strategies using Jest, Vitest, and Testing Library for unit tests, integration tests, and end-to-end testing with mocking, fixtures, and test-driven development. Use...": "Implemente estratégias de teste abrangentes usando Jest, Vitest e Testing Library para testes de unidade, testes de integração e testes ponta a ponta com simulação, acessórios e desenvolvimento orientado a testes. Usar...",
  "Master modern JavaScript with ES6+, async patterns, and Node.js": "Domine JavaScript moderno com ES6+, padrões assíncronos e Node.js",
  "Create production-ready Kubernetes manifests for Deployments, Services, ConfigMaps, and Secrets following best practices and security standards. Use when generating Kubernetes YAML manifests, creat...": "Crie manifestos do Kubernetes prontos para produção para implantações, serviços, ConfigMaps e segredos seguindo as práticas recomendadas e os padrões de segurança. Use ao gerar manifestos YAML do Kubernetes, crie...",
  "Design effective KPI dashboards with metrics selection, visualization best practices, and real-time monitoring patterns. Use when building business dashboards, selecting metrics, or designing data ...": "Projete painéis de KPI eficazes com seleção de métricas, melhores práticas de visualização e padrões de monitoramento em tempo real. Use ao criar painéis de negócios, selecionar métricas ou projetar dados...",
  "Guide for continuous improvement, error proofing, and standardization. Use this skill when the user wants to improve code quality, refactor, or discuss process improvements.": "Guia para melhoria contínua, prova de erros e padronização. Use esta habilidade quando o usuário quiser melhorar a qualidade do código, refatorar ou discutir melhorias no processo.",
  "Expert Kubernetes architect specializing in cloud-native": "Arquiteto especialista em Kubernetes especializado em nuvem nativa",
  "Master Julia 1.10+ with modern features, performance optimization,": "Master Julia 1.10+ com recursos modernos, otimização de desempenho,",
  "Automate Klaviyo tasks via Rube MCP (Composio): manage email/SMS campaigns, inspect campaign messages, track tags, and monitor send jobs. Always search tools first for current schemas.": "Automatize tarefas Klaviyo via Rube MCP (Composio): gerencie campanhas de e-mail/SMS, inspecione mensagens de campanha, rastreie tags e monitore trabalhos de envio. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Master Java 21+ with modern features like virtual threads, pattern": "Domine Java 21+ com recursos modernos como threads virtuais, padrão",
  "Expert in Langfuse - the open-source LLM observability platform. Covers tracing, prompt management, evaluation, datasets, and integration with LangChain, LlamaIndex, and OpenAI. Essential for debug...": "Especialista em Langfuse - a plataforma de observabilidade LLM de código aberto. Abrange rastreamento, gerenciamento imediato, avaliação, conjuntos de dados e integração com LangChain, LlamaIndex e OpenAI. Essencial para depuração...",
  "Kubernetes deployment workflow for container orchestration, Helm charts, service mesh, and production-ready K8s configurations.": "Fluxo de trabalho de implantação do Kubernetes para orquestração de contêineres, gráficos Helm, malha de serviço e configurações K8s prontas para produção.",
  "Design LLM applications using the LangChain framework with agents, memory, and tool integration patterns. Use when building LangChain applications, implementing AI agents, or creating complex LLM w...": "Projete aplicativos LLM usando a estrutura LangChain com agentes, memória e padrões de integração de ferramentas. Use ao construir aplicativos LangChain, implementar agentes de IA ou criar LLM complexos com...",
  "Expert in LangGraph - the production-grade framework for building stateful, multi-actor AI applications. Covers graph construction, state management, cycles and branches, persistence with checkpoin...": "Especialista em LangGraph – a estrutura de nível de produção para a construção de aplicativos de IA multiatores e com estado. Abrange construção de gráficos, gerenciamento de estado, ciclos e ramificações, persistência com checkpoint...",
  "Refactor legacy codebases, migrate outdated frameworks, and": "Refatore bases de código legadas, migre estruturas desatualizadas e",
  "Security auditor for Laravel applications. Analyzes code for vulnerabilities, misconfigurations, and insecure practices using OWASP standards and Laravel security best practices.": "Auditor de segurança para aplicações Laravel. Analisa código em busca de vulnerabilidades, configurações incorretas e práticas inseguras usando padrões OWASP e práticas recomendadas de segurança do Laravel.",
  "Research a topic from the last 30 days on Reddit + X + Web, become an expert, and write copy-paste-ready prompts for the user's target tool.": "Pesquise um tópico dos últimos 30 dias no Reddit + X + Web, torne-se um especialista e escreva prompts prontos para copiar e colar para a ferramenta de destino do usuário.",
  "Senior Laravel Engineer role for production-grade, maintainable, and idiomatic Laravel solutions. Focuses on clean architecture, security, performance, and modern standards (Laravel 10/11+).": "Função de engenheiro sênior do Laravel para soluções Laravel de nível de produção, sustentáveis ​​e idiomáticas. Concentra-se em arquitetura limpa, segurança, desempenho e padrões modernos (Laravel 10/11+).",
  "Draft privacy policies, terms of service, disclaimers, and legal": "Esboçar políticas de privacidade, termos de serviço, isenções de responsabilidade e informações legais",
  "When the user wants to plan a product launch, feature announcement, or release strategy. Also use when the user mentions 'launch,' 'Product Hunt,' 'feature release,' 'announcement,' 'go-to-market,'...": "Quando o usuário deseja planejar o lançamento de um produto, anúncio de recurso ou estratégia de lançamento. Use também quando o usuário mencionar 'lançamento', 'caça ao produto', 'lançamento de recurso', 'anúncio', 'entrada no mercado'...",
  "Vector graphics and diagram creation, format conversion (ODG/SVG/PDF) with LibreOffice Draw.": "Criação de gráficos vetoriais e diagramas, conversão de formatos (ODG/SVG/PDF) com LibreOffice Draw.",
  "Database management, forms, reports, and data operations with LibreOffice Base.": "Gerenciamento de banco de dados, formulários, relatórios e operações de dados com o LibreOffice Base.",
  "Document creation, format conversion (ODT/DOCX/PDF), mail merge, and automation with LibreOffice Writer.": "Criação de documentos, conversão de formatos (ODT/DOCX/PDF), mala direta e automação com o LibreOffice Writer.",
  "Manage Linear issues, projects, and teams": "Gerenciar problemas, projetos e equipes lineares",
  "Production-ready patterns for building LLM applications. Covers RAG pipelines, agent architectures, prompt IDEs, and LLMOps monitoring. Use when designing AI applications, implementing RAG, buildin...": "Padrões prontos para produção para a construção de aplicativos LLM. Abrange pipelines RAG, arquiteturas de agentes, IDEs de prompt e monitoramento de LLMOps. Use ao projetar aplicativos de IA, implementar RAG, construir...",
  "Implement Linkerd service mesh patterns for lightweight, security-focused service mesh deployments. Use when setting up Linkerd, configuring traffic policies, or implementing zero-trust networking ...": "Implemente padrões de malha de serviço Linkerd para implantações de malha de serviço leves e focadas em segurança. Use ao configurar o Linkerd, configurar políticas de tráfego ou implementar redes de confiança zero...",
  "Spreadsheet creation, format conversion (ODS/XLSX/CSV), formulas, data automation with LibreOffice Calc.": "Criação de planilhas, conversão de formatos (ODS/XLSX/CSV), fórmulas, automação de dados com LibreOffice Calc.",
  "You are an expert prompt engineer specializing in crafting effective prompts for LLMs through advanced techniques including constitutional AI, chain-of-thought reasoning, and model-specific optimizati": "Você é um engenheiro especialista em prompts, especializado na elaboração de prompts eficazes para LLMs por meio de técnicas avançadas, incluindo IA constitucional, raciocínio em cadeia de pensamento e otimizações específicas de modelo.",
  "Presentation creation, format conversion (ODP/PPTX/PDF), slide automation with LibreOffice Impress.": "Criação de apresentações, conversão de formatos (ODP/PPTX/PDF), automação de slides com LibreOffice Impress.",
  "Automate Linear tasks via Rube MCP (Composio): issues, projects, cycles, teams, labels. Always search tools first for current schemas.": "Automatize tarefas lineares via Rube MCP (Composio): problemas, projetos, ciclos, equipes, rótulos. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Design and implement a complete ML pipeline for: $ARGUMENTS": "Projete e implemente um pipeline de ML completo para: $ARGUMENTS",
  "Implement comprehensive evaluation strategies for LLM applications using automated metrics, human feedback, and benchmarking. Use when testing LLM performance, measuring AI application quality, or ...": "Implemente estratégias de avaliação abrangentes para aplicações LLM usando métricas automatizadas, feedback humano e benchmarking. Use ao testar o desempenho do LLM, medir a qualidade do aplicativo de IA ou ...",
  "Automatic quality control, linting, and static analysis procedures. Use after every code modification to ensure syntax correctness and project standards. Triggers onKeywords: lint, format, check, v...": "Procedimentos automáticos de controle de qualidade, fiapos e análise estática. Use após cada modificação de código para garantir a correção da sintaxe e os padrões do projeto. Aciona onKeywords: lint, format, check, v...",
  "Automate LinkedIn tasks via Rube MCP (Composio): create posts, manage profile, company info, comments, and image uploads. Always search tools first for current schemas.": "Automatize tarefas do LinkedIn via Rube MCP (Composio): crie postagens, gerencie perfil, informações da empresa, comentários e uploads de imagens. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "You are an AI assistant development expert specializing in creating intelligent conversational interfaces, chatbots, and AI-powered applications. Design comprehensive AI assistant solutions with natur": "Você é um especialista em desenvolvimento de assistente de IA, especializado na criação de interfaces de conversação inteligentes, chatbots e aplicativos baseados em IA. Projete soluções abrangentes de assistente de IA com a natureza",
  "Linux system troubleshooting workflow for diagnosing and resolving system issues, performance problems, and service failures.": "Fluxo de trabalho de solução de problemas do sistema Linux para diagnosticar e resolver problemas de sistema, problemas de desempenho e falhas de serviço.",
  "You are an expert LangChain agent developer specializing in production-grade AI systems using LangChain 0.1+ and LangGraph.": "Você é um desenvolvedor especialista de agentes LangChain especializado em sistemas de IA de nível de produção usando LangChain 0.1+ e LangGraph.",
  "This skill should be used when the user asks to \"create bash scripts\", \"automate Linux tasks\", \"monitor system resources\", \"backup files\", \"manage users\", or \"write production she...": "Esta habilidade deve ser usada quando o usuário pede para \"criar scripts bash\", \"automatizar tarefas do Linux\", \"monitorar recursos do sistema\", \"fazer backup de arquivos\", \"gerenciar usuários\" ou \"escrever produção ela...",
  "This skill should be used when the user asks to \"escalate privileges on Linux\", \"find privesc vectors on Linux systems\", \"exploit sudo misconfigurations\", \"abuse SUID binaries\", \"ex...": "Esta habilidade deve ser usada quando o usuário pede para \"escalar privilégios no Linux\", \"encontrar vetores privesc em sistemas Linux\", \"explorar configurações incorretas do sudo\", \"abusar de binários SUID\", \"ex...",
  "Makepad UI development skills for Rust apps: setup, patterns, shaders, packaging, and troubleshooting.": "Habilidades de desenvolvimento de UI Makepad para aplicativos Rust: configuração, padrões, shaders, empacotamento e solução de problemas.",
  "Expert malware analyst specializing in defensive malware research,": "Analista especialista em malware especializado em pesquisa defensiva de malware,",
  "Multi-agent autonomous startup system for Claude Code. Triggers on \"Loki Mode\". Orchestrates 100+ specialized agents across engineering, QA, DevOps, security, data/ML, business operations,...": "Sistema de inicialização autônoma multiagente para Claude Code. Aciona o \"Modo Loki\". Orquestra mais de 100 agentes especializados em engenharia, controle de qualidade, DevOps, segurança, dados/ML, operações de negócios,...",
  "Automate Make (Integromat) tasks via Rube MCP (Composio): operations, enums, language and timezone lookups. Always search tools first for current schemas.": "Automatize tarefas Make (Integromat) via Rube MCP (Composio): operações, enumerações, pesquisas de idioma e fuso horário. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Automate Mailchimp email marketing including campaigns, audiences, subscribers, segments, and analytics via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize o marketing por e-mail do Mailchimp, incluindo campanhas, públicos, assinantes, segmentos e análises por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Install and configure the Manifest observability plugin for your agents. Use when setting up telemetry, configuring API keys, or troubleshooting the plugin.": "Instale e configure o plug-in de observabilidade do Manifesto para seus agentes. Use ao configurar a telemetria, configurar chaves de API ou solucionar problemas do plug-in.",
  "Apply behavioral science and mental models to marketing decisions, prioritized using a psychological leverage and feasibility scoring system.": "Aplique ciência comportamental e modelos mentais às decisões de marketing, priorizados usando uma alavancagem psicológica e um sistema de pontuação de viabilidade.",
  "Master memory forensics techniques including memory acquisition, process analysis, and artifact extraction using Volatility and related tools. Use when analyzing memory dumps, investigating inciden...": "Domine técnicas forenses de memória, incluindo aquisição de memória, análise de processos e extração de artefatos usando Volatilidade e ferramentas relacionadas. Use ao analisar despejos de memória, investigando incidentes...",
  "Provide proven marketing strategies and growth ideas for SaaS and software products, prioritized using a marketing feasibility scoring system.": "Fornece estratégias de marketing comprovadas e ideias de crescimento para produtos SaaS e de software, priorizados usando um sistema de pontuação de viabilidade de marketing.",
  "Create Mermaid diagrams for flowcharts, sequences, ERDs, and": "Crie diagramas Mermaid para fluxogramas, sequências, ERDs e",
  "Master Minecraft server plugin development with Bukkit, Spigot, and": "Domine o desenvolvimento de plugins de servidor Minecraft com Bukkit, Spigot e",
  "Implement memory-safe programming with RAII, ownership, smart pointers, and resource management across Rust, C++, and C. Use when writing safe systems code, managing resources, or preventing memory...": "Implemente programação segura de memória com RAII, propriedade, ponteiros inteligentes e gerenciamento de recursos em Rust, C++ e C. Use ao escrever código de sistemas seguros, gerenciar recursos ou impedir memória...",
  "This skill should be used when the user asks to \"use Metasploit for penetration testing\", \"exploit vulnerabilities with msfconsole\", \"create payloads with msfvenom\", \"perform post-exp...": "Esta habilidade deve ser usada quando o usuário pede para \"usar Metasploit para testes de penetração\", \"explorar vulnerabilidades com msfconsole\", \"criar cargas úteis com msfvenom\", \"realizar pós-exploração...",
  "Design microservices architectures with service boundaries, event-driven communication, and resilience patterns. Use when building distributed systems, decomposing monoliths, or implementing micros...": "Projete arquiteturas de microsserviços com limites de serviço, comunicação orientada a eventos e padrões de resiliência. Use ao construir sistemas distribuídos, decompor monólitos ou implementar micros...",
  "This skill should be used when the user asks to \\\"calculate TAM\\\",": "Esta habilidade deve ser utilizada quando o usuário pede para \\\"calcular TAM\\\",",
  "Design short-term, long-term, and graph-based memory architectures": "Projete arquiteturas de memória de curto e longo prazo baseadas em gráficos",
  "Build production ML systems with PyTorch 2.x, TensorFlow, and": "Crie sistemas de ML de produção com PyTorch 2.x, TensorFlow e",
  "Expert in launching small, focused SaaS products fast - the indie hacker approach to building profitable software. Covers idea validation, MVP development, pricing, launch strategies, and growing t...": "Especialista no lançamento rápido de produtos SaaS pequenos e focados - a abordagem do hacker independente para construir software lucrativo. Abrange validação de ideias, desenvolvimento de MVP, preços, estratégias de lançamento e crescimento...",
  "Build end-to-end MLOps pipelines from data preparation through model training, validation, and production deployment. Use when creating ML pipelines, implementing MLOps practices, or automating mod...": "Crie pipelines MLOps completos, desde a preparação de dados até o treinamento de modelo, validação e implantação de produção. Use ao criar pipelines de ML, implementar práticas de MLOps ou automatizar mod...",
  "Guide for creating high-quality MCP (Model Context Protocol) servers that enable LLMs to interact with external services through well-designed tools. Use when building MCP servers to integrate exte...": "Guia para a criação de servidores MCP (Model Context Protocol) de alta qualidade que permitem que LLMs interajam com serviços externos por meio de ferramentas bem projetadas. Use ao construir servidores MCP para integrar exte...",
  "Automate Mixpanel tasks via Rube MCP (Composio): events, segmentation, funnels, cohorts, user profiles, JQL queries. Always search tools first for current schemas.": "Automatize tarefas do Mixpanel via Rube MCP (Composio): eventos, segmentação, funis, coortes, perfis de usuário, consultas JQL. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Develop React Native, Flutter, or native mobile apps with modern": "Desenvolva aplicativos móveis React Native, Flutter ou nativos com recursos modernos",
  "Build comprehensive ML pipelines, experiment tracking, and model": "Crie pipelines de ML abrangentes, rastreamento de experimentos e modelos",
  "Expert in secure mobile coding practices specializing in input": "Especialista em práticas seguras de codificação móvel, especializado em entrada",
  "Mobile-first design and engineering doctrine for iOS and Android apps. Covers touch interaction, performance, platform conventions, offline behavior, and mobile-specific decision-making. Teaches pr...": "Doutrina de engenharia e design mobile-first para aplicativos iOS e Android. Abrange interação por toque, desempenho, convenções de plataforma, comportamento off-line e tomada de decisões específicas para dispositivos móveis. Ensina pr...",
  "Automate Miro tasks via Rube MCP (Composio): boards, items, sticky notes, frames, sharing, connectors. Always search tools first for current schemas.": "Automatize tarefas do Miro via Rube MCP (Composio): quadros, itens, post-its, molduras, compartilhamento, conectores. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Automate Microsoft Teams tasks via Rube MCP (Composio): send messages, manage channels, create meetings, handle chats, and search messages. Always search tools first for current schemas.": "Automatize tarefas do Microsoft Teams via Rube MCP (Composio): envie mensagens, gerencie canais, crie reuniões, administre chats e pesquise mensagens. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Master monorepo management with Turborepo, Nx, and pnpm workspaces to build efficient, scalable multi-package repositories with optimized builds and dependency management. Use when setting up monor...": "Domine o gerenciamento de monorepo com espaços de trabalho Turborepo, Nx e pnpm para criar repositórios de vários pacotes eficientes e escaláveis ​​com compilações otimizadas e gerenciamento de dependências. Use ao configurar monor...",
  "Design multi-cloud architectures using a decision framework to select and integrate services across AWS, Azure, and GCP. Use when building multi-cloud systems, avoiding vendor lock-in, or leveragin...": "Projete arquiteturas multinuvem usando uma estrutura de decisão para selecionar e integrar serviços em AWS, Azure e GCP. Use ao construir sistemas multinuvem, evitando a dependência de fornecedores ou aproveitando...",
  "Write Python code in n8n Code nodes. Use when writing Python in n8n, using _input/_json/_node syntax, working with standard library, or need to understand Python limitations in n8n Code nodes.": "Escreva o código Python em nós de código n8n. Use ao escrever Python em n8n, usando a sintaxe _input/_json/_node, trabalhando com biblioteca padrão ou precisa entender as limitações do Python em nós de código n8n.",
  "Expert in monorepo architecture, build systems, and dependency management at scale. Masters Nx, Turborepo, Bazel, and Lerna for efficient multi-project development. Use PROACTIVELY for monorepo setup,": "Especialista em arquitetura monorepo, sistemas de construção e gerenciamento de dependências em escala. Masters Nx, Turborepo, Bazel e Lerna para desenvolvimento eficiente de vários projetos. Use PROATIVAMENTE para configuração de monorepo,",
  "Create custom external web service APIs for Moodle LMS. Use when implementing web services for course management, user tracking, quiz operations, or custom plugin functionality. Covers parameter va...": "Crie APIs de serviços da web externos personalizados para Moodle LMS. Use ao implementar serviços da web para gerenciamento de cursos, rastreamento de usuários, operações de questionário ou funcionalidade de plug-in personalizada. Abrange o parâmetro va...",
  "Automate Monday.com work management including boards, items, columns, groups, subitems, and updates via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize o gerenciamento de trabalho do Monday.com, incluindo quadros, itens, colunas, grupos, subitens e atualizações via Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Build and deploy the same feature consistently across web, mobile, and desktop platforms using API-first architecture and parallel implementation strategies.": "Crie e implante o mesmo recurso de forma consistente em plataformas web, móveis e desktop usando arquitetura API-first e estratégias de implementação paralelas.",
  "Master ES6+ features including async/await, destructuring, spread operators, arrow functions, promises, modules, iterators, generators, and functional programming patterns for writing clean, effici...": "Domine os recursos do ES6+, incluindo assíncrono/espera, desestruturação, operadores de propagação, funções de seta, promessas, módulos, iteradores, geradores e padrões de programação funcionais para escrever de forma limpa e eficiente.",
  "AI-powered PPT generation with document analysis and styled images": "Geração de PPT com tecnologia de IA com análise de documentos e imagens estilizadas",
  "Master orchestrator, peer-to-peer, and hierarchical multi-agent architectures": "Arquiteturas mestre de orquestrador, peer-to-peer e multiagentes hierárquicas",
  "Use this skill when a design or idea requires higher confidence, risk reduction, or formal review. This skill orchestrates a structured, sequential multi-agent design review where each agent has a strict, non-overlapping role. It prevents blind spots, false confidence, and premature convergence.": "Use essa habilidade quando um projeto ou ideia exigir maior confiança, redução de riscos ou revisão formal. Essa habilidade orquestra uma revisão de projeto multiagente estruturada e sequencial, onde cada agente tem uma função estrita e não sobreposta. Evita pontos cegos, falsa confiança e convergência prematura.",
  "Expert patterns for Neon serverless Postgres, branching, connection pooling, and Prisma/Drizzle integration Use when: neon database, serverless postgres, database branching, neon postgres, postgres...": "Padrões especialistas para Postgres sem servidor Neon, ramificação, pool de conexões e integração Prisma/Drizzle Use quando: banco de dados neon, postgres sem servidor, ramificação de banco de dados, postgres neon, postgres...",
  "Operation-aware node configuration guidance. Use when configuring nodes, understanding property dependencies, determining required fields, choosing between get_node detail levels, or learning commo...": "Orientação de configuração de nó com reconhecimento de operação. Use ao configurar nós, compreender dependências de propriedades, determinar campos obrigatórios, escolher entre níveis de detalhe get_node ou aprender co...",
  "Senior Elite Software Engineer (15+) and Senior Product Designer. Full workflow with planning, architecture, TDD, clean code, and pixel-perfect UX validation.": "Engenheiro de software Elite Sênior (15+) e Designer de Produto Sênior. Fluxo de trabalho completo com planejamento, arquitetura, TDD, código limpo e validação UX perfeita.",
  "Modo Elite Coder + UX Pixel-Perfect otimizado especificamente para Gemini 3.1 Pro High. Workflow completo com foco em qualidade máxima e eficiência de tokens.": "Modo Elite Coder + UX Pixel-Perfect otimizado especificamente para Gemini 3.1 Pro High. Workflow completo com foco em qualidade máxima e eficiência de tokens.",
  "Nest.js framework expert specializing in module architecture, dependency injection, middleware, guards, interceptors, testing with Jest/Supertest, TypeORM/Mongoose integration, and Passport.js auth...": "Especialista em framework Nest.js especializado em arquitetura de módulo, injeção de dependência, middleware, guardas, interceptores, testes com Jest/Supertest, integração TypeORM/Mongoose e autenticação Passport.js...",
  "Expert guide for using n8n-mcp MCP tools effectively. Use when searching for nodes, validating configurations, accessing templates, managing workflows, or using any n8n-mcp tool. Provides tool sele...": "Guia especializado para usar ferramentas MCP n8n-mcp de maneira eficaz. Use ao pesquisar nós, validar configurações, acessar modelos, gerenciar fluxos de trabalho ou usar qualquer ferramenta n8n-mcp. Fornece seleção de ferramentas...",
  "Master Next.js 14+ App Router with Server Components, streaming, parallel routes, and advanced data fetching. Use when building Next.js applications, implementing SSR/SSG, or optimizing React Serve...": "Domine o roteador de aplicativos Next.js 14+ com componentes de servidor, streaming, rotas paralelas e busca avançada de dados. Use ao construir aplicativos Next.js, implementar SSR/SSG ou otimizar React Serve...",
  "Configure mutual TLS (mTLS) for zero-trust service-to-service communication. Use when implementing zero-trust networking, certificate management, or securing internal service communication.": "Configure o TLS mútuo (mTLS) para comunicação entre serviços de confiança zero. Use ao implementar redes de confiança zero, gerenciamento de certificados ou proteger a comunicação de serviço interno.",
  "This skill should be used when the user asks to \"set up a web server\", \"configure HTTP or HTTPS\", \"perform SNMP enumeration\", \"configure SMB shares\", \"test network services\", or ne...": "Esta habilidade deve ser usada quando o usuário solicitar \"configurar um servidor web\", \"configurar HTTP ou HTTPS\", \"realizar enumeração SNMP\", \"configurar compartilhamentos SMB\", \"testar serviços de rede\" ou ne...",
  "Expert network engineer specializing in modern cloud networking,": "Engenheiro de rede especialista especializado em redes modernas em nuvem,",
  "Expert integration of Supabase Auth with Next.js App Router Use when: supabase auth next, authentication next.js, login supabase, auth middleware, protected route.": "Integração especializada de Supabase Auth com Next.js App Router Use quando: supabase auth next, autenticação next.js, login supabase, auth middleware, rota protegida.",
  "Build production-ready Node.js backend services with Express/Fastify, implementing middleware patterns, error handling, authentication, database integration, and API design best practices. Use when...": "Crie serviços de back-end Node.js prontos para produção com Express/Fastify, implementando padrões de middleware, tratamento de erros, autenticação, integração de banco de dados e práticas recomendadas de design de API. Use quando...",
  "Implement NFT standards (ERC-721, ERC-1155) with proper metadata handling, minting strategies, and marketplace integration. Use when creating NFT contracts, building NFT marketplaces, or implementi...": "Implemente padrões NFT (ERC-721, ERC-1155) com tratamento adequado de metadados, estratégias de cunhagem e integração de mercado. Use ao criar contratos NFT, construir mercados NFT ou implementar...",
  "Expert guidance for distributed NoSQL databases (Cassandra, DynamoDB). Focuses on mental models, query-first modeling, single-table design, and avoiding hot partitions in high-scale systems.": "Orientação especializada para bancos de dados NoSQL distribuídos (Cassandra, DynamoDB). Concentra-se em modelos mentais, modelagem de consulta inicial, design de tabela única e prevenção de partições ativas em sistemas de alta escala.",
  "Build production-ready monitoring, logging, and tracing systems.": "Crie sistemas de monitoramento, registro e rastreamento prontos para produção.",
  "Use this skill to query your Google NotebookLM notebooks directly from Claude Code for source-grounded, citation-backed answers from Gemini. Browser automation, library management, persistent auth....": "Use esta habilidade para consultar seus blocos de anotações do Google NotebookLM diretamente do Claude Code para obter respostas do Gemini baseadas em fontes e citações. Automação do navegador, gerenciamento de biblioteca, autenticação persistente....",
  "Next.js App Router principles. Server Components, data fetching, routing patterns.": "Princípios do roteador de aplicativos Next.js. Componentes de servidor, busca de dados, padrões de roteamento.",
  "Node.js development principles and decision-making. Framework selection, async patterns, security, and architecture. Teaches thinking, not copying.": "Princípios de desenvolvimento e tomada de decisões do Node.js. Seleção de estrutura, padrões assíncronos, segurança e arquitetura. Ensina a pensar, não a copiar.",
  "Automate Notion tasks via Rube MCP (Composio): pages, databases, blocks, comments, users. Always search tools first for current schemas.": "Automatize tarefas do Notion via Rube MCP (Composio): páginas, bancos de dados, blocos, comentários, usuários. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "You are an SLO (Service Level Objective) expert specializing in implementing reliability standards and error budget-based practices. Design SLO frameworks, define SLIs, and build monitoring that ba...": "Você é um especialista em SLO (Objetivo de Nível de Serviço) especializado na implementação de padrões de confiabilidade e práticas baseadas em erros de orçamento. Projete estruturas de SLO, defina SLIs e crie monitoramento que base...",
  "Generate and maintain OpenAPI 3.1 specifications from code, design-first specs, and validation patterns. Use when creating API documentation, generating SDKs, or ensuring API contract compliance.": "Gere e mantenha especificações OpenAPI 3.1 a partir de código, especificações de design inicial e padrões de validação. Use ao criar documentação de API, gerar SDKs ou garantir a conformidade do contrato de API.",
  "Office productivity workflow covering document creation, spreadsheet automation, presentation generation, and integration with LibreOffice and Microsoft Office formats.": "Fluxo de trabalho de produtividade do Office que abrange criação de documentos, automação de planilhas, geração de apresentações e integração com formatos LibreOffice e Microsoft Office.",
  "Master on-call shift handoffs with context transfer, escalation procedures, and documentation. Use when transitioning on-call responsibilities, documenting shift summaries, or improving on-call pro...": "Domine a transferência de turnos de plantão com transferência de contexto, procedimentos de escalonamento e documentação. Use ao fazer a transição de responsabilidades de plantão, documentar resumos de turnos ou melhorar os pro...",
  "Guide for creating templates for the Obsidian Web Clipper. Use when you want to create a new clipping template, understand available variables, or format clipped content.": "Guia para criação de templates para o Obsidian Web Clipper. Use quando quiser criar um novo modelo de recorte, entender as variáveis ​​disponíveis ou formatar o conteúdo recortado.",
  "Operating system and shell scripting troubleshooting workflow for Linux, macOS, and Windows. Covers bash scripting, system administration, debugging, and automation.": "Fluxo de trabalho de solução de problemas de sistema operacional e script de shell para Linux, macOS e Windows. Abrange scripts bash, administração de sistema, depuração e automação.",
  "You are a monitoring and observability expert specializing in implementing comprehensive monitoring solutions. Set up metrics collection, distributed tracing, log aggregation, and create insightful da": "Você é um especialista em monitoramento e observabilidade especializado na implementação de soluções abrangentes de monitoramento. Configure a coleta de métricas, o rastreamento distribuído, a agregação de logs e crie dados perspicazes",
  "Automatically hunt for high-impact OSS contribution opportunities in trending repositories.": "Procure automaticamente oportunidades de contribuição de OSS de alto impacto em repositórios de tendências.",
  "Automate OneDrive file management, search, uploads, downloads, sharing, permissions, and folder operations via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize o gerenciamento de arquivos, pesquisa, uploads, downloads, compartilhamento, permissões e operações de pasta do OneDrive por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Expert in building and selling Notion templates as a business - not just making templates, but building a sustainable digital product business. Covers template design, pricing, marketplaces, market...": "Especialista na construção e venda de modelos Notion como um negócio - não apenas na criação de modelos, mas na construção de um negócio de produtos digitais sustentáveis. Abrange design de modelos, preços, mercados, mercado...",
  "Observe and troubleshoot WhatsApp in Kapso: debug message delivery, inspect webhook deliveries/retries, triage API errors, and run health checks. Use when investigating production issues, message f...": "Observe e solucione problemas do WhatsApp no ​​Kapso: depure a entrega de mensagens, inspecione entregas/novas tentativas de webhook, faça triagem de erros de API e execute verificações de integridade. Use ao investigar problemas de produção, mensagem f...",
  "Configure and optimize Nx monorepo workspaces. Use when setting up Nx, configuring project boundaries, optimizing build caching, or implementing affected commands.": "Configure e otimize espaços de trabalho Nx monorepo. Use ao configurar o Nx, configurar limites do projeto, otimizar o cache de build ou implementar comandos afetados.",
  "When the user wants to optimize post-signup onboarding, user activation, first-run experience, or time-to-value. Also use when the user mentions \"onboarding flow,\" \"activation rate,\" \"u...": "Quando o usuário deseja otimizar a integração pós-inscrição, a ativação do usuário, a experiência inicial ou o tempo de obtenção de valor. Use também quando o usuário mencionar \"fluxo de integração\", \"taxa de ativação\", \"u...",
  "Automate Outlook tasks via Rube MCP (Composio): emails, calendar, contacts, folders, attachments. Always search tools first for current schemas.": "Automatize tarefas do Outlook via Rube MCP (Composio): e-mails, calendário, contatos, pastas, anexos. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Integrate PayPal payment processing with support for express checkout, subscriptions, and refund management. Use when implementing PayPal payments, processing online transactions, or building e-com...": "Integre o processamento de pagamentos do PayPal com suporte para check-out expresso, assinaturas e gerenciamento de reembolsos. Use ao implementar pagamentos via PayPal, processar transações on-line ou criar e-com...",
  "Multi-agent orchestration patterns. Use when multiple independent tasks can run with different domain expertise or when comprehensive analysis requires multiple perspectives.": "Padrões de orquestração multiagentes. Use quando diversas tarefas independentes puderem ser executadas com conhecimentos de domínio diferentes ou quando uma análise abrangente exigir diversas perspectivas.",
  "Automate PagerDuty tasks via Rube MCP (Composio): manage incidents, services, schedules, escalation policies, and on-call rotations. Always search tools first for current schemas.": "Automatize tarefas do PagerDuty por meio do Rube MCP (Composio): gerencie incidentes, serviços, programações, políticas de escalonamento e rotações de plantão. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Automate Outlook Calendar tasks via Rube MCP (Composio): create events, manage attendees, find meeting times, and handle invitations. Always search tools first for current schemas.": "Automatize tarefas do calendário do Outlook via Rube MCP (Composio): crie eventos, gerencie participantes, encontre horários de reuniões e administre convites. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "When the user wants help with paid advertising campaigns on Google Ads, Meta (Facebook/Instagram), LinkedIn, Twitter/X, or other ad platforms. Also use when the user mentions 'PPC,' 'paid media,' '...": "Quando o usuário deseja ajuda com campanhas publicitárias pagas no Google Ads, Meta (Facebook/Instagram), LinkedIn, Twitter/X ou outras plataformas de anúncios. Use também quando o usuário mencionar 'PPC', 'mídia paga', '...",
  "Integrate Stripe, PayPal, and payment processors. Handles checkout": "Integre Stripe, PayPal e processadores de pagamento. Lida com check-out",
  "Use when working with performance testing review multi agent review": "Use ao trabalhar com revisão de testes de desempenho, revisão multiagente",
  "Implement PCI DSS compliance requirements for secure handling of payment card data and payment systems. Use when securing payment processing, achieving PCI compliance, or implementing payment card ...": "Implemente os requisitos de conformidade do PCI DSS para o manuseio seguro de dados de cartões de pagamento e sistemas de pagamento. Use ao proteger o processamento de pagamentos, obter conformidade com PCI ou implementar cartões de pagamento...",
  "Expert in building custom tools that solve your own problems first. The best products often start as personal tools - scratch your own itch, build for yourself, then discover others have the same i...": "Especialista na construção de ferramentas personalizadas que resolvem primeiro seus próprios problemas. Os melhores produtos muitas vezes começam como ferramentas pessoais - coça a sua própria vontade, construa para si mesmo e depois descubra que outros têm a mesma i...",
  "Implements Manus-style file-based planning for complex tasks. Creates task_plan.md, findings.md, and progress.md. Use when starting complex multi-step tasks, research projects, or any task requirin...": "Implementa planejamento baseado em arquivo no estilo Manus para tarefas complexas. Cria task_plan.md, descobertas.md e progress.md. Use ao iniciar tarefas complexas de várias etapas, projetos de pesquisa ou qualquer tarefa que exija...",
  "Comprehensive PDF manipulation toolkit for extracting text and tables, creating new PDFs, merging/splitting documents, and handling forms. When Claude needs to fill in a PDF form or programmaticall...": "Kit de ferramentas abrangente de manipulação de PDF para extrair texto e tabelas, criar novos PDFs, mesclar/dividir documentos e manipular formulários. Quando Claude precisa preencher um formulário PDF ou programaticamente...",
  "When the user wants to create or optimize in-app paywalls, upgrade screens, upsell modals, or feature gates. Also use when the user mentions \"paywall,\" \"upgrade screen,\" \"upgrade modal,...": "Quando o usuário deseja criar ou otimizar paywalls no aplicativo, atualizar telas, modais de upsell ou portas de recursos. Use também quando o usuário mencionar \"paywall\", \"tela de atualização\", \"modal de atualização,...",
  "Expert patterns for Plaid API integration including Link token flows, transactions sync, identity verification, Auth for ACH, balance checks, webhook handling, and fintech compliance best practices...": "Padrões especializados para integração da API Plaid, incluindo fluxos de token de link, sincronização de transações, verificação de identidade, autenticação para ACH, verificações de saldo, manipulação de webhook e práticas recomendadas de conformidade de fintech...",
  "Structured task planning with clear breakdowns, dependencies, and verification criteria. Use when implementing features, refactoring, or any multi-step work.": "Planejamento de tarefas estruturado com detalhamentos, dependências e critérios de verificação claros. Use ao implementar recursos, refatorar ou qualquer trabalho de várias etapas.",
  "Write idiomatic PHP code with generators, iterators, SPL data": "Escreva código PHP idiomático com geradores, iteradores, dados SPL",
  "Automate Pipedrive CRM operations including deals, contacts, organizations, activities, notes, and pipeline management via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize as operações do Pipedrive CRM, incluindo negócios, contatos, organizações, atividades, notas e gerenciamento de pipeline por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Performance profiling principles. Measurement, analysis, and optimization techniques.": "Princípios de perfil de desempenho. Técnicas de medição, análise e otimização.",
  "Expert performance engineer specializing in modern observability, application optimization, and scalable system performance. Masters OpenTelemetry, distributed tracing, load testing, multi-tier caching, Core Web Vitals, and performance monitoring. Handles end-to-end optimization, real user monitoring, and scalability patterns. Use PROACTIVELY for performance optimization, observability, or scalability challenges.": "Engenheiro de desempenho especializado em observabilidade moderna, otimização de aplicativos e desempenho de sistema escalonável. Domina OpenTelemetry, rastreamento distribuído, teste de carga, cache multicamadas, Core Web Vitals e monitoramento de desempenho. Lida com otimização ponta a ponta, monitoramento de usuários reais e padrões de escalabilidade. Use PROATIVAMENTE para desafios de otimização de desempenho, observabilidade ou escalabilidade.",
  "This skill should be used when the user asks to \"run pentest commands\", \"scan with nmap\", \"use metasploit exploits\", \"crack passwords with hydra or john\", \"scan web vulnerabilities ...": "Esta habilidade deve ser usada quando o usuário pede para \"executar comandos pentest\", \"verificar com nmap\", \"usar exploits metasploit\", \"quebrar senhas com Hydra ou John\", \"verificar vulnerabilidades da web...",
  "This skill should be used when the user asks to \"plan a penetration test\", \"create a security assessment checklist\", \"prepare for penetration testing\", \"define pentest scope\", \"foll...": "Esta habilidade deve ser usada quando o usuário pede para \"planejar um teste de penetração\", \"criar uma lista de verificação de avaliação de segurança\", \"preparar-se para testes de penetração\", \"definir o escopo do pentest\", \"seguir...",
  "Complete browser automation with Playwright. Auto-detects dev servers, writes clean test scripts to /tmp. Test pages, fill forms, take screenshots, check responsive design, validate UX, test login ...": "Automação completa do navegador com Playwright. Detecta automaticamente servidores de desenvolvimento e grava scripts de teste limpos em /tmp. Teste páginas, preencha formulários, faça capturas de tela, verifique design responsivo, valide UX, teste login...",
  "Create and optimize popups, modals, overlays, slide-ins, and banners to increase conversions without harming user experience or brand trust.": "Crie e otimize pop-ups, modais, sobreposições, slides e banners para aumentar as conversões sem prejudicar a experiência do usuário ou a confiança da marca.",
  "Generate AI-powered podcast-style audio narratives using Azure OpenAI's GPT Realtime Mini model via WebSocket. Use when building text-to-speech features, audio narrative generation, podcast creatio...": "Gere narrativas de áudio em estilo podcast com tecnologia de IA usando o modelo GPT Realtime Mini do Azure OpenAI via WebSocket. Use ao criar recursos de conversão de texto em fala, geração de narrativas de áudio, criação de podcast...",
  "Write effective blameless postmortems with root cause analysis, timelines, and action items. Use when conducting incident reviews, writing postmortem documents, or improving incident response proce...": "Escreva postmortems eficazes e isentos de culpa com análise de causa raiz, cronogramas e itens de ação. Use ao conduzir análises de incidentes, redigir documentos post-mortem ou melhorar o processo de resposta a incidentes...",
  "PostgreSQL database optimization workflow for query tuning, indexing strategies, performance analysis, and production database management.": "Fluxo de trabalho de otimização de banco de dados PostgreSQL para ajuste de consulta, estratégias de indexação, análise de desempenho e gerenciamento de banco de dados de produção.",
  "Design a PostgreSQL-specific schema. Covers best-practices, data types, indexing, constraints, performance patterns, and advanced features": "Projete um esquema específico do PostgreSQL. Abrange práticas recomendadas, tipos de dados, indexação, restrições, padrões de desempenho e recursos avançados",
  "Presentation creation, editing, and analysis. When Claude needs to work with presentations (.pptx files) for: (1) Creating new presentations, (2) Modifying or editing content, (3) Working with layo...": "Criação, edição e análise de apresentações. Quando Claude precisa trabalhar com apresentações (arquivos .pptx) para: (1) Criar novas apresentações, (2) Modificar ou editar conteúdo, (3) Trabalhar com layout...",
  "Expert in strict POSIX sh scripting for maximum portability across": "Especialista em scripts sh POSIX rigorosos para máxima portabilidade entre",
  "Postgres performance optimization and best practices from Supabase. Use this skill when writing, reviewing, or optimizing Postgres queries, schema designs, or database configurations.": "Otimização de desempenho do Postgres e melhores práticas da Supabase. Use esta habilidade ao escrever, revisar ou otimizar consultas Postgres, designs de esquema ou configurações de banco de dados.",
  "Build read models and projections from event streams. Use when implementing CQRS read sides, building materialized views, or optimizing query performance in event-sourced systems.": "Crie modelos de leitura e projeções a partir de fluxos de eventos. Use ao implementar lados de leitura do CQRS, criar visualizações materializadas ou otimizar o desempenho de consultas em sistemas originados por eventos.",
  "Automate Postmark email delivery tasks via Rube MCP (Composio): send templated emails, manage templates, monitor delivery stats and bounces. Always search tools first for current schemas.": "Automatize tarefas de entrega de e-mail Postmark via Rube MCP (Composio): envie e-mails modelados, gerencie modelos, monitore estatísticas de entrega e devoluções. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Comprehensive toolkit for product managers including RICE prioritization, customer interview analysis, PRD templates, discovery frameworks, and go-to-market strategies. Use for feature prioritizati...": "Kit de ferramentas abrangente para gerentes de produto, incluindo priorização RICE, análise de entrevistas com clientes, modelos PRD, estruturas de descoberta e estratégias de entrada no mercado. Use para priorização de recursos...",
  "Caching strategies for LLM prompts including Anthropic prompt caching, response caching, and CAG (Cache Augmented Generation) Use when: prompt caching, cache prompt, response cache, cag, cache augm...": "Estratégias de cache para prompts LLM, incluindo cache de prompt antrópico, cache de resposta e CAG (geração aumentada de cache). Use quando: cache de prompt, prompt de cache, cache de resposta, cag, aumento de cache...",
  "Set up Prometheus for comprehensive metric collection, storage, and monitoring of infrastructure and applications. Use when implementing metrics collection, setting up monitoring infrastructure, or...": "Configure o Prometheus para coleta abrangente de métricas, armazenamento e monitoramento de infraestrutura e aplicativos. Use ao implementar a coleta de métricas, configurar a infraestrutura de monitoramento ou...",
  "Design pricing, packaging, and monetization strategies based on value, customer willingness to pay, and growth objectives.": "Projete estratégias de preços, embalagens e monetização com base no valor, na disposição do cliente em pagar e nos objetivos de crescimento.",
  "Prisma ORM expert for schema design, migrations, query optimization, relations modeling, and database operations. Use PROACTIVELY for Prisma schema issues, migration problems, query performance, re...": "Especialista em Prisma ORM para design de esquemas, migrações, otimização de consultas, modelagem de relações e operações de banco de dados. Use PROATIVAMENTE para problemas de esquema Prisma, problemas de migração, desempenho de consulta, re...",
  "Automate PostHog tasks via Rube MCP (Composio): events, feature flags, projects, user profiles, annotations. Always search tools first for current schemas.": "Automatize tarefas PostHog via Rube MCP (Composio): eventos, sinalizadores de recursos, projetos, perfis de usuário, anotações. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "PowerShell Windows patterns. Critical pitfalls, operator syntax, error handling.": "Padrões do Windows do PowerShell. Armadilhas críticas, sintaxe do operador, tratamento de erros.",
  "Autonomously deep-scan entire codebase line-by-line, understand architecture and patterns, then systematically transform it to production-grade, corporate-level professional quality with optimizations": "Faça uma varredura profunda e autônoma de toda a base de código, linha por linha, entenda a arquitetura e os padrões e, em seguida, transforme-os sistematicamente em qualidade profissional de nível de produção e nível corporativo com otimizações",
  "Master advanced prompt engineering techniques to maximize LLM performance, reliability, and controllability in production. Use when optimizing prompts, improving LLM outputs, or designing productio...": "Domine técnicas avançadas de engenharia imediata para maximizar o desempenho, a confiabilidade e a controlabilidade do LLM na produção. Use ao otimizar prompts, melhorar os resultados do LLM ou projetar produção...",
  "Transforms user prompts into optimized prompts using frameworks (RTF, RISEN, Chain of Thought, RODES, Chain of Density, RACE, RISE, STAR, SOAP, CLEAR, GROW)": "Transforma prompts do usuário em prompts otimizados usando estruturas (RTF, RISEN, Chain of Thought, RODES, Chain of Density, RACE, RISE, STAR, SOAP, CLEAR, GROW)",
  "This skill should be used when the user asks to \"escalate privileges\", \"get root access\", \"become administrator\", \"privesc techniques\", \"abuse sudo\", \"exploit SUID binaries\", \"K...": "Esta habilidade deve ser usada quando o usuário pede para \"escalar privilégios\", \"obter acesso root\", \"tornar-se administrador\", \"técnicas privadas\", \"abusar de sudo\", \"explorar binários SUID\", \"K...",
  "Expert guide on prompt engineering patterns, best practices, and optimization techniques. Use when user wants to improve prompts, learn prompting strategies, or debug agent behavior.": "Guia especializado sobre padrões de engenharia imediatos, práticas recomendadas e técnicas de otimização. Use quando o usuário quiser melhorar os prompts, aprender estratégias de prompts ou depurar o comportamento do agente.",
  "Pairwise test generation": "Geração de teste emparelhado",
  "Master network protocol reverse engineering including packet analysis, protocol dissection, and custom protocol documentation. Use when analyzing network traffic, understanding proprietary protocol...": "Domine a engenharia reversa de protocolos de rede, incluindo análise de pacotes, dissecação de protocolos e documentação de protocolos personalizados. Use ao analisar o tráfego de rede, entender o protocolo proprietário...",
  "Create Pydantic models following the multi-model pattern with Base, Create, Update, Response, and InDB variants. Use when defining API request/response schemas, database models, or data validation ...": "Crie modelos Pydantic seguindo o padrão multimodelo com variantes Base, Create, Update, Response e InDB. Use ao definir esquemas de solicitação/resposta de API, modelos de banco de dados ou validação de dados...",
  "Create distributable Python packages with proper project structure, setup.py/pyproject.toml, and publishing to PyPI. Use when packaging Python libraries, creating CLI tools, or distributing Python ...": "Crie pacotes Python distribuíveis com estrutura de projeto adequada, setup.py/pyproject.toml e publicação em PyPI. Use ao empacotar bibliotecas Python, criar ferramentas CLI ou distribuir Python...",
  "Curated collection of high-quality prompts for various use cases. Includes role-based prompts, task-specific templates, and prompt refinement techniques. Use when user needs prompt templates, role-...": "Coleção selecionada de prompts de alta qualidade para vários casos de uso. Inclui prompts baseados em funções, modelos específicos de tarefas e técnicas de refinamento de prompts. Use quando o usuário precisar de modelos de prompt, role-...",
  "Profile and optimize Python code using cProfile, memory profilers, and performance best practices. Use when debugging slow Python code, optimizing bottlenecks, or improving application performance.": "Crie perfis e otimize o código Python usando cProfile, criadores de perfil de memória e práticas recomendadas de desempenho. Use ao depurar código Python lento, otimizar gargalos ou melhorar o desempenho do aplicativo.",
  "Implement comprehensive testing strategies with pytest, fixtures, mocking, and test-driven development. Use when writing Python tests, setting up test suites, or implementing testing best practices.": "Implemente estratégias de teste abrangentes com pytest, fixtures, simulação e desenvolvimento orientado a testes. Use ao escrever testes Python, configurar conjuntos de testes ou implementar práticas recomendadas de teste.",
  "Master Python 3.12+ with modern features, async programming,": "Domine Python 3.12+ com recursos modernos, programação assíncrona,",
  "Python FastAPI backend development with async patterns, SQLAlchemy, Pydantic, authentication, and production API patterns.": "Desenvolvimento de back-end Python FastAPI com padrões assíncronos, SQLAlchemy, Pydantic, autenticação e padrões de API de produção.",
  "You are a Python project architecture expert specializing in scaffolding production-ready Python applications. Generate complete project structures with modern tooling (uv, FastAPI, Django), type hint": "Você é um especialista em arquitetura de projetos Python, especializado em estruturar aplicativos Python prontos para produção. Gere estruturas completas de projetos com ferramentas modernas (uv, FastAPI, Django), digite dica",
  "Python development principles and decision-making. Framework selection, async patterns, type hints, project structure. Teaches thinking, not copying.": "Princípios de desenvolvimento Python e tomada de decisões. Seleção de framework, padrões assíncronos, dicas de tipo, estrutura do projeto. Ensina a pensar, não a copiar.",
  "Expert ReactFlow architect for building interactive graph applications with hierarchical node-edge systems, performance optimization, and auto-layout integration. Use when Claude needs to create or...": "Arquiteto especialista em ReactFlow para construir aplicativos gráficos interativos com sistemas hierárquicos de borda de nó, otimização de desempenho e integração de layout automático. Use quando Claude precisar criar ou...",
  "Create React Flow node components with TypeScript types, handles, and Zustand integration. Use when building custom nodes for React Flow canvas, creating visual workflow editors, or implementing no...": "Crie componentes de nó React Flow com tipos TypeScript, identificadores e integração Zustand. Use ao construir nós personalizados para a tela React Flow, criar editores visuais de fluxo de trabalho ou implementar não...",
  "Build financial models, backtest trading strategies, and analyze": "Crie modelos financeiros, faça backtest de estratégias de negociação e analise",
  "React and Next.js performance optimization guidelines from Vercel Engineering. This skill should be used when writing, reviewing, or refactoring React/Next.js code to ensure optimal performance pat...": "Diretrizes de otimização de desempenho React e Next.js da Vercel Engineering. Essa habilidade deve ser usada ao escrever, revisar ou refatorar o código React/Next.js para garantir o padrão de desempenho ideal...",
  "Build accessible design systems with Radix UI primitives. Headless component customization, theming strategies, and compound component patterns for production-grade UI libraries.": "Crie sistemas de design acessíveis com primitivas de UI Radix. Personalização de componentes headless, estratégias de temas e padrões de componentes compostos para bibliotecas de UI de nível de produção.",
  "Build production React Native apps with Expo, navigation, native modules, offline sync, and cross-platform patterns. Use when developing mobile apps, implementing native integrations, or architecti...": "Crie aplicativos React Native de produção com Expo, navegação, módulos nativos, sincronização offline e padrões de plataforma cruzada. Use ao desenvolver aplicativos móveis, implementar integrações nativas ou arquitetura...",
  "Upgrade React applications to latest versions, migrate from class components to hooks, and adopt concurrent features. Use when modernizing React codebases, migrating to React Hooks, or upgrading to...": "Atualize aplicativos React para versões mais recentes, migre de componentes de classe para ganchos e adote recursos simultâneos. Use ao modernizar bases de código React, migrar para React Hooks ou atualizar para...",
  "RAG (Retrieval-Augmented Generation) implementation workflow covering embedding selection, vector database setup, chunking strategies, and retrieval optimization.": "Fluxo de trabalho de implementação RAG (Retrieval-Augmented Generation) cobrindo seleção de incorporação, configuração de banco de dados vetorial, estratégias de agrupamento e otimização de recuperação.",
  "Master modern React state management with Redux Toolkit, Zustand, Jotai, and React Query. Use when setting up global state, managing server state, or choosing between state management solutions.": "Domine o gerenciamento moderno de estado React com Redux Toolkit, Zustand, Jotai e React Query. Use ao configurar o estado global, gerenciar o estado do servidor ou escolher entre soluções de gerenciamento de estado.",
  "When the user wants to create or update a README.md file for a project. Also use when the user says 'write readme,' 'create readme,' 'document this project,' 'project documentation,' or asks for he...": "Quando o usuário deseja criar ou atualizar um arquivo README.md para um projeto. Use também quando o usuário disser 'escrever leia-me', 'criar leia-me', 'documentar este projeto', 'documentação do projeto' ou pedir ele...",
  "Expert in building Retrieval-Augmented Generation systems. Masters embedding models, vector databases, chunking strategies, and retrieval optimization for LLM applications. Use when: building RAG, ...": "Especialista na construção de sistemas de Geração Aumentada por Recuperação. Domina a incorporação de modelos, bancos de dados vetoriais, estratégias de agrupamento e otimização de recuperação para aplicativos LLM. Use quando: construir RAG, ...",
  "Modern React UI patterns for loading states, error handling, and data fetching. Use when building UI components, handling async data, or managing UI states.": "Padrões modernos de interface do usuário React para estados de carregamento, tratamento de erros e busca de dados. Use ao criar componentes de UI, manipular dados assíncronos ou gerenciar estados de UI.",
  "Modern React patterns and principles. Hooks, composition, performance, TypeScript best practices.": "Padrões e princípios modernos do React. Ganchos, composição, desempenho, práticas recomendadas de TypeScript.",
  "Use when receiving code review feedback, before implementing suggestions, especially if feedback seems unclear or technically questionable - requires technical rigor and verification, not performat...": "Use ao receber feedback de revisão de código, antes de implementar sugestões, especialmente se o feedback parecer pouco claro ou tecnicamente questionável - requer rigor técnico e verificação, não desempenho...",
  "Best practices for Remotion - Video creation in React": "Melhores práticas para Remotion - Criação de vídeo em React",
  "When the user wants to create, optimize, or analyze a referral program, affiliate program, or word-of-mouth strategy. Also use when the user mentions 'referral,' 'affiliate,' 'ambassador,' 'word of...": "Quando o usuário deseja criar, otimizar ou analisar um programa de referência, programa de afiliados ou estratégia boca a boca. Use também quando o usuário mencionar 'referência', 'afiliado', 'embaixador', 'palavra de...",
  "This skill should be used when the user asks to \"follow red team methodology\", \"perform bug bounty hunting\", \"automate reconnaissance\", \"hunt for XSS vulnerabilities\", \"enumerate su...": "Esta habilidade deve ser usada quando o usuário pede para \"seguir a metodologia do time vermelho\", \"realizar caça a recompensas de bugs\", \"automatizar reconhecimento\", \"caçar vulnerabilidades XSS\", \"enumerar su...",
  "React and Next.js 14+ application development with App Router, Server Components, TypeScript, Tailwind CSS, and modern frontend patterns.": "Desenvolvimento de aplicativos React e Next.js 14+ com App Router, componentes de servidor, TypeScript, Tailwind CSS e padrões de front-end modernos.",
  "Red team tactics principles based on MITRE ATT&CK. Attack phases, detection evasion, reporting.": "Princípios táticos do time vermelho baseados no MITRE ATT&CK. Fases de ataque, evasão de detecção, relatórios.",
  "Automate Render tasks via Rube MCP (Composio): services, deployments, projects. Always search tools first for current schemas.": "Automatize tarefas de renderização via Rube MCP (Composio): serviços, implantações, projetos. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Creates exhaustive technical references and API documentation.": "Cria referências técnicas exaustivas e documentação de API.",
  "Automate Reddit tasks via Rube MCP (Composio): search subreddits, create posts, manage comments, and browse top content. Always search tools first for current schemas.": "Automatize tarefas do Reddit via Rube MCP (Composio): pesquise subreddits, crie postagens, gerencie comentários e navegue pelos principais conteúdos. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Use when completing tasks, implementing major features, or before merging to verify work meets requirements": "Use ao concluir tarefas, implementar recursos importantes ou antes de mesclar para verificar se o trabalho atende aos requisitos",
  "Monitor portfolio risk, R-multiples, and position limits. Creates": "Monitore o risco do portfólio, múltiplos R e limites de posição. Cria",
  "Expert reverse engineer specializing in binary analysis,": "Engenheiro reverso especialista especializado em análise binária,",
  "Calculate portfolio risk metrics including VaR, CVaR, Sharpe, Sortino, and drawdown analysis. Use when measuring portfolio risk, implementing risk limits, or building risk monitoring systems.": "Calcule métricas de risco do portfólio, incluindo VaR, CVaR, Sharpe, Sortino e análise de rebaixamento. Use ao medir o risco do portfólio, implementar limites de risco ou criar sistemas de monitoramento de risco.",
  "Master Rust async programming with Tokio, async traits, error handling, and concurrent patterns. Use when building async Rust applications, implementing concurrent systems, or debugging async code.": "Domine a programação assíncrona Rust com Tokio, características assíncronas, tratamento de erros e padrões simultâneos. Use ao criar aplicativos Rust assíncronos, implementar sistemas simultâneos ou depurar código assíncrono.",
  "An uncompromising Academic Research Engineer. Operates with absolute scientific rigor, objective criticism, and zero flair. Focuses on theoretical correctness, formal verification, and optimal impl...": "Um engenheiro de pesquisa acadêmica intransigente. Opera com absoluto rigor científico, crítica objetiva e talento zero. Concentra-se na correção teórica, verificação formal e implementação ideal...",
  "Expert patterns for Salesforce platform development including Lightning Web Components (LWC), Apex triggers and classes, REST/Bulk APIs, Connected Apps, and Salesforce DX with scratch orgs and 2nd ...": "Padrões especializados para desenvolvimento da plataforma Salesforce, incluindo Lightning Web Components (LWC), gatilhos e classes Apex, APIs REST/Bulk, aplicativos conectados e Salesforce DX com organizações temporárias e ...",
  "Write idiomatic Ruby code with metaprogramming, Rails patterns, and": "Escreva código Ruby idiomático com metaprogramação, padrões Rails e",
  "Master enterprise-grade Scala development with functional": "Domine o desenvolvimento Scala de nível empresarial com funcionalidades",
  "Master Rust 1.75+ with modern async patterns, advanced type system": "Master Rust 1.75+ com padrões assíncronos modernos, sistema de tipo avançado",
  "Generate marketing screenshots of your app using Playwright. Use when the user wants to create screenshots for Product Hunt, social media, landing pages, or documentation.": "Gere capturas de tela de marketing do seu aplicativo usando o Playwright. Use quando o usuário deseja criar capturas de tela para Product Hunt, mídias sociais, landing pages ou documentação.",
  "Test web applications with screen readers including VoiceOver, NVDA, and JAWS. Use when validating screen reader compatibility, debugging accessibility issues, or ensuring assistive technology supp...": "Teste aplicativos da web com leitores de tela, incluindo VoiceOver, NVDA e JAWS. Use ao validar a compatibilidade do leitor de tela, depurar problemas de acessibilidade ou garantir o suporte de tecnologia assistiva...",
  "Configure Static Application Security Testing (SAST) tools for automated vulnerability detection in application code. Use when setting up security scanning, implementing DevSecOps practices, or aut...": "Configure ferramentas de teste estático de segurança de aplicativos (SAST) para detecção automatizada de vulnerabilidades no código do aplicativo. Use ao configurar a verificação de segurança, implementar práticas DevSecOps ou auto...",
  "Implement saga patterns for distributed transactions and cross-aggregate workflows. Use when coordinating multi-step business processes, handling compensating transactions, or managing long-running...": "Implemente padrões de saga para transações distribuídas e fluxos de trabalho agregados cruzados. Use ao coordenar processos de negócios de várias etapas, lidar com transações de compensação ou gerenciar...",
  "Draft cold emails, follow-ups, and proposal templates. Creates": "Elabore e-mails frios, acompanhamentos e modelos de propostas. Cria",
  "Automate Salesforce tasks via Rube MCP (Composio): leads, contacts, accounts, opportunities, SOQL queries. Always search tools first for current schemas.": "Automatize tarefas do Salesforce via Rube MCP (Composio): leads, contatos, contas, oportunidades, consultas SOQL. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Expert security auditor specializing in DevSecOps, comprehensive": "Auditor de segurança especializado em DevSecOps, abrangente",
  "Expert in building immersive scroll-driven experiences - parallax storytelling, scroll animations, interactive narratives, and cinematic web experiences. Like NY Times interactives, Apple product p...": "Especialista na construção de experiências imersivas baseadas em rolagem - narrativa em paralaxe, animações de rolagem, narrativas interativas e experiências cinematográficas na web. Assim como os interativos do NY Times, os produtos da Apple...",
  "Derive security requirements from threat models and business context. Use when translating threats into actionable requirements, creating security user stories, or building security test cases.": "Obtenha requisitos de segurança de modelos de ameaças e contexto de negócios. Use ao traduzir ameaças em requisitos acionáveis, criar histórias de usuários de segurança ou criar casos de teste de segurança.",
  "Comprehensive security auditing workflow covering web application testing, API security, penetration testing, vulnerability scanning, and security hardening.": "Fluxo de trabalho abrangente de auditoria de segurança, abrangendo testes de aplicativos da Web, segurança de API, testes de penetração, verificação de vulnerabilidades e reforço de segurança.",
  "Implement secure secrets management for CI/CD pipelines using Vault, AWS Secrets Manager, or native platform solutions. Use when handling sensitive credentials, rotating secrets, or securing CI/CD ...": "Implemente o gerenciamento seguro de segredos para pipelines de CI/CD usando Vault, AWS Secrets Manager ou soluções de plataforma nativa. Use ao lidar com credenciais confidenciais, alternar segredos ou proteger CI/CD...",
  "This skill should be used when the user asks to \"perform vulnerability scanning\", \"scan networks for open ports\", \"assess web application security\", \"scan wireless networks\", \"detec...": "Esta habilidade deve ser usada quando o usuário pede para \"realizar verificação de vulnerabilidades\", \"verificar redes em busca de portas abertas\", \"avaliar a segurança de aplicações web\", \"verificar redes sem fio\", \"detec...",
  "Build security Blue Books for sensitive apps": "Crie Blue Books de segurança para aplicativos confidenciais",
  "Coordinate multi-layer security scanning and hardening across application, infrastructure, and compliance controls.": "Coordene a verificação e o fortalecimento da segurança multicamadas em aplicativos, infraestrutura e controles de conformidade.",
  "You are a compliance expert specializing in regulatory requirements for software systems including GDPR, HIPAA, SOC2, PCI-DSS, and other industry standards. Perform compliance audits and provide im...": "Você é um especialista em conformidade especializado em requisitos regulatórios para sistemas de software, incluindo GDPR, HIPAA, SOC2, PCI-DSS e outros padrões do setor. Realizar auditorias de conformidade e fornecer im...",
  "Expert web researcher using advanced search techniques and synthesis. Masters search operators, result filtering, and multi-source verification. Handles competitive analysis and fact-checking. Use PROACTIVELY for deep research, information gathering, or trend analysis.": "Pesquisador especializado na web usando técnicas avançadas de pesquisa e síntese. Domina operadores de pesquisa, filtragem de resultados e verificação de múltiplas fontes. Lida com análises competitivas e verificação de fatos. Use PROATIVAMENTE para pesquisas profundas, coleta de informações ou análise de tendências.",
  "Automated compliance checking against CIS, PCI-DSS, HIPAA, and SOC 2 benchmarks": "Verificação automatizada de conformidade em relação aos benchmarks CIS, PCI-DSS, HIPAA e SOC 2",
  "You are a security expert specializing in dependency vulnerability analysis, SBOM generation, and supply chain security. Scan project dependencies across ecosystems to identify vulnerabilities, ass...": "Você é um especialista em segurança especializado em análise de vulnerabilidade de dependência, geração de SBOM e segurança da cadeia de suprimentos. Analise as dependências do projeto nos ecossistemas para identificar vulnerabilidades, avaliar...",
  "Comprehensive software architecture skill for designing scalable, maintainable systems using ReactJS, NextJS, NodeJS, Express, React Native, Swift, Kotlin, Flutter, Postgres, GraphQL, Go, Python. I...": "Habilidade abrangente de arquitetura de software para projetar sistemas escaláveis ​​e de fácil manutenção usando ReactJS, NextJS, NodeJS, Express, React Native, Swift, Kotlin, Flutter, Postgres, GraphQL, Go, Python. EU...",
  "Automate SendGrid email operations including sending emails, managing contacts/lists, sender identities, templates, and analytics via Rube MCP (Composio). Always search tools first for current sche...": "Automatize as operações de e-mail do SendGrid, incluindo envio de e-mails, gerenciamento de contatos/listas, identidades de remetentes, modelos e análises por meio do Rube MCP (Composio). Sempre pesquise primeiro as ferramentas pelo esquema atual...",
  "Static Application Security Testing (SAST) for code vulnerability": "Teste estático de segurança de aplicativos (SAST) para vulnerabilidade de código",
  "Comprehensive AWS security posture assessment using AWS CLI and security best practices": "Avaliação abrangente da postura de segurança da AWS usando AWS CLI e práticas recomendadas de segurança",
  "Automate AWS secrets rotation for RDS, API keys, and credentials": "Automatize a rotação de segredos da AWS para RDS, chaves de API e credenciais",
  "IAM policy review, hardening, and least privilege implementation": "Revisão da política IAM, reforço e implementação de privilégios mínimos",
  "Automate Sentry tasks via Rube MCP (Composio): manage issues/events, configure alerts, track releases, monitor projects and teams. Always search tools first for current schemas.": "Automatize tarefas do Sentry via Rube MCP (Composio): gerencie problemas/eventos, configure alertas, rastreie lançamentos, monitore projetos e equipes. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Automate Segment tasks via Rube MCP (Composio): track events, identify users, manage groups, page views, aliases, batch operations. Always search tools first for current schemas.": "Automatize tarefas de segmento via Rube MCP (Composio): rastreie eventos, identifique usuários, gerencie grupos, visualizações de páginas, aliases, operações em lote. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Comprehensive fullstack development skill for building complete web applications with React, Next.js, Node.js, GraphQL, and PostgreSQL. Includes project scaffolding, code quality analysis, architec...": "Habilidade abrangente de desenvolvimento fullstack para construir aplicativos web completos com React, Next.js, Node.js, GraphQL e PostgreSQL. Inclui estrutura de projeto, análise de qualidade de código, arquitetura...",
  "Analyzes content for E-E-A-T signals and suggests improvements to": "Analisa o conteúdo em busca de sinais EAT e sugere melhorias para",
  "Expert patterns for Segment Customer Data Platform including Analytics.js, server-side tracking, tracking plans with Protocols, identity resolution, destinations configuration, and data governance ...": "Padrões especializados para plataforma de dados de clientes de segmento, incluindo Analytics.js, rastreamento do lado do servidor, planos de rastreamento com protocolos, resolução de identidade, configuração de destinos e governança de dados...",
  "Creates comprehensive content outlines and topic clusters for SEO.": "Cria esboços de conteúdo abrangentes e grupos de tópicos para SEO.",
  "Writes SEO-optimized content based on provided keywords and topic": "Escreve conteúdo otimizado para SEO com base nas palavras-chave e no tópico fornecidos",
  "Analyzes multiple provided pages to identify keyword overlap and": "Analisa várias páginas fornecidas para identificar sobreposição de palavras-chave e",
  "Formats content to be eligible for featured snippets and SERP": "Formata o conteúdo para ser elegível para snippets em destaque e SERP",
  "Identifies outdated elements in provided content and suggests": "Identifica elementos desatualizados no conteúdo fornecido e sugere",
  "Analyzes provided content for quality, E-E-A-T signals, and SEO": "As análises forneceram conteúdo quanto à qualidade, sinais EAT e SEO",
  "Expert service mesh architect specializing in Istio, Linkerd, and cloud-native networking patterns. Masters traffic management, security policies, observability integration, and multi-cluster mesh con": "Arquiteto especialista em service mesh, especializado em Istio, Linkerd e padrões de rede nativos da nuvem. Domine o gerenciamento de tráfego, políticas de segurança, integração de observabilidade e configuração de malha multicluster",
  "Identify error-prone APIs and dangerous configurations": "Identifique APIs propensas a erros e configurações perigosas",
  "Master ShellCheck static analysis configuration and usage for shell script quality. Use when setting up linting infrastructure, fixing code issues, or ensuring script portability.": "Domine a configuração e o uso da análise estática do ShellCheck para qualidade de script de shell. Use ao configurar a infraestrutura de linting, corrigir problemas de código ou garantir a portabilidade de scripts.",
  "Analyzes keyword usage in provided content, calculates density,": "Analisa o uso de palavras-chave no conteúdo fornecido, calcula a densidade,",
  "Expert guide for writing efficient GLSL shaders (Vertex/Fragment) for web and game engines, covering syntax, uniforms, and common effects.": "Guia especializado para escrever shaders GLSL eficientes (Vertex/Fragment) para motores de jogos e web, cobrindo sintaxe, uniformes e efeitos comuns.",
  "Creates optimized meta titles, descriptions, and URL suggestions": "Cria meta títulos, descrições e sugestões de URL otimizados",
  "Server management principles and decision-making. Process management, monitoring strategy, and scaling decisions. Teaches thinking, not commands.": "Princípios de gerenciamento de servidores e tomada de decisões. Gerenciamento de processos, estratégia de monitoramento e decisões de escala. Ensina a pensar, não a comandar.",
  "Expert patterns for Shopify app development including Remix/React Router apps, embedded apps with App Bridge, webhook handling, GraphQL Admin API, Polaris components, billing, and app extensions. U...": "Padrões especializados para desenvolvimento de aplicativos Shopify, incluindo aplicativos Remix/React Router, aplicativos incorporados com App Bridge, manipulação de webhook, API GraphQL Admin, componentes Polaris, faturamento e extensões de aplicativo. Você...",
  "Build Shopify apps, extensions, themes using GraphQL Admin API, Shopify CLI, Polaris UI, and Liquid.\nTRIGGER: \"shopify\", \"shopify app\", \"checkout extension\", \"admin extension\", \"POS extension\",\n\"shopify theme\", \"liquid template\", \"polaris\", \"shopify graphql\", \"shopify webhook\",\n\"shopify billing\", \"app subscription\", \"metafields\", \"shopify functions\"": "Crie aplicativos, extensões e temas do Shopify usando GraphQL Admin API, Shopify CLI, Polaris UI e Liquid.\nTRIGGER: \"shopify\", \"app shopify\", \"extensão de checkout\", \"extensão admin\", \"extensão POS\",\n\"tema shopify\", \"modelo líquido\", \"polaris\", \"shopify graphql\", \"shopify webhook\",\n\"faturamento do shopify\", \"assinatura de aplicativo\", \"metacampos\", \"funções do shopify\"",
  "Automate Shopify tasks via Rube MCP (Composio): products, orders, customers, inventory, collections. Always search tools first for current schemas.": "Automatize tarefas do Shopify via Rube MCP (Composio): produtos, pedidos, clientes, estoque, coleções. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Analyzes and optimizes content structure including header": "Analisa e otimiza a estrutura do conteúdo, incluindo cabeçalho",
  "Implement comprehensive observability for service meshes including distributed tracing, metrics, and visualization. Use when setting up mesh monitoring, debugging latency issues, or implementing SL...": "Implemente observabilidade abrangente para malhas de serviço, incluindo rastreamento distribuído, métricas e visualização. Use ao configurar o monitoramento de malha, depurar problemas de latência ou implementar SL...",
  "This skill should be used when the user asks to \"search for exposed devices on the internet,\" \"perform Shodan reconnaissance,\" \"find vulnerable services using Shodan,\" \"scan IP ranges...": "Esta habilidade deve ser usada quando o usuário pede para “procurar dispositivos expostos na internet”, “realizar reconhecimento Shodan”, “encontrar serviços vulneráveis ​​usando Shodan”, “verificar faixas de IP...",
  "Implement efficient similarity search with vector databases. Use when building semantic search, implementing nearest neighbor queries, or optimizing retrieval performance.": "Implemente uma pesquisa eficiente de similaridade com bancos de dados vetoriais. Use ao criar pesquisa semântica, implementar consultas de vizinhos mais próximos ou otimizar o desempenho de recuperação.",
  "When the user wants to optimize signup, registration, account creation, or trial activation flows. Also use when the user mentions \"signup conversions,\" \"registration friction,\" \"signup...": "Quando o usuário deseja otimizar os fluxos de inscrição, registro, criação de conta ou ativação de teste. Use também quando o usuário mencionar \"conversões de inscrição\", \"atrito de registro\", \"inscrição...",
  "Create and manage Claude Code skills following Anthropic best practices. Use when creating new skills, modifying skill-rules.json, understanding trigger patterns, working with hooks, debugging skil...": "Criar e gerenciar habilidades do Claude Code seguindo as melhores práticas da Antrópica. Use ao criar novas habilidades, modificar habilidade-rules.json, compreender padrões de gatilho, trabalhar com ganchos, depurar habilidades...",
  "Automate Slack messaging, channel management, search, reactions, and threads via Rube MCP (Composio). Send messages, search conversations, manage channels/users, and react to messages programmatica...": "Automatize mensagens do Slack, gerenciamento de canais, pesquisas, reações e tópicos por meio do Rube MCP (Composio). Envie mensagens, pesquise conversas, gerencie canais/usuários e reaja a mensagens programáticas...",
  "This skill should be used when the user asks to create a new skill, build a skill, make a custom skill, develop a CLI skill, or wants to extend the CLI with new capabilities. Automates the entire s...": "Essa habilidade deve ser usada quando o usuário solicita a criação de uma nova habilidade, a construção de uma habilidade, a criação de uma habilidade customizada, o desenvolvimento de uma habilidade CLI ou deseja estender a CLI com novos recursos. Automatiza todo o sistema...",
  "-Automatically convert documentation websites, GitHub repositories, and PDFs into Claude AI skills in minutes.": "-Converta automaticamente sites de documentação, repositórios GitHub e PDFs em habilidades de Claude AI em minutos.",
  "Build Slack apps using the Bolt framework across Python, JavaScript, and Java. Covers Block Kit for rich UIs, interactive components, slash commands, event handling, OAuth installation flows, and W...": "Crie aplicativos do Slack usando a estrutura Bolt em Python, JavaScript e Java. Abrange Block Kit para interfaces de usuário ricas, componentes interativos, comandos de barra, manipulação de eventos, fluxos de instalação OAuth e W...",
  "Master smart contract security best practices to prevent common vulnerabilities and implement secure Solidity patterns. Use when writing smart contracts, auditing existing contracts, or implementin...": "Domine as práticas recomendadas de segurança de contratos inteligentes para evitar vulnerabilidades comuns e implementar padrões seguros do Solidity. Use ao escrever contratos inteligentes, auditar contratos existentes ou implementar...",
  "Guide for creating effective skills for AI coding agents working with Azure SDKs and Microsoft Foundry services. Use when creating new skills or updating existing skills.": "Guia para criar competências eficazes para agentes de codificação de IA que trabalham com Azure SDKs e serviços Microsoft Foundry. Use ao criar novas habilidades ou atualizar habilidades existentes.",
  "Knowledge and utilities for creating animated GIFs optimized for Slack. Provides constraints, validation tools, and animation concepts. Use when users request animated GIFs for Slack like \"...": "Conhecimento e utilitários para criação de GIFs animados otimizados para Slack. Fornece restrições, ferramentas de validação e conceitos de animação. Use quando os usuários solicitarem GIFs animados para o Slack como \"...",
  "Optimize Apache Spark jobs with partitioning, caching, shuffle optimization, and memory tuning. Use when improving Spark performance, debugging slow jobs, or scaling data processing pipelines.": "Otimize trabalhos do Apache Spark com particionamento, armazenamento em cache, otimização aleatória e ajuste de memória. Use ao melhorar o desempenho do Spark, depurar trabalhos lentos ou dimensionar pipelines de processamento de dados.",
  "Analyze Rails apps and provide upgrade assessments": "Analise aplicativos Rails e forneça avaliações de atualização",
  "Guide for quality focused software architecture. This skill should be used when users want to write code, design architecture, analyze code, in any case that relates to software development.": "Guia para arquitetura de software com foco na qualidade. Esta habilidade deve ser utilizada quando os usuários desejam escrever código, projetar arquitetura, analisar código, em qualquer caso relacionado ao desenvolvimento de software.",
  "Define and implement Service Level Indicators (SLIs) and Service Level Objectives (SLOs) with error budgets and alerting. Use when establishing reliability targets, implementing SRE practices, or m...": "Defina e implemente Indicadores de Nível de Serviço (SLIs) e Objetivos de Nível de Serviço (SLOs) com orçamentos de erro e alertas. Use ao estabelecer metas de confiabilidade, implementar práticas de SRE ou m...",
  "When the user wants help creating, scheduling, or optimizing social media content for LinkedIn, Twitter/X, Instagram, TikTok, Facebook, or other platforms. Also use when the user mentions 'LinkedIn...": "Quando o usuário deseja ajuda para criar, agendar ou otimizar conteúdo de mídia social para LinkedIn, Twitter/X, Instagram, TikTok, Facebook ou outras plataformas. Use também quando o usuário mencionar 'LinkedIn...",
  "Expert startup business analyst specializing in market sizing,": "Analista de negócios especialista em startups especializado em dimensionamento de mercado,",
  "Master modern SQL with cloud-native databases, OLTP/OLAP": "Domine SQL moderno com bancos de dados nativos da nuvem, OLTP/OLAP",
  "Automate Square tasks via Rube MCP (Composio): payments, orders, invoices, locations. Always search tools first for current schemas.": "Automatize tarefas do Square via Rube MCP (Composio): pagamentos, pedidos, faturas, locais. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Generate comprehensive investor-ready business case document with": "Gere um documento de caso de negócios abrangente e pronto para o investidor com",
  "Create detailed 3-5 year financial model with revenue, costs, cash": "Crie um modelo financeiro detalhado de 3 a 5 anos com receitas, custos e caixa",
  "Master SQL query optimization, indexing strategies, and EXPLAIN analysis to dramatically improve database performance and eliminate slow queries. Use when debugging slow queries, designing database...": "Domine a otimização de consultas SQL, estratégias de indexação e análise EXPLAIN para melhorar drasticamente o desempenho do banco de dados e eliminar consultas lentas. Use ao depurar consultas lentas, projetar banco de dados...",
  "This skill should be used when the user asks to \"automate SQL injection testing,\" \"enumerate database structure,\" \"extract database credentials using sqlmap,\" \"dump tables and columns...": "Esta habilidade deve ser usada quando o usuário pede para \"automatizar testes de injeção de SQL\", \"enumerar estrutura de banco de dados\", \"extrair credenciais de banco de dados usando sqlmap\", \"despejar tabelas e colunas...",
  "This skill should be used when the user asks to \"perform SMTP penetration testing\", \"enumerate email users\", \"test for open mail relays\", \"grab SMTP banners\", \"brute force email cre...": "Esta habilidade deve ser usada quando o usuário pede para \"realizar testes de penetração SMTP\", \"enumerar usuários de e-mail\", \"testar retransmissões de e-mail abertas\", \"capturar banners SMTP\", \"criar e-mail de força bruta...",
  "This skill should be used when the user asks to \"test for SQL injection vulnerabilities\", \"perform SQLi attacks\", \"bypass authentication using SQL injection\", \"extract database inform...": "Esta habilidade deve ser usada quando o usuário solicitar \"testar vulnerabilidades de injeção SQL\", \"realizar ataques SQLi\", \"ignorar autenticação usando injeção SQL\", \"extrair informações do banco de dados...",
  "Generate comprehensive market opportunity analysis with TAM/SAM/SOM": "Gere análises abrangentes de oportunidades de mercado com TAM/SAM/SOM",
  "This skill should be used when the user asks to \"pentest SSH services\", \"enumerate SSH configurations\", \"brute force SSH credentials\", \"exploit SSH vulnerabilities\", \"perform SSH tu...": "Esta habilidade deve ser usada quando o usuário pede para \"pentestar serviços SSH\", \"enumerar configurações SSH\", \"credenciais SSH de força bruta\", \"explorar vulnerabilidades SSH\", \"realizar tu...",
  "This skill should be used when the user asks to \\\"create financial": "Esta habilidade deve ser usada quando o usuário pede para \"criar",
  "This skill should be used when the user asks about \\\"key startup": "Esta habilidade deve ser usada quando o usuário perguntar sobre \"chave de inicialização",
  "Expert guide for creating effective prompts for Google Stitch AI UI design tool. Use when user wants to design UI/UX in Stitch, create app interfaces, generate mobile/web designs, or needs help cra...": "Guia especializado para criar prompts eficazes para a ferramenta de design de IU do Google Stitch AI. Use quando o usuário deseja projetar UI/UX no Stitch, criar interfaces de aplicativos, gerar designs móveis/web ou precisar de ajuda para criar...",
  "Apply STRIDE methodology to systematically identify threats. Use when analyzing system security, conducting threat modeling sessions, or creating security documentation.": "Aplique a metodologia STRIDE para identificar ameaças sistematicamente. Use ao analisar a segurança do sistema, conduzir sessões de modelagem de ameaças ou criar documentação de segurança.",
  "Lab environment for Claude superpowers": "Ambiente de laboratório para os superpoderes de Claude",
  "Implement Stripe payment processing for robust, PCI-compliant payment flows including checkout, subscriptions, and webhooks. Use when integrating Stripe payments, building subscription systems, or ...": "Implemente o processamento de pagamentos Stripe para fluxos de pagamento robustos e compatíveis com PCI, incluindo checkout, assinaturas e webhooks. Use ao integrar pagamentos Stripe, criar sistemas de assinatura ou ...",
  "Use when executing implementation plans with independent tasks in the current session": "Use ao executar planos de implementação com tarefas independentes na sessão atual",
  "You are a Rust project architecture expert specializing in scaffolding production-ready Rust applications. Generate complete project structures with cargo tooling, proper module organization, testing": "Você é um especialista em arquitetura de projetos Rust, especializado em estruturas de aplicativos Rust prontos para produção. Gere estruturas completas de projetos com ferramentas de carga, organização adequada de módulos, testes",
  "Automate Supabase database queries, table management, project administration, storage, edge functions, and SQL execution via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize consultas ao banco de dados Supabase, gerenciamento de tabelas, administração de projetos, armazenamento, funções de borda e execução de SQL via Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Build scalable design systems with Tailwind CSS, design tokens, component libraries, and responsive patterns. Use when creating component libraries, implementing design systems, or standardizing UI...": "Crie sistemas de design escalonáveis ​​com Tailwind CSS, tokens de design, bibliotecas de componentes e padrões responsivos. Use ao criar bibliotecas de componentes, implementar sistemas de design ou padronizar UI...",
  "Use when encountering any bug, test failure, or unexpected behavior, before proposing fixes": "Use ao encontrar qualquer bug, falha de teste ou comportamento inesperado, antes de propor correções",
  "Automate Stripe tasks via Rube MCP (Composio): customers, charges, subscriptions, invoices, products, refunds. Always search tools first for current schemas.": "Automatize tarefas do Stripe via Rube MCP (Composio): clientes, cobranças, assinaturas, faturas, produtos, reembolsos. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Write, review, or improve SwiftUI code following best practices for state management, view composition, performance, modern APIs, Swift concurrency, and iOS 26+ Liquid Glass adoption. Use when buil...": "Escreva, revise ou melhore o código SwiftUI seguindo as práticas recomendadas para gerenciamento de estado, composição de visualização, desempenho, APIs modernas, simultaneidade Swift e adoção do iOS 26+ Liquid Glass. Use quando construir...",
  "Tailwind CSS v4 principles. CSS-first configuration, container queries, modern patterns, design token architecture.": "Princípios do Tailwind CSS v4. Configuração CSS-first, consultas de contêiner, padrões modernos, arquitetura de token de design.",
  "Master TDD orchestrator specializing in red-green-refactor": "Orquestrador mestre TDD especializado em refatoração vermelho-verde",
  "Use when working with tdd workflows tdd cycle": "Use ao trabalhar com fluxos de trabalho tdd ciclo tdd",
  "Test-Driven Development workflow principles. RED-GREEN-REFACTOR cycle.": "Princípios de fluxo de trabalho de Desenvolvimento Orientado a Testes. Ciclo VERMELHO-VERDE-REFATOR.",
  "Use when working with tdd workflows tdd refactor": "Use ao trabalhar com fluxos de trabalho tdd refatoração tdd",
  "Web search, content extraction, crawling, and research capabilities using Tavily API": "Pesquisa na Web, extração de conteúdo, rastreamento e recursos de pesquisa usando a API Tavily",
  "You are a GitHub issue resolution expert specializing in systematic bug investigation, feature implementation, and collaborative development workflows. Your expertise spans issue triage, root cause an": "Você é um especialista em resolução de problemas do GitHub, especializado em investigação sistemática de bugs, implementação de recursos e fluxos de trabalho de desenvolvimento colaborativo. Sua experiência abrange triagem de problemas, causa raiz e",
  "Expert in building Telegram Mini Apps (TWA) - web apps that run inside Telegram with native-like experience. Covers the TON ecosystem, Telegram Web App API, payments, user authentication, and build...": "Especialista na construção de Telegram Mini Apps (TWA) - aplicativos web que rodam dentro do Telegram com experiência nativa. Abrange o ecossistema TON, API do Telegram Web App, pagamentos, autenticação de usuário e construção...",
  "Generate failing tests for the TDD red phase to define expected behavior and edge cases.": "Gere testes com falha para a fase vermelha do TDD para definir o comportamento esperado e os casos extremos.",
  "This skill should be used when the user asks to \\\"plan team": "Esta habilidade deve ser usada quando o usuário pede para \"planejar a equipe",
  "Implement the minimal code needed to make failing tests pass in the TDD green phase.": "Implemente o código mínimo necessário para fazer com que os testes com falha passem na fase verde do TDD.",
  "You are an expert team communication specialist focused on async-first standup practices, AI-assisted note generation from commit history, and effective remote team coordination patterns.": "Você é um especialista em comunicação de equipe com foco em práticas de standup assíncronas, geração de notas assistida por IA a partir do histórico de commits e padrões eficazes de coordenação de equipe remota.",
  "Build reusable Terraform modules for AWS, Azure, and GCP infrastructure following infrastructure-as-code best practices. Use when creating infrastructure modules, standardizing cloud provisioning, ...": "Crie módulos Terraform reutilizáveis ​​para infraestrutura AWS, Azure e GCP seguindo as práticas recomendadas de infraestrutura como código. Use ao criar módulos de infraestrutura, padronizar o provisionamento de nuvem, ...",
  "Master Temporal workflow orchestration with Python SDK. Implements": "Domine a orquestração de fluxo de trabalho temporal com Python SDK. Implementos",
  "Expert in building Telegram bots that solve real problems - from simple automation to complex AI-powered bots. Covers bot architecture, the Telegram Bot API, user experience, monetization strategie...": "Especialista na construção de bots do Telegram que resolvem problemas reais - desde automação simples até bots complexos com tecnologia de IA. Abrange arquitetura de bot, API Telegram Bot, experiência do usuário, estratégia de monetização...",
  "Terraform infrastructure as code best practices": "Infraestrutura Terraform como práticas recomendadas de código",
  "Automate Telegram tasks via Rube MCP (Composio): send messages, manage chats, share photos/documents, and handle bot commands. Always search tools first for current schemas.": "Automatize tarefas do Telegram via Rube MCP (Composio): envie mensagens, gerencie chats, compartilhe fotos/documentos e administre comandos de bot. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Terraform module creation for AWS — reusable modules, state management, and HCL best practices. Use when building or reviewing Terraform AWS infrastructure.": "Criação de módulo Terraform para AWS — módulos reutilizáveis, gerenciamento de estado e práticas recomendadas de HCL. Use ao construir ou revisar a infraestrutura Terraform AWS.",
  "Terraform infrastructure as code workflow for provisioning cloud resources, creating reusable modules, and managing infrastructure at scale.": "Infraestrutura Terraform como fluxo de trabalho de código para provisionamento de recursos de nuvem, criação de módulos reutilizáveis ​​e gerenciamento de infraestrutura em escala.",
  "Expert Terraform/OpenTofu specialist mastering advanced IaC": "Especialista em Terraform/OpenTofu dominando IaC avançado",
  "Master AI-powered test automation with modern frameworks,": "Domine a automação de testes baseada em IA com estruturas modernas,",
  "Jest testing patterns, factory functions, mocking strategies, and TDD workflow. Use when writing unit tests, creating test factories, or following TDD red-green-refactor cycle.": "Padrões de teste de Jest, funções de fábrica, estratégias de simulação e fluxo de trabalho TDD. Use ao escrever testes de unidade, criar fábricas de testes ou seguir o ciclo de refatoração vermelho-verde do TDD.",
  "Test Temporal workflows with pytest, time-skipping, and mocking strategies. Covers unit testing, integration testing, replay testing, and local development setup. Use when implementing Temporal wor...": "Teste fluxos de trabalho temporais com estratégias pytest, time-skipping e mocking. Abrange testes unitários, testes de integração, testes de repetição e configuração de desenvolvimento local. Use ao implementar trabalhos temporais...",
  "Use when implementing any feature or bugfix, before writing implementation code": "Use ao implementar qualquer recurso ou correção de bug, antes de escrever o código de implementação",
  "Run tests and systematically fix all failing tests using smart error grouping. Use when user asks to fix failing tests, mentions test failures, runs test suite and failures occur, or requests to ma...": "Execute testes e corrija sistematicamente todos os testes com falha usando agrupamento inteligente de erros. Use quando o usuário pede para corrigir testes com falha, menciona falhas de teste, executa conjunto de testes e ocorrem falhas ou solicita...",
  "Toolkit for styling artifacts with a theme. These artifacts can be slides, docs, reportings, HTML landing pages, etc. There are 10 pre-set themes with colors/fonts that you can apply to any artifac...": "Kit de ferramentas para estilizar artefatos com um tema. Esses artefatos podem ser slides, documentos, relatórios, landing pages HTML, etc. Existem 10 temas predefinidos com cores/fontes que você pode aplicar a qualquer artefato...",
  "Create 3D scenes, interactive experiences, and visual effects using Three.js. Use when user requests 3D graphics, WebGL experiences, 3D visualizations, animations, or interactive 3D elements.": "Crie cenas 3D, experiências interativas e efeitos visuais usando Three.js. Use quando o usuário solicitar gráficos 3D, experiências WebGL, visualizações 3D, animações ou elementos 3D interativos.",
  "Comprehensive testing and QA workflow covering unit testing, integration testing, E2E testing, browser automation, and quality assurance.": "Testes abrangentes e fluxo de trabalho de controle de qualidade abrangendo testes de unidade, testes de integração, testes E2E, automação de navegador e garantia de qualidade.",
  "Map identified threats to appropriate security controls and mitigations. Use when prioritizing security investments, creating remediation plans, or validating control effectiveness.": "Mapeie ameaças identificadas para controles e mitigações de segurança apropriados. Use ao priorizar investimentos em segurança, criar planos de correção ou validar a eficácia do controle.",
  "Build tools that agents can use effectively, including architectural reduction patterns": "Crie ferramentas que os agentes possam usar de forma eficaz, incluindo padrões de redução arquitetural",
  "Automate Trello boards, cards, and workflows via Rube MCP (Composio). Create cards, manage lists, assign members, and search across boards programmatically.": "Automatize quadros, cartões e fluxos de trabalho do Trello por meio do Rube MCP (Composio). Crie cartões, gerencie listas, atribua membros e pesquise em fóruns de maneira programática.",
  "Build communication features with Twilio: SMS messaging, voice calls, WhatsApp Business API, and user verification (2FA). Covers the full spectrum from simple notifications to complex IVR systems a...": "Crie recursos de comunicação com Twilio: mensagens SMS, chamadas de voz, WhatsApp Business API e verificação de usuário (2FA). Abrange todo o espectro, desde notificações simples até sistemas IVR complexos e...",
  "Automate TikTok tasks via Rube MCP (Composio): upload/publish videos, post photos, manage content, and view user profiles/stats. Always search tools first for current schemas.": "Automatize tarefas do TikTok via Rube MCP (Composio): carregue/publique vídeos, poste fotos, gerencie conteúdo e visualize perfis/estatísticas de usuários. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Expert in threat modeling methodologies, security architecture review, and risk assessment. Masters STRIDE, PASTA, attack trees, and security requirement extraction. Use for security architecture r...": "Especialista em metodologias de modelagem de ameaças, revisão de arquitetura de segurança e avaliação de riscos. Domine STRIDE, PASTA, árvores de ataque e extração de requisitos de segurança. Use para arquitetura de segurança r...",
  "Automate Todoist task management, projects, sections, filtering, and bulk operations via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize o gerenciamento de tarefas, projetos, seções, filtragem e operações em massa do Todoist via Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Configure Turborepo for efficient monorepo builds with local and remote caching. Use when setting up Turborepo, optimizing build pipelines, or implementing distributed caching.": "Configure o Turborepo para compilações monorepo eficientes com cache local e remoto. Use ao configurar o Turborepo, otimizar pipelines de construção ou implementar cache distribuído.",
  "Use this skill when creating, managing, or working with Conductor": "Use esta habilidade ao criar, gerenciar ou trabalhar com o Conductor",
  "This skill should be used when the user asks to \"identify web application vulnerabilities\", \"explain common security flaws\", \"understand vulnerability categories\", \"learn about inject...": "Esta habilidade deve ser usada quando o usuário pede para \"identificar vulnerabilidades de aplicações web\", \"explicar falhas de segurança comuns\", \"entender categorias de vulnerabilidade\", \"aprender sobre injeção...",
  "Master TypeScript's advanced type system including generics, conditional types, mapped types, template literals, and utility types for building type-safe applications. Use when implementing complex...": "Domine o sistema de tipos avançado do TypeScript, incluindo genéricos, tipos condicionais, tipos mapeados, literais de modelo e tipos de utilitários para criar aplicativos com segurança de tipo. Use ao implementar complexos...",
  "Opinionated, evolving constraints to guide agents when building interfaces": "Restrições opinativas e em evolução para orientar os agentes na construção de interfaces",
  "Automate Twitter/X tasks via Rube MCP (Composio): posts, search, users, bookmarks, lists, media. Always search tools first for current schemas.": "Automatize tarefas do Twitter/X via Rube MCP (Composio): postagens, pesquisa, usuários, favoritos, listas, mídia. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Creates step-by-step tutorials and educational content from code.": "Cria tutoriais passo a passo e conteúdo educacional a partir do código.",
  "Rigorous visual validation expert specializing in UI testing,": "Rigoroso especialista em validação visual especializado em testes de UI,",
  "UI/UX design intelligence. 50 styles, 21 palettes, 50 font pairings, 20 charts, 9 stacks (React, Next.js, Vue, Svelte, SwiftUI, React Native, Flutter, Tailwind, shadcn/ui). Actions: plan, build, cr...": "Inteligência de design UI/UX. 50 estilos, 21 paletas, 50 pares de fontes, 20 gráficos, 9 pilhas (React, Next.js, Vue, Svelte, SwiftUI, React Native, Flutter, Tailwind, shadcn/ui). Ações: planejar, construir, cri...",
  "Create interface designs, wireframes, and design systems. Masters": "Crie designs de interface, wireframes e sistemas de design. Mestres",
  "Trigger.dev expert for background jobs, AI workflows, and reliable async execution with excellent developer experience and TypeScript-first design. Use when: trigger.dev, trigger dev, background ta...": "Especialista em Trigger.dev para trabalhos em segundo plano, fluxos de trabalho de IA e execução assíncrona confiável com excelente experiência de desenvolvedor e design TypeScript-first. Use quando: trigger.dev, trigger dev, background ta...",
  "Master TypeScript with advanced types, generics, and strict type": "Domine TypeScript com tipos avançados, genéricos e tipo estrito",
  "Generate comprehensive, maintainable unit tests across languages with strong coverage and edge case focus.": "Gere testes de unidade abrangentes e fáceis de manter em vários idiomas, com forte cobertura e foco em casos extremos.",
  "Master Unity ECS (Entity Component System) with DOTS, Jobs, and Burst for high-performance game development. Use when building data-oriented games, optimizing performance, or working with large ent...": "Domine Unity ECS (Entity Component System) com DOTS, Jobs e Burst para desenvolvimento de jogos de alto desempenho. Use ao criar jogos orientados a dados, otimizar o desempenho ou trabalhar com grandes...",
  "Build Unity games with optimized C# scripts, efficient rendering,": "Crie jogos Unity com scripts C# otimizados, renderização eficiente,",
  "Upgrade Expo SDK versions": "Atualizar versões do Expo SDK",
  "Expert guide for Unreal Engine 5.x C++ development, covering UObject hygiene, performance patterns, and best practices.": "Guia especializado para desenvolvimento do Unreal Engine 5.x C++, cobrindo higiene de UObject, padrões de desempenho e práticas recomendadas.",
  "Use when starting any conversation - establishes how to find and use skills, requiring Skill tool invocation before ANY response including clarifying questions": "Use ao iniciar qualquer conversa - estabelece como encontrar e usar habilidades, exigindo a invocação da ferramenta Skill antes de QUALQUER resposta, incluindo esclarecimento de perguntas",
  "Secure environment variable management ensuring secrets are never exposed in Claude sessions, terminals, logs, or git commits": "Gerenciamento seguro de variáveis ​​de ambiente garantindo que segredos nunca sejam expostos em sessões, terminais, logs ou commits do Claude",
  "Expert in vector databases, embedding strategies, and semantic search implementation. Masters Pinecone, Weaviate, Qdrant, Milvus, and pgvector for RAG applications, recommendation systems, and similar": "Especialista em bancos de dados vetoriais, estratégias de incorporação e implementação de pesquisa semântica. Masters Pinecone, Weaviate, Qdrant, Milvus e pgvector para aplicações RAG, sistemas de recomendação e similares",
  "Automate Vercel tasks via Rube MCP (Composio): manage deployments, domains, DNS, env vars, projects, and teams. Always search tools first for current schemas.": "Automatize tarefas Vercel via Rube MCP (Composio): gerencie implantações, domínios, DNS, ambientes, projetos e equipes. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Master the uv package manager for fast Python dependency management, virtual environments, and modern Python project workflows. Use when setting up Python projects, managing dependencies, or optimi...": "Domine o gerenciador de pacotes uv para gerenciamento rápido de dependências do Python, ambientes virtuais e fluxos de trabalho modernos de projetos do Python. Use ao configurar projetos Python, gerenciar dependências ou otimizar...",
  "Optimize vector index performance for latency, recall, and memory. Use when tuning HNSW parameters, selecting quantization strategies, or scaling vector search infrastructure.": "Otimize o desempenho do índice vetorial para latência, recall e memória. Use ao ajustar parâmetros HNSW, selecionar estratégias de quantização ou dimensionar infraestrutura de pesquisa vetorial.",
  "Upstash QStash expert for serverless message queues, scheduled jobs, and reliable HTTP-based task delivery without managing infrastructure. Use when: qstash, upstash queue, serverless cron, schedul...": "Especialista em Upstash QStash para filas de mensagens sem servidor, trabalhos agendados e entrega confiável de tarefas baseadas em HTTP sem gerenciamento de infraestrutura. Use quando: qstash, fila upstash, cron sem servidor, agendamento...",
  "Guides and best practices for working with Neon Serverless Postgres. Covers getting started, local development with Neon, choosing a connection method, Neon features, authentication (@neondatabase/...": "Guias e práticas recomendadas para trabalhar com Neon Serverless Postgres. Abrange os primeiros passos, desenvolvimento local com Neon, escolha de um método de conexão, recursos do Neon, autenticação (@neondatabase/...",
  "Use when about to claim work is complete, fixed, or passing, before committing or creating PRs - requires running verification commands and confirming output before making any success claims; evide...": "Use quando estiver prestes a declarar que o trabalho foi concluído, corrigido ou aprovado, antes de confirmar ou criar PRs - requer a execução de comandos de verificação e a confirmação da saída antes de fazer qualquer declaração de sucesso; evidenciar...",
  "Expert knowledge for deploying to Vercel with Next.js Use when: vercel, deploy, deployment, hosting, production.": "Conhecimento especializado para implantação em Vercel com Next.js Use quando: vercel, implantação, implantação, hospedagem, produção.",
  "Vector-powered CLI for semantic file search with a Claude/Codex skill": "CLI com tecnologia vetorial para pesquisa semântica de arquivos com habilidade Claude/Codex",
  "Use when starting feature work that needs isolation from current workspace or before executing implementation plans - creates isolated git worktrees with smart directory selection and safety verifi...": "Use ao iniciar o trabalho de recursos que precisam de isolamento do espaço de trabalho atual ou antes de executar planos de implementação - cria árvores de trabalho git isoladas com seleção inteligente de diretório e verificação de segurança...",
  "Deploy applications and websites to Vercel. Use this skill when the user requests deployment actions such as 'Deploy my app', 'Deploy this to production', 'Create a preview deployment', 'Deploy and...": "Implante aplicativos e sites no Vercel. Use esta habilidade quando o usuário solicitar ações de implantação, como 'Implantar meu aplicativo', 'Implantar isto na produção', 'Criar uma implantação de visualização', 'Implantar e...",
  "Build real-time conversational AI voice engines using async worker pipelines, streaming transcription, LLM agents, and TTS synthesis with interrupt handling and multi-provider support": "Crie mecanismos de voz de IA conversacional em tempo real usando pipelines de trabalho assíncronos, transcrição de streaming, agentes LLM e síntese TTS com tratamento de interrupções e suporte a vários provedores",
  "Voice agents represent the frontier of AI interaction - humans speaking naturally with AI systems. The challenge isn't just speech recognition and synthesis, it's achieving natural conversation flo...": "Os agentes de voz representam a fronteira da interação da IA ​​– humanos falando naturalmente com sistemas de IA. O desafio não é apenas o reconhecimento e a síntese de fala, é conseguir um fluxo de conversação natural...",
  "Expert in building shareable generator tools that go viral - name generators, quiz makers, avatar creators, personality tests, and calculator tools. Covers the psychology of sharing, viral mechanic...": "Especialista na construção de ferramentas geradoras compartilháveis ​​que se tornam virais - geradores de nomes, criadores de questionários, criadores de avatares, testes de personalidade e ferramentas de calculadora. Abrange a psicologia do compartilhamento, mecânica viral...",
  "Advanced vulnerability analysis principles. OWASP 2025, Supply Chain Security, attack surface mapping, risk prioritization.": "Princípios avançados de análise de vulnerabilidade. OWASP 2025, Segurança da Cadeia de Suprimentos, mapeamento de superfícies de ataque, priorização de riscos.",
  "Suite of tools for creating elaborate, multi-component claude.ai HTML artifacts using modern frontend web technologies (React, Tailwind CSS, shadcn/ui). Use for complex artifacts requiring state ma...": "Conjunto de ferramentas para criar artefatos HTML claude.ai elaborados e multicomponentes usando tecnologias modernas de front-end da web (React, Tailwind CSS, shadcn/ui). Use para artefatos complexos que exigem ma...",
  "Conduct WCAG 2.2 accessibility audits with automated testing, manual verification, and remediation guidance. Use when auditing websites for accessibility, fixing WCAG violations, or implementing ac...": "Conduza auditorias de acessibilidade WCAG 2.2 com testes automatizados, verificação manual e orientações de correção. Use ao auditar sites quanto à acessibilidade, corrigir violações das WCAG ou implementar ac...",
  "Expert in building voice AI applications - from real-time voice agents to voice-enabled apps. Covers OpenAI Realtime API, Vapi for voice agents, Deepgram for transcription, ElevenLabs for synthesis...": "Especialista na construção de aplicativos de IA de voz – desde agentes de voz em tempo real até aplicativos habilitados para voz. Abrange OpenAI Realtime API, Vapi para agentes de voz, Deepgram para transcrição, ElevenLabs para síntese...",
  "Review UI code for Web Interface Guidelines compliance. Use when asked to \\\"review my UI\\\", \\\"check accessibility\\\", \\\"audit design\\\", \\\"review UX\\\", or \\\"check my site aga...": "Revise o código da IU para conformidade com as Diretrizes de Interface da Web. Use quando solicitado a \\\"revisar minha UI\\\", \\\"verificar acessibilidade\\\", \\\"auditar design\\\", \\\"revisar UX\\\" ou \\\"verificar meu site novamente...",
  "Optimize website and web application performance including loading speed, Core Web Vitals, bundle size, caching strategies, and runtime performance": "Otimize o desempenho de sites e aplicativos web, incluindo velocidade de carregamento, Core Web Vitals, tamanho do pacote, estratégias de cache e desempenho em tempo de execução",
  "Analyzes git commit history and generates structured changelogs categorized by change type. Use when the user asks about recent changes, wants a changelog, or needs to understand what changed in th...": "Analisa o histórico de commits do git e gera changelogs estruturados categorizados por tipo de mudança. Use quando o usuário perguntar sobre alterações recentes, desejar um changelog ou precisar entender o que mudou no...",
  "Generates rich technical documentation pages with dark-mode Mermaid diagrams, source code citations, and first-principles depth. Use when writing documentation, generating wiki pages, creating tech...": "Gera páginas ricas de documentação técnica com diagramas Mermaid em modo escuro, citações de código-fonte e profundidade de primeiros princípios. Use ao escrever documentação, gerar páginas wiki, criar tecnologia...",
  "Test smart contracts comprehensively using Hardhat and Foundry with unit tests, integration tests, and mainnet forking. Use when testing Solidity contracts, setting up blockchain test suites, or va...": "Teste contratos inteligentes de forma abrangente usando Hardhat e Foundry com testes unitários, testes de integração e bifurcação de rede principal. Use ao testar contratos do Solidity, configurar suítes de testes de blockchain ou v...",
  "Automate Webflow CMS collections, site publishing, page management, asset uploads, and ecommerce orders via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize coleções de Webflow CMS, publicação de sites, gerenciamento de páginas, uploads de ativos e pedidos de comércio eletrônico por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Web application security testing workflow for OWASP Top 10 vulnerabilities including injection, XSS, authentication flaws, and access control issues.": "Fluxo de trabalho de teste de segurança de aplicativos da Web para as 10 principais vulnerabilidades do OWASP, incluindo injeção, XSS, falhas de autenticação e problemas de controle de acesso.",
  "Packages generated wiki Markdown into a VitePress static site with dark theme, dark-mode Mermaid diagrams with click-to-zoom, and production build output. Use when the user wants to create a browsa...": "Pacotes gerados wiki Markdown em um site estático VitePress com tema escuro, diagramas Mermaid em modo escuro com clique para ampliar e saída de construção de produção. Use quando o usuário quiser criar uma navegação...",
  "Toolkit for interacting with and testing local web applications using Playwright. Supports verifying frontend functionality, debugging UI behavior, capturing browser screenshots, and viewing browse...": "Kit de ferramentas para interagir e testar aplicativos da web locais usando Playwright. Suporta verificação da funcionalidade do front-end, depuração do comportamento da interface do usuário, captura de capturas de tela do navegador e visualização do navegador...",
  "Complete WordPress development workflow covering theme development, plugin creation, WooCommerce integration, performance optimization, and security hardening.": "Fluxo de trabalho completo de desenvolvimento em WordPress, abrangendo desenvolvimento de temas, criação de plug-ins, integração com WooCommerce, otimização de desempenho e reforço de segurança.",
  "Answers questions about a code repository using source file analysis. Use when the user asks a question about how something works, wants to understand a component, or needs help navigating the code...": "Responde a perguntas sobre um repositório de código usando análise de arquivo de origem. Use quando o usuário fizer uma pergunta sobre como algo funciona, quiser entender um componente ou precisar de ajuda para navegar no código...",
  "Analyzes code repositories and generates hierarchical documentation structures with onboarding guides. Use when the user wants to create a wiki, generate documentation, map a codebase structure, or...": "Analisa repositórios de código e gera estruturas hierárquicas de documentação com guias de integração. Use quando o usuário quiser criar um wiki, gerar documentação, mapear uma estrutura de base de código ou...",
  "Conducts multi-turn iterative deep research on specific topics within a codebase with zero tolerance for shallow analysis. Use when the user wants an in-depth investigation, needs to understand how...": "Conduz pesquisas profundas iterativas em vários turnos sobre tópicos específicos em uma base de código com tolerância zero para análises superficiais. Use quando o usuário deseja uma investigação aprofundada, precisa entender como...",
  "This skill should be used when the user asks to \"escalate privileges on Windows,\" \"find Windows privesc vectors,\" \"enumerate Windows for privilege escalation,\" \"exploit Windows miscon...": "Esta habilidade deve ser usada quando o usuário pede para \"escalar privilégios no Windows\", \"encontrar vetores privados do Windows\", \"enumerar o Windows para escalonamento de privilégios\", \"explorar o mau uso do Windows...",
  "WordPress plugin development workflow covering plugin architecture, hooks, admin interfaces, REST API, and security best practices.": "Fluxo de trabalho de desenvolvimento de plugins WordPress cobrindo arquitetura de plugins, ganchos, interfaces administrativas, API REST e práticas recomendadas de segurança.",
  "WordPress theme development workflow covering theme architecture, template hierarchy, custom post types, block editor support, and responsive design.": "Fluxo de trabalho de desenvolvimento de tema WordPress cobrindo arquitetura de tema, hierarquia de modelos, tipos de postagem personalizados, suporte a editor de blocos e design responsivo.",
  "WooCommerce store development workflow covering store setup, payment integration, shipping configuration, and customization.": "Fluxo de trabalho de desenvolvimento de loja WooCommerce cobrindo configuração de loja, integração de pagamento, configuração de envio e personalização.",
  "Automate WhatsApp Business tasks via Rube MCP (Composio): send messages, manage templates, upload media, and handle contacts. Always search tools first for current schemas.": "Automatize tarefas do WhatsApp Business via Rube MCP (Composio): envie mensagens, gerencie modelos, carregue mídia e gerencie contatos. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Generates two complementary onboarding guides — a Principal-Level architectural deep-dive and a Zero-to-Hero contributor walkthrough. Use when the user wants onboarding documentation fo...": "Gera dois guias de integração complementares: um aprofundamento arquitetônico de nível principal e um passo a passo do contribuidor Zero to Hero. Use quando o usuário desejar documentação de integração para...",
  "Use this skill when implementing tasks according to Conductor's TDD": "Use esta habilidade ao implementar tarefas de acordo com o TDD do Conductor",
  "Use when you have a spec or requirements for a multi-step task, before touching code": "Use quando você tiver especificações ou requisitos para uma tarefa de várias etapas, antes de tocar no código",
  "Use when creating, updating, or improving agent skills.": "Use ao criar, atualizar ou melhorar as habilidades do agente.",
  "This skill should be used when the user asks to \"analyze network traffic with Wireshark\", \"capture packets for troubleshooting\", \"filter PCAP files\", \"follow TCP/UDP streams\", \"dete...": "Esta habilidade deve ser usada quando o usuário pede para \"analisar o tráfego de rede com Wireshark\", \"capturar pacotes para solução de problemas\", \"filtrar arquivos PCAP\", \"seguir fluxos TCP/UDP\", \"detetar...",
  "This skill should be used when the user asks to \"pentest WordPress sites\", \"scan WordPress for vulnerabilities\", \"enumerate WordPress users, themes, or plugins\", \"exploit WordPress vu...": "Esta habilidade deve ser usada quando o usuário pede para \"pentestar sites WordPress\", \"verificar vulnerabilidades no WordPress\", \"enumerar usuários, temas ou plug-ins do WordPress\", \"explorar o WordPress vu...",
  "Publish articles to X/Twitter": "Publique artigos no X/Twitter",
  "Comprehensive spreadsheet creation, editing, and analysis with support for formulas, formatting, data analysis, and visualization. When Claude needs to work with spreadsheets (.xlsx, .xlsm, .csv, ....": "Criação, edição e análise abrangente de planilhas com suporte para fórmulas, formatação, análise de dados e visualização. Quando Claude precisa trabalhar com planilhas (.xlsx, .xlsm, .csv, ....",
  "Workflow automation is the infrastructure that makes AI agents reliable. Without durable execution, a network hiccup during a 10-step payment flow means lost money and angry customers. With it, wor...": "A automação do fluxo de trabalho é a infraestrutura que torna os agentes de IA confiáveis. Sem uma execução durável, um problema de rede durante um fluxo de pagamento de 10 etapas significa perda de dinheiro e clientes irritados. Com isso, v...",
  "Design durable workflows with Temporal for distributed systems. Covers workflow vs activity separation, saga patterns, state management, and determinism constraints. Use when building long-running ...": "Projete fluxos de trabalho duráveis ​​com Temporal para sistemas distribuídos. Abrange fluxo de trabalho versus separação de atividades, padrões de saga, gerenciamento de estado e restrições de determinismo. Use ao construir longa duração ...",
  "Automate Wrike project management via Rube MCP (Composio): create tasks/folders, manage projects, assign work, and track progress. Always search tools first for current schemas.": "Automatize o gerenciamento de projetos do Wrike por meio do Rube MCP (Composio): crie tarefas/pastas, gerencie projetos, atribua trabalhos e acompanhe o progresso. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Extract transcripts from YouTube videos and generate comprehensive, detailed summaries using intelligent analysis frameworks": "Extraia transcrições de vídeos do YouTube e gere resumos abrangentes e detalhados usando estruturas de análise inteligentes",
  "Automate YouTube tasks via Rube MCP (Composio): upload videos, manage playlists, search content, get analytics, and handle comments. Always search tools first for current schemas.": "Automatize tarefas do YouTube por meio do Rube MCP (Composio): envie vídeos, gerencie playlists, pesquise conteúdo, obtenha análises e gerencie comentários. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "No-code automation democratizes workflow building. Zapier and Make (formerly Integromat) let non-developers automate business processes without writing code. But no-code doesn't mean no-complexity ...": "A automação sem código democratiza a construção do fluxo de trabalho. Zapier e Make (anteriormente Integromat) permitem que não desenvolvedores automatizem processos de negócios sem escrever código. Mas nenhum código não significa nenhuma complexidade...",
  "Create Zustand stores with TypeScript, subscribeWithSelector middleware, and proper state/action separation. Use when building React state management, creating global stores, or implementing reacti...": "Crie lojas Zustand com TypeScript, middleware subscribeWithSelector e separação adequada de estado/ação. Use ao construir o gerenciamento de estado do React, criar lojas globais ou implementar...",
  "Automate Zendesk tasks via Rube MCP (Composio): tickets, users, organizations, replies. Always search tools first for current schemas.": "Automatize tarefas do Zendesk via Rube MCP (Composio): tickets, usuários, organizações, respostas. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "This skill should be used when the user asks to \"test for XSS vulnerabilities\", \"perform cross-site scripting attacks\", \"identify HTML injection flaws\", \"exploit client-side injection...": "Esta habilidade deve ser usada quando o usuário pede para \"testar vulnerabilidades XSS\", \"realizar ataques de script entre sites\", \"identificar falhas de injeção de HTML\", \"explorar a injeção do lado do cliente...",
  "Automate Zoho CRM tasks via Rube MCP (Composio): create/update records, search contacts, manage leads, and convert leads. Always search tools first for current schemas.": "Automatize tarefas do Zoho CRM via Rube MCP (Composio): crie/atualize registros, pesquise contatos, gerencie leads e converta leads. Sempre pesquise primeiro nas ferramentas os esquemas atuais.",
  "Automate Zoom meeting creation, management, recordings, webinars, and participant tracking via Rube MCP (Composio). Always search tools first for current schemas.": "Automatize a criação, gerenciamento, gravações, webinars e rastreamento de participantes de reuniões do Zoom por meio do Rube MCP (Composio). Sempre pesquise primeiro nas ferramentas os esquemas atuais."
}